said
gun
state
would
law
year
new
marriage
people
one
bill
right
court
u
immigration
say
president
immigrant
federal
last
gay
city
could
tobacco
house
samesex
also
issue
ban
american
change
two
country
national
group
time
climate
many
united
republican
weapon
percent
control
week
school
mr
public
day
make
first
illegal
official
senate
smoking
government
firearm
county
even
amendment
million
like
legal
couple
support
case
get
company
global
measure
may
nation
vote
month
child
cigarette
congress
warming
shooting
health
legislation
way
take
want
police
washington
york
since
california
emission
member
check
policy
rifle
including
show
florida
gas
come
dont
decision
administration
plan
work
program
need
association
family
three
made
report
violence
industry
judge
democrat
political
part
campaign
much
today
number
bush
background
debate
whether
action
attorney
union
handgun
study
second
department
effort
leader
general
go
world
use
obama
supreme
life
according
crime
tuesday
sale
woman
district
nra
think
among
home
service
back
center
carbon
high
student
criminal
next
citizen
another
wednesday
still
act
proposal
clinton
office
used
going
worker
monday
thursday
without
well
local
business
problem
tax
university
help
passed
permit
benefit
long
border
know
america
called
ruling
committee
assault
greenhouse
effect
place
news
already
community
energy
found
lawmaker
agency
white
advocate
every
justice
man
system
civil
power
told
ago
trump
enforcement
must
question
gov
call
recent
owner
voter
friday
carry
area
sen
put
record
appeal
good
keep
several
former
see
allow
smoker
security
smoke
job
yesterday
death
least
church
money
license
san
become
thing
increase
others
legislature
level
might
scientist
thats
cost
five
four
le
lawsuit
rule
john
across
director
came
mayor
executive
research
end
give
safety
virginia
billion
past
council
governor
around
far
democratic
set
point
likely
environmental
stop
major
believe
lawyer
authority
resident
officer
senator
conservative
mass
constitutional
never
little
rep
march
order
proposed
saying
st
nearly
majority
party
force
colorado
election
organization
fact
georgia
human
concealed
protection
killed
asked
yet
away
step
reduce
conference
guncontrol
side
regulation
took
meeting
face
expected
dioxide
constitution
trying
approved
purchase
pas
six
enough
similar
mean
decade
cause
sign
left
period
move
supporter
statement
domestic
though
pay
partner
rate
making
result
chief
plant
candidate
limit
person
voted
hand
care
important
restriction
however
something
cut
social
stand
lesbian
street
im
let
reason
individual
thousand
find
arm
buy
employee
temperature
big
married
men
look
line
dealer
protect
texas
air
hearing
opponent
drug
deal
allowed
status
attack
letter
young
clear
board
later
lead
released
shot
announced
fight
north
argument
claim
whose
poll
mexico
doesnt
bar
product
idea
legally
require
better
hope
undocumented
got
reform
international
taking
charge
car
challenge
defense
held
risk
agreement
position
event
spokesman
history
june
filed
building
maryland
parent
night
view
talk
matter
lot
future
almost
agent
began
along
nothing
didnt
ad
able
hour
cancer
within
current
presidential
brady
earlier
often
science
jersey
recently
waiting
instead
store
cant
deportation
visa
based
south
restaurant
fuel
taken
prevent
legislative
activist
college
known
early
process
wrote
concern
private
anyone
include
fear
using
lobby
working
really
victim
society
open
threat
sunday
document
there
panel
black
real
toward
top
economic
mexican
bear
illegally
ground
outside
address
half
continue
response
live
kind
massachusetts
getting
small
provision
provide
word
economy
data
although
hold
given
done
population
run
signed
evidence
age
park
water
large
different
minnesota
list
information
representative
issued
impact
earth
citizenship
largest
atlanta
head
marry
free
ordinance
west
name
missouri
start
alien
seeking
hundred
post
war
session
led
term
opinion
ever
required
best
favor
michael
cannot
standard
food
theyre
mother
coming
despite
interest
target
ice
interview
francisco
attempt
fire
price
press
george
went
suit
congressional
beach
try
proposition
fund
expert
settlement
comment
dozen
turn
r
market
ballot
rather
foreign
added
great
growing
friend
july
initiative
david
someone
story
disease
louis
strong
reported
consider
begin
message
offer
saturday
november
ruled
source
feel
education
failed
possible
wont
adult
kid
allowing
became
secretary
full
late
brought
example
sense
goal
banning
legislator
arizona
town
mark
hard
needed
medical
certain
average
april
sell
fall
chairman
close
agreed
opposed
terrorist
rise
special
key
bring
latest
gop
naturalization
sent
massacre
higher
chance
obamas
project
meet
soon
tell
battle
access
final
refugee
researcher
card
sea
magazine
seven
politician
together
degree
thought
semiautomatic
charged
wanted
isnt
always
seek
serious
capitol
politics
philip
push
increased
living
review
opposition
commission
per
seen
decided
sheriff
sure
bureau
common
killing
movement
application
wrong
form
longer
leading
dc
received
speech
kill
in
demand
significant
vice
oil
morris
lost
arrested
editor
he
ownership
nicotine
buyer
technology
military
hispanic
natural
institute
morning
relationship
old
amount
behind
potential
freedom
coal
article
answer
brown
circuit
annual
dangerous
spent
james
religious
lung
environment
subject
summer
read
raise
robert
employer
near
century
budget
especially
course
stay
mental
murder
return
lower
finding
manufacturer
language
father
bad
prison
supported
paper
maker
atmosphere
anything
son
m
belief
front
approach
coalition
trial
island
paul
survey
probably
role
ask
either
eight
campus
simply
heart
armed
seems
died
attention
focus
carrying
race
opportunity
convicted
heat
grant
sold
professor
clean
estimated
wife
pennsylvania
equality
safe
share
los
carolina
calling
light
room
create
pollution
denver
assembly
gave
illinois
rally
leave
available
nationwide
request
apply
responsible
medium
rising
vehicle
turned
speaker
requires
weather
agree
yes
decide
love
solution
considered
actually
ammunition
china
commissioner
violent
central
tried
damage
recognize
personal
green
argued
committed
wedding
dead
short
included
teacher
difficult
bloomberg
particularly
victory
spring
third
approval
scientific
allows
investigation
hospital
requirement
floor
sept
requiring
dollar
started
chicago
labor
caused
banned
j
joined
angeles
passage
treaty
advertising
pack
ceremony
site
everyone
figure
gore
activity
helped
buying
editorial
showed
protest
danger
driver
scheduled
trade
resource
scott
mile
liberal
pressure
fbi
denied
release
powerful
heard
quickly
looking
rejected
smith
following
ill
firm
land
remain
hear
antismoking
insurance
designed
introduced
class
jan
true
hall
newtown
unconstitutional
region
block
involved
reduction
sponsor
elected
pistol
arrest
connecticut
perhaps
la
jail
includes
changed
accused
jr
weve
difference
quit
agenda
choice
reducing
created
richard
single
running
win
offered
book
property
cigar
hill
version
tough
worked
aimed
staff
nine
senior
drive
minor
discussion
kyoto
bay
convention
existing
warning
dr
boy
possession
reach
series
southern
airport
door
reached
oppose
equal
ocean
total
beyond
parkland
understand
miami
development
moment
lawabiding
usa
palm
critic
fee
concerned
condition
fine
penalty
asylum
published
philadelphia
road
practice
giving
prosecutor
fossil
model
w
shop
english
raised
produce
range
test
sought
donald
patrol
tragedy
january
latino
responsibility
spokeswoman
field
value
deadly
teenager
due
jury
bipartisan
homeland
biggest
spending
december
play
compromise
alcohol
customer
regulate
farmer
author
commitment
greater
refused
happen
operation
struck
team
william
forward
controversial
immediately
trend
thomas
husband
licensed
youre
type
martin
planet
columbia
increasing
break
tom
bullet
save
easy
fla
mostly
voting
comprehensive
estimate
join
asking
necessary
seem
declined
youth
selling
partnership
affect
rest
effective
reporter
moved
guard
sandy
violation
intended
felon
epa
stock
growth
institution
wake
prevention
wait
mind
purpose
primary
paid
stricter
expect
consequence
granted
additional
add
discrimination
voice
loophole
account
shift
custom
sponsored
ability
body
happened
stopped
heterosexual
else
forced
east
joe
bob
illness
financial
promise
leadership
watch
crowd
arent
judiciary
considering
club
associated
met
alone
tougher
analysis
machine
chamber
defend
lack
spoke
written
present
compared
appears
ordered
feb
journal
permanent
minute
talking
noted
reasonable
middle
training
strategy
charles
catholic
hit
statewide
foot
socalled
largely
holding
ive
wall
urged
resolution
avoid
page
temporary
weekend
inside
elementary
speak
douglas
jose
saw
visit
applicant
previous
aid
vermont
veto
specific
traditional
appeared
follow
round
beginning
remains
barack
send
doubt
declared
daughter
moving
huge
dec
conn
jim
unless
package
changing
curb
popular
guy
main
wasnt
secondhand
coast
homosexual
el
video
continued
facility
announcement
foundation
relative
forest
oct
wouldnt
broad
poor
television
liberty
selfdefense
gunman
teen
argue
writer
whats
suspect
hook
cuban
manager
cover
followed
space
highest
gone
consumer
credit
everything
v
enforce
minister
recognition
pending
build
generation
priority
pushing
tampa
clearly
advocacy
detention
homicide
addition
neighborhood
enacted
extreme
adopted
inc
experience
certainly
email
receive
fighting
separate
repeal
situation
facing
nov
daily
reality
column
funding
treatment
sex
developing
finally
speaking
limited
loss
starting
spend
fellow
deported
deputy
l
provided
reagan
piece
gang
expand
opened
movie
online
drought
plaintiff
willing
simple
file
note
suggested
throughout
deny
focused
easier
lobbyist
accept
proponent
path
culture
wave
sometimes
supporting
low
whole
appear
incident
showing
increasingly
petition
doctor
reynolds
vega
al
passing
clerk
minority
co
factor
guilty
planned
february
obtain
e
pm
santa
progress
driving
sound
legalize
die
recognized
hunting
manhattan
electricity
ahead
truck
bought
apparently
christian
historic
count
ready
prove
standing
lobbying
raising
european
harm
cuomo
felony
adding
capital
brother
wind
statistic
related
enter
shooter
truth
king
basic
brooklyn
currently
brand
promised
burning
fewer
station
lose
revenue
track
ended
computer
dropped
worth
northern
prohibit
keeping
otherwise
detail
kept
wisconsin
spouse
bank
maybe
colleague
backed
mom
overall
critical
calif
sued
believed
canada
native
leaving
negotiation
game
cap
discus
seemed
respect
born
caught
kennedy
seat
rev
august
delay
knew
chinese
conviction
becoming
conducted
defeat
entire
farm
fired
previously
described
success
valley
hurt
determine
nature
meanwhile
elsewhere
produced
eye
section
sexual
basis
particular
sentence
neither
atmospheric
decline
habit
amnesty
gain
tv
travel
endorsed
alternative
ten
god
approve
failure
mike
marketing
serve
shotgun
haitian
influence
hurricane
base
antigun
threatened
columbine
assistant
production
expressed
storm
hillary
contract
task
newspaper
romney
cited
radio
strict
terrorism
felt
restrict
tree
prohibited
eligible
complaint
statute
putting
sport
mandatory
worry
september
lock
drop
organizer
named
politically
season
aug
warned
boston
arrived
crisis
option
suicide
represents
suggest
offering
ohio
october
ensure
generally
date
holder
potentially
suspected
definition
abuse
upon
smokefree
eventually
impose
safer
militia
none
contribution
conclusion
landmark
brief
behalf
housing
learn
delegate
image
exactly
sort
pushed
afternoon
table
dream
twice
shouldnt
gathered
welfare
worst
emergency
criticism
utility
supply
device
jurisdiction
highly
lived
progun
renewable
b
aide
nuclear
arctic
continues
chris
de
various
host
fair
income
orlando
easily
openly
mentally
provides
ally
providing
utah
hotel
migrant
flood
regarding
enact
sweeping
id
c
immediate
andrew
concluded
cruz
iowa
served
virtually
trigger
winter
queen
worse
stage
phone
johnson
fully
couldnt
f
shoot
opposes
remark
wounded
stoneman
smoked
planning
suggests
cold
hawaii
involving
blame
except
division
strongly
walk
indeed
network
pattern
protecting
helping
picture
specifically
trip
veteran
japan
longterm
un
commercial
oregon
fox
rick
drew
flight
registration
western
pretty
signature
wilson
red
wed
gunrights
carried
conduct
taxpayer
hire
extend
false
abortion
straight
patient
referendum
predicted
moral
returned
arguing
meant
davis
quite
rose
choose
tie
guarantee
unlikely
stronger
criticized
neighbor
sander
larger
affair
ton
creating
solar
turning
advance
girl
exchange
upheld
independent
stance
opening
census
leaf
workplace
summit
urging
behavior
here
percentage
consensus
methane
secure
bishop
complete
draw
vowed
improve
ran
represent
telling
determined
stood
marjory
opposing
learned
strike
joseph
entered
promote
wage
concealedcarry
flow
amid
bringing
nonprofit
nonsmoker
limiting
conversation
aim
emotional
miller
india
instance
testimony
applied
combat
welcome
guest
cent
maine
rural
retired
search
web
survivor
urban
injury
setting
respond
original
organized
lake
steve
photo
linked
thinking
coverage
link
supposed
spot
wish
cutting
directly
acknowledged
reaction
roughly
environmentalist
divided
visitor
reelection
analyst
performed
minimum
hot
topic
effectively
affected
prospect
dispute
cuba
defendant
draft
shown
commit
occurred
happens
fraud
cross
violated
challenged
deep
feeling
ultimately
investigator
custody
fell
publicly
vast
sue
army
prohibits
placed
witness
michigan
repeatedly
europe
developed
bond
seriously
employment
bus
schumer
mountain
edward
faced
hasnt
complex
registered
pastor
detained
whatever
successful
losing
protocol
mention
happening
judicial
database
industrial
christie
register
regardless
direct
obtained
household
worried
alaska
transportation
relation
licensing
heavily
owned
fda
fundamental
unit
stephen
adopt
reading
nominee
rubio
reduced
folk
regional
loaded
baby
montgomery
slow
unusual
usually
encourage
issuing
automatic
lapierre
commerce
paying
faith
construction
refuse
principle
prominent
acting
killer
pledge
passenger
widely
bit
forum
barred
peter
supervisor
possibility
harder
surprise
instant
frank
agriculture
thus
intent
internet
deport
corporation
meaning
challenging
identification
residency
worldwide
paris
gathering
sister
downtown
universal
walker
specie
claimed
expanded
protected
albany
blue
pointed
severe
williams
theyve
aggressive
league
valid
protester
significantly
explain
dramatic
consideration
mccain
older
dealing
closed
prepared
looked
launched
prompted
seller
smuggling
massive
anywhere
proof
ought
aside
presented
scene
mandate
efficiency
investment
crop
retailer
treated
relatively
broader
attend
shall
headed
pick
volunteer
causing
contribute
thanks
hoping
representing
attitude
spread
quality
innocent
exception
prohibition
fix
adviser
obvious
cash
adam
filing
wayne
pledged
develop
blocked
endorsement
atf
writing
possibly
becomes
metro
established
remove
joint
