said
gun
would
state
new
states
people
court
law
one
marriage
death
bill
immigration
federal
us
last
years
guns
two
gay
tobacco
samesex
year
also
could
mr
immigrants
president
house
ban
laws
national
many
first
rights
county
control
city
illegal
public
time
legal
case
united
weapons
smoking
police
right
senate
issue
school
percent
penalty
say
even
amendment
country
week
supreme
may
like
make
officials
get
judge
support
since
couples
three
legislation
firearms
american
children
government
health
congress
group
million
attorney
vote
york
florida
washington
day
whether
decision
man
including
dont
republican
violence
says
made
take
way
shooting
district
life
members
murder
second
background
tuesday
association
found
without
want
political
another
general
wednesday
california
today
rifle
monday
thursday
measure
used
told
campaign
high
gov
debate
back
use
work
crime
department
according
justice
among
office
ruling
still
think
home
going
americans
much
passed
part
republicans
nra
ago
month
trial
assault
next
friday
convicted
local
civil
enforcement
yesterday
family
former
policy
called
groups
long
killed
days
checks
number
go
four
appeals
news
workers
industry
must
put
carry
well
act
lawmakers
every
courts
system
democrats
cigarette
need
obama
five
prison
several
come
already
white
cases
allow
companies
citizens
committee
help
execution
defense
san
center
know
cigarettes
program
jury
john
border
recent
students
administration
voters
clinton
came
months
money
st
asked
keep
others
bush
advocates
least
security
sen
sales
benefits
criminal
action
smoke
lawyers
virginia
good
never
might
become
capital
marriages
constitutional
show
men
safety
woman
nations
see
thats
report
across
trump
smokers
legislature
sentence
democratic
took
saying
university
texas
owners
killing
change
march
america
shot
georgia
stop
director
believe
prosecutors
nearly
service
handgun
issues
proposal
mass
majority
left
concealed
immigrant
six
church
later
end
times
less
business
rep
governor
leaders
little
set
study
place
away
plan
council
around
far
likely
weeks
evidence
trying
executive
community
approved
guncontrol
past
unions
hearing
punishment
measures
women
order
voted
give
mayor
company
filed
tax
constitution
im
allowed
proposed
young
similar
yet
whose
person
pass
though
shows
expected
attorneys
nation
enough
appeal
domestic
victims
row
shootings
question
check
supporters
held
married
effect
social
handguns
lives
drug
charged
however
care
face
pay
didnt
bills
authorities
making
night
call
status
got
residents
june
something
charges
crimes
families
union
colorado
major
schools
board
spokesman
restrictions
began
hours
billion
chief
earlier
north
effort
stand
protect
undocumented
wrote
lawsuit
circuit
statement
legally
buy
permit
officers
criminals
lawyer
announced
world
point
efforts
ruled
force
find
anyone
fact
doesnt
sentenced
outside
problem
process
clear
period
thousands
scheduled
move
early
maryland
waiting
louis
black
conference
important
almost
guilty
area
opponents
increase
within
history
nothing
missouri
firearm
brady
able
judges
taking
often
legislative
weapon
mexico
taken
michael
instead
party
conservative
election
given
reform
seeking
cancer
require
cant
released
permits
arms
south
better
prevent
employees
parents
private
jersey
cities
licenses
along
big
recently
went
illegally
based
fight
dealers
meeting
deal
signed
stay
human
research
known
information
die
wants
services
look
presidential
although
live
letter
issued
using
someone
atlanta
david
r
officer
done
marry
citizenship
reason
provide
consider
really
let
executed
james
free
seek
society
mother
include
arrested
makes
mental
current
massachusetts
sunday
cannot
beach
failed
working
april
died
kill
decided
open
became
deportation
medical
july
getting
thing
wanted
different
plans
led
hands
theres
agents
matter
accused
agency
lot
college
seven
comes
sent
despite
toward
george
votes
lesbian
review
required
press
record
continue
illinois
rules
job
lobby
ever
robert
sign
francisco
jobs
inmates
west
leader
proposition
agreed
rifles
small
allowing
member
age
full
brought
theyre
senator
received
tried
license
head
added
organization
november
morning
hold
final
line
opposed
lead
wife
opinion
idea
fire
possible
dead
banning
decide
late
democrat
ballot
settlement
sale
war
power
top
half
rather
education
deaths
records
calls
problems
side
cause
bear
saturday
position
street
things
justices
minnesota
hope
access
try
best
spent
step
means
special
protection
hes
argued
bans
questions
wont
lethal
committed
congressional
naturalization
fear
documents
wrong
near
jr
real
mexican
foreign
executions
favor
reported
list
bring
large
old
response
sense
ms
international
father
certain
strong
programs
son
kind
ask
attack
child
couple
rejected
panel
philip
countries
semiautomatic
purchases
paul
official
session
denied
kids
result
coming
armed
lost
great
morris
opposition
feel
soon
mark
close
eight
gave
sept
needed
living
religious
legislators
military
latest
always
population
jurors
j
largest
arguments
cost
governments
ins
turned
hundreds
massacre
sure
behind
arizona
products
william
ownership
partners
aliens
areas
hard
common
capitol
bureau
nicotine
risk
gop
carrying
citys
start
brown
hear
store
run
changes
challenge
unconstitutional
violent
post
interview
dc
food
rate
friends
future
politics
activists
richard
carolina
smith
heard
longer
key
third
growing
poll
candidates
taxes
isnt
injection
seen
together
supported
student
suit
proposals
bar
chairman
considered
costs
either
refused
ordinance
anything
commission
ground
thought
sides
regulations
pennsylvania
potential
nationwide
senators
showed
millions
numbers
attempt
car
park
apply
battle
message
places
bad
chance
request
tell
jail
serious
push
los
ill
sell
name
dangerous
agreement
equality
address
secretary
front
calling
jan
read
nine
rule
leave
assembly
bars
claim
argument
simply
ammunition
sold
purchase
begin
personal
town
allows
individuals
thomas
attention
ordered
especially
involved
philadelphia
individual
lawsuits
offer
building
freedom
claims
reduce
needs
safe
probably
talk
heart
banned
politicians
love
turn
restaurants
obamas
story
yes
available
movement
example
buyers
return
worked
subject
media
included
lower
partner
decades
seems
policies
chicago
angeles
disease
budget
joined
fbi
coalition
sought
recognize
charge
language
granted
palm
lung
candidate
offered
air
sentences
labor
mentally
leading
helped
race
attacks
annual
body
advertising
started
bloomberg
estimated
vice
changed
gays
requires
data
following
actually
scott
view
course
charles
floor
killer
visas
husband
words
passage
difficult
testimony
provision
adults
insurance
parole
responsible
significant
antismoking
approval
employers
newtown
room
authority
declined
elected
denver
higher
hall
possession
streets
interest
market
looking
role
central
fall
editor
quit
hill
cut
introduced
everyone
level
ads
january
investigation
martin
raised
buying
organizations
oppose
requiring
manufacturers
comment
experts
short
limit
conviction
economic
remain
grant
per
initiative
counties
running
communities
refugees
answer
pm
spokeswoman
create
agree
goes
particularly
island
article
struck
meet
alcohol
floridas
moved
asking
agencies
businesses
hispanic
lawabiding
speech
block
quickly
professor
editorial
event
parkland
english
increased
citizen
term
staff
threat
immediately
connecticut
giving
asylum
actions
ad
sheriffs
tough
perhaps
designed
feb
oct
single
bob
drugs
dozen
donald
pending
w
owner
ones
californias
concerns
powerful
deadly
focus
fla
victory
rally
stopped
survey
true
understand
series
ways
inside
includes
miami
decisions
minutes
dec
voting
innocent
form
green
win
assistant
property
licensed
raise
equal
paid
judiciary
murders
receive
reached
created
met
beyond
magazines
stores
restaurant
defendants
discrimination
share
visa
pressure
rates
inmate
representatives
makers
opportunity
daughter
applications
forced
centers
defend
hand
views
saw
patrol
trade
governors
happened
davis
nov
appeared
spending
bipartisan
considering
tom
youre
controversial
weve
written
speaker
amendments
unusual
terrorist
rest
watch
chair
necessary
pleaded
conservatives
light
takes
reasonable
polls
l
else
impact
easy
summer
intended
jose
joe
forward
selling
southern
homeland
regulation
demand
total
hospital
arrest
training
usa
speak
dollars
send
wasnt
decade
prosecutor
wake
statewide
temporary
release
douglas
ive
television
concerned
signs
effective
tampa
jim
noted
convention
spoke
declared
customs
compromise
east
avoid
approach
urged
additional
argue
provisions
eligible
prevention
sex
stricter
relatives
critics
sponsored
supports
aimed
oklahoma
version
wait
pack
fund
due
remains
elementary
carried
happen
permanent
dr
agenda
firstdegree
separate
facing
veto
present
trumps
reasons
reports
brooklyn
selfdefense
campus
highest
mean
practice
ability
teachers
caused
williams
robbery
sexual
conn
december
upheld
road
chamber
repeal
target
institute
associated
homes
senior
save
planned
steps
economy
seem
knew
e
spend
expect
secondhand
columbia
faces
fellow
bay
liberal
price
teenagers
existing
studies
date
fired
prove
popular
alone
follow
test
guard
wouldnt
relationship
miles
catholic
gone
presidents
impose
tougher
killings
followed
drive
sentencing
reach
finally
word
door
arent
february
concern
commissioner
lesbians
choice
felony
hook
moment
talking
ended
project
sandy
crowd
described
mostly
unless
traditional
comprehensive
detention
card
recognition
americas
apparently
class
continued
team
protest
tragedy
johnson
victim
financial
enforce
districts
enacted
elections
serve
results
deported
average
opened
witnesses
everything
provided
willing
appears
holding
gunman
kept
believes
obtain
terms
limits
cuomo
controls
verdict
determine
believed
airport
mind
vermont
middle
lines
treatment
file
socalled
previous
representative
easier
behalf
clearly
throughout
aug
brother
fair
king
events
limited
largely
primary
heterosexual
comments
greater
certainly
site
sometimes
reynolds
addition
petition
manhattan
deny
dropped
supporting
amnesty
drivers
expand
play
join
speaking
moving
sponsor
condemned
suggested
appear
lee
terrorists
hit
weekend
resolution
electric
santa
lack
daily
prohibit
august
youth
advocacy
legalize
accept
suspected
caught
wedding
ohio
enter
buildings
twice
adopted
afternoon
lets
fighting
resident
felons
ryan
break
cards
recognized
simple
v
passing
served
inc
applicants
kennedy
returned
october
friend
felt
seemed
leaving
vegas
standing
september
broad
wounded
rev
investigators
poor
pistol
terrorism
pushing
beginning
superior
video
plea
boy
previously
regulate
worker
born
funding
lived
compared
whats
doubt
gets
bought
las
minors
overturned
mike
hunting
named
involving
joseph
farmers
reporters
package
judicial
voice
penalties
currently
gives
cited
gang
range
customers
expressed
challenges
wilson
possibility
testified
ceremony
suspect
online
neither
abuse
maybe
ready
culture
responsibility
backed
column
goal
promised
c
showing
sued
conducted
fewer
keeping
biggest
defendant
lobbying
published
visit
spring
hearings
arrived
radio
nras
dozens
b
fine
prohibited
experience
barack
none
calif
lose
product
driving
researchers
papers
leadership
amount
announcement
basis
antigun
putting
focused
violated
offices
statistics
applied
adding
couldnt
custody
works
worth
columbine
delay
counts
manager
land
proponents
marketing
points
whole
approve
otherwise
names
main
departments
upon
starting
tv
discussion
wall
prosecution
difference
latino
deputy
mayors
finding
firm
orlando
ensure
path
bushs
becoming
threatened
arguing
hopes
reagan
wisconsin
minority
loophole
huge
basic
stood
churches
increasing
emotional
borders
smokefree
slaying
boston
counsel
sheriff
legislatures
elsewhere
cigar
bullets
standards
respect
plaintiffs
witness
facts
protections
statements
entered
forces
safer
situation
endorsed
related
native
shouldnt
discuss
god
mothers
restrict
commit
purpose
increasingly
generally
convictions
strict
represent
f
entire
opposes
romney
alleged
racial
housing
page
defeat
brief
illness
historic
rape
pushed
drew
openly
progun
shop
admitted
girl
foundation
conduct
knows
advocate
raising
machine
parts
benefit
courtroom
eventually
except
countrys
institution
definition
funds
chris
exactly
writer
ice
failure
ran
books
todays
retired
meanwhile
politically
smoked
jones
repeatedly
harris
false
wayne
relationships
stoneman
faced
doctors
worst
moral
requirements
particular
offering
learn
choose
easily
regarding
rick
critical
shoot
gathered
hillary
id
learned
specific
trigger
ahead
add
determined
represents
chinese
warning
queens
gunrights
montgomery
strongly
details
extend
low
welfare
stephen
highly
club
base
statute
phone
truth
application
apartment
field
causes
damages
claimed
miller
commitment
adult
providing
clintons
houses
hour
letters
cruz
hurt
fully
telling
build
opening
placed
registration
grounds
meant
persons
hire
virtually
abortion
army
enact
solution
wed
straight
levels
administrations
sweeping
census
standard
christian
emergency
el
success
cars
performed
red
homosexual
exchange
figure
barred
affect
serving
imposed
marjory
smoker
cruel
secure
danger
travel
boys
allen
provides
original
concealedcarry
resources
parties
neighborhood
suspects
operation
dealer
violations
shift
identified
specifically
iowa
complete
utah
movie
various
prisoners
steve
occurred
urging
walk
agent
drop
activist
criticized
prohibits
development
h
values
blood
analysis
vowed
cover
challenged
book
newspaper
opposing
orders
station
cash
arm
rural
campaigns
countys
supposed
co
partnership
killers
effects
referendum
magazine
minimum
murderer
grand
shown
amid
sanders
allegedly
helping
sister
fees
prompted
reality
fox
automatic
andrew
usually
requirement
presented
frank
injured
northern
task
suicide
influence
unlikely
fell
closed
warned
ronald
harm
divided
coast
sue
acknowledged
colleagues
section
journal
detained
murdered
technology
strategy
habit
obtained
walked
rulings
criticism
effectively
guy
piece
publicly
indeed
figures
employee
phase
circumstances
oregon
walker
intent
potentially
richmond
associations
schumer
cuba
damage
evening
bringing
attempted
anthony
consequences
aside
prince
violation
younger
rose
directly
dream
immediate
dna
clerk
reelection
fourth
organized
overall
protecting
teens
suggest
shooter
remarks
fraud
concluded
opponent
older
turning
coverage
bank
mexicans
va
successful
treated
interests
loaded
shall
acting
militia
division
licensing
homicides
cuban
cents
employment
pretty
violate
registered
shortly
changing
valley
search
mrs
attempts
revenue
conditions
bond
water
quite
owned
lapierre
source
hasnt
parks
appropriate
progress
thinking
rise
landmark
broken
looked
challenging
mandatory
pointed
angry
income
register
fort
homicide
regardless
kelly
issuing
behavior
incident
ultimately
albany
ought
aid
proof
organizers
representing
clemency
stage
deport
instant
fatal
continues
seat
n
identification
promise
valid
weddings
motion
happens
downtown
loss
hawaii
residency
table
lake
smuggling
ceremonies
percentage
prepared
welcome
scene
recommended
blacks
meaning
century
attend
blocked
protected
litigation
visitors
cross
ordinances
stocks
murdering
whatever
sort
fundamental
internet
remember
overturn
acts
type
traffic
stronger
unanimously
fee
dismissed
unable
decline
feet
planning
protesters
account
conspiracy
hotel
universal
canada
positions
pain
hoping
web
deathpenalty
anywhere
van
mary
paying
broke
improve
metro
peoples
filing
patients
respond
setting
author
de
faith
theyve
space
losing
sports
michigan
stance
highcapacity
questioned
affected
gain
credit
maine
nonsmokers
blame
blue
happy
hiring
count
harder
expanded
note
secret
al
legitimate
track
host
rampage
farm
thus
rare
findings
computer
contract
region
suffered
purchased
promote
refugee
paper
consideration
possibly
heavily
creating
responded
violates
defeated
cigars
fda
crisis
daniel
playing
relief
prevented
medicaid
indicated
headed
survivors
georgias
filled
growth
writing
seeks
trend
seriously
eyes
teacher
wish
sound
liberties
bump
closing
explain
types
larger
urban
truck
pulled
patrick
mom
stands
arrests
pick
crack
estimates
avenue
played
sending
email
attended
surprise
kansas
rounds
direct
dangers
database
longtime
relations
edward
worried
spouses
shops
appealed
neighbors
brian
suggests
reaction
curb
strike
telephone
vehicle
gas
taxpayers
removed
remained
folks
commissioners
gore
hired
corrections
fatally
trafficking
dan
firing
pistols
rubio
connection
citing
backing
ashcroft
multiple
becomes
priority
locks
factors
yorks
represented
addictive
g
receiving
requests
increases
sensible
chambers
limiting
generals
entitled
obvious
worse
reducing
reading
stolen
remove
overwhelmingly
yorkers
picked
affairs
construction
absolutely
striking
worry
springs
clerks
onto
liberty
pursue
cast
duty
split
walking
condition
religion
eric
warrant
stories
barring
bullet
hospitals
hoped
broader
tech
complex
driver
larry
honor
diego
notice
document
deep
trip
heres
talks
game
deadline
rj
proceedings
identify
prominent
roughly
peter
threats
thanks
network
arkansas
fate
denying
adopt
renewed
closely
devices
stock
atf
iraq
howard
peace
baltimore
established
launched
haitians
dispute
sat
shes
eliminate
trouble
clients
closer
watched
bombing
suburban
heads
havent
dean
widely
fought
foreigners
value
campuses
protests
accepted
grew
prohibition
nonprofit
dealing
legalizing
sources
gary
round
unit
murphy
registry
permitted
subcommittee
advantage
deciding
hate
orientation
halt
teen
jackson
illnesses
militarystyle
claiming
allies
reduced
theater
science
bid
flow
settled
nominee
brands
unmarried
parking
offenders
juvenile
dennis
bit
teenage
aware
referring
controversy
hispanics
mccain
enforcing
sellers
holders
cultural
ties
define
therefore
kidnapping
reporting
league
sitting
overwhelming
deeply
matters
career
unlike
giffords
establish
fears
conversation
facebook
migrants
procedures
suits
brothers
nearby
offers
unfortunately
mention
posted
handful
lobbyist
facilities
china
guards
prices
nationally
jerry
tim
internal
assistance
failing
deserve
produced
western
christie
shotguns
handle
p
terry
begins
virginias
familiar
gonzalez
fix
fill
independent
flight
risks
liability
dole
defending
firms
predicted
season
alien
numerous
write
dallas
modern
prohibiting
draw
presence
endorsement
activity
la
owens
commerce
ar15
baby
uses
qualify
encourage
possess
hampshire
mississippi
tens
newly
misdemeanor
factor
wave
powers
henry
minor
retarded
fairfax
ending
proper
photo
identity
jewish
surprised
fiscal
stated
produce
audience
9th
aides
image
smokingrelated
sick
jay
joint
treat
nature
methodist
innocence
sons
forms
restricting
regular
maintain
puts
feinstein
bus
pat
guys
african
nevada
operations
prisons
extended
appointed
thompson
alternative
outcome
finance
sponsors
overhaul
expanding
commonsense
retailers
clean
aurora
houston
granting
lewis
advance
timothy
option
confirmed
linked
aggressive
afraid
tighter
tuition
leaves
momentum
targeted
refuse
attacked
jurisdiction
looks
burden
marked
juries
active
dramatic
entry
systems
box
vast
latinos
contributions
companys
plus
wearing
thinks
legalized
heavy
perry
fast
truly
durham
forum
commercial
backers
delegates
watching
grown
preventing
picture
rhetoric
settle
impossible
headquarters
testing
facility
relatively
twothirds
cops
complaints
built
williamson
differences
werent
quick
negotiations
continuing
colleges
moratorium
girls
double
essentially
kentucky
bishop
method
fulton
awaiting
shotgun
tallahassee
plant
industrys
clara
louisiana
permission
wonder
alabama
correct
cold
nomination
spread
wide
model
begun
jack
environment
maker
entering
cleared
sanctuary
ny
mission
smugglers
legalization
veterans
constitutionality
murderers
antitobacco
obviously
perform
delayed
positive
treating
marlboro
owning
susan
sarah
drawn
talked
nelson
loved
suing
grants
worlds
rising
corporate
struggle
birth
seeing
falls
incidents
crucial
defended
everybody
realize
addressed
del
barbara
injuries
covered
ideas
foreignborn
jeff
interviews
originally
repeated
instance
executives
proud
twitter
minister
harry
bodies
missing
deathrow
completed
baker
eye
extra
classes
music
universities
favored
expensive
runs
vetoed
daughters
complaint
temporarily
defender
conclusion
nichols
survived
typically
initiatives
aftermath
recognizing
beat
unanimous
unclear
grow
participate
award
hardly
guest
joining
stabbed
reid
appellate
execute
supporter
chances
locked
anderson
film
gunrelated
pledged
partnerships
janet
guarantee
scrutiny
seized
opinions
finds
defined
signatures
workplace
camel
moore
teenager
chose
usual
fail
solutions
annually
nc
spanish
winning
ken
intense
alliance
tests
terror
aids
spot
activities
shared
gayrights
doma
merely
fairness
reno
mcveigh
1990s
jurisdictions
character
draft
massive
delivered
applying
pew
tuesdays
declaring
discovered
alan
star
handed
unfair
martinez
parent
opposite
lots
imagine
balance
cubans
alive
gathering
pastor
counter
sessions
moderate
jefferson
restrictive
ted
graham
rooms
homosexuality
heat
hot
voter
comply
violating
fled
hell
highprofile
please
addiction
cell
recommendations
childrens
expert
nixon
kevin
meetings
fifth
offense
understanding
latin
regional
cuts
extreme
trials
threejudge
applies
female
belief
urge
towns
suffering
degree
taylor
girlfriend
indictment
fathers
demanding
supply
trust
environmental
wages
lobbyists
deportations
client
severe
divisive
announce
mall
combat
camp
sharply
passes
surgeon
purchasers
river
fields
cobb
override
feeling
natural
insisted
contrast
beating
breaking
christopher
reject
ii
consensus
acted
resulted
explosives
outrage
ministers
giuliani
amend
eastern
personnel
steven
omalley
marylands
substantial
anniversary
interested
biden
detainees
demands
baseball
disappointed
exercise
banks
shut
introduce
prospective
minneapolis
possessing
develop
sporting
h1b
ultimate
significantly
muhammad
adam
properly
bail
passengers
rush
odds
margin
exposed
indoor
veteran
suspended
initially
boat
homosexuals
constitutions
equally
immunity
fines
chiefs
debated
madison
direction
clergy
hunt
generation
regulated
courthouse
deputies
nj
bronx
purchasing
defining
strengthen
judgment
targets
preliminary
tennessee
brain
stayed
anger
revealed
pleas
enjoy
tears
nancy
entirely
contentious
ethnic
soldiers
founded
collins
topic
kinds
earned
follows
weight
signing
colo
tonight
allegations
somebody
turns
pull
protects
brand
requested
escape
flag
surrounding
crackdown
consistent
indian
completely
interstate
lawful
widespread
successfully
afford
persuade
indiana
longterm
dekalb
miss
committees
sets
corp
actual
complained
appearance
referred
mitt
pride
iii
manner
sniper
medicine
doctor
doors
physical
error
associate
expansion
management
growers
threw
reporter
indicted
unprecedented
bishops
sharp
authorized
agriculture
refusing
noting
desk
transportation
memo
knowing
variety
divorce
tied
manufacture
link
purposes
payments
enforced
rarely
resolve
preparing
highway
village
heights
ignored
oped
warnings
discourage
holds
owns
salvador
wesson
maximum
happening
suggesting
attempting
train
saved
testify
anybody
unique
recall
desire
conflict
ends
aim
gained
directed
extremely
gotten
golden
learning
reforms
british
suffer
disabled
sparked
website
tradition
consumer
kerry
combined
heller
bible
procedure
initial
senates
remaining
hillsborough
partys
congressman
tend
diseases
favors
vulnerable
packs
slayings
contend
injury
perfect
terrible
liberals
personally
pledge
speakers
leads
vehicles
apart
reversed
gray
raped
prior
qualified
window
prisoner
recommendation
modest
professional
neighborhoods
submit
replace
nobody
readers
promises
californians
asian
everywhere
outlaw
analysts
gaymarriage
developed
importance
holder
bernardino
shopping
chuck
exposure
ring
surprising
machines
cheap
targeting
moms
cdc
deserves
mountain
dying
narrow
scalia
guidelines
dakota
options
petersburg
ages
beliefs
courage
spouse
formal
feared
contact
horrific
federally
smaller
chapter
dramatically
employer
messages
membership
migration
stalled
whites
listen
handling
imposing
memorial
accounts
tragic
sites
billions
hb
stopping
statutes
stepped
speed
elderly
slightly
emerged
slow
practices
mail
educational
broadcast
encouraging
carnage
smart
lawmaker
retail
nonsmoking
confessed
prospect
attending
lt
garcia
missouris
offenses
square
waited
solve
praised
display
constituents
outdoor
regulating
knowledge
orange
whos
slain
fence
midnight
outofstate
crossing
periods
correctional
mondays
proved
craig
hunters
spare
core
petitions
municipal
ed
declare
races
feels
obtaining
packed
poverty
cook
blow
officially
convinced
voices
reviewing
administrative
collect
defines
partisan
ongoing
sacramento
uphold
deter
exception
driven
sit
boost
participants
haiti
adams
global
formed
notes
advice
17yearold
ron
thank
disagree
shield
contrary
surge
eager
loopholes
marrying
debates
pair
announcing
rob
motivated
aggravated
capacity
estimate
players
users
principles
sb
persecution
proceed
morgan
defenders
swing
selection
marshall
pleased
austin
recommend
demonstrate
suddenly
explained
regularly
giant
rallies
flood
moves
cutting
sevenday
tighten
supervisors
clubs
fresh
churchs
liggett
haitian
drove
childhood
assassination
theyll
narrowly
routine
christmas
punitive
promoting
ignore
healthcare
embrace
healthy
epidemic
branch
moussaoui
frequently
exist
threatening
energy
ellis
tucson
male
georges
divide
reflect
toughest
opportunities
concept
councilman
gwinnett
seats
kenneth
discussed
quality
womens
warren
resume
formally
bruce
shots
civilian
helps
pa
marijuana
straw
port
movies
forcing
notion
recover
raids
pronounced
arnold
mentioned
apparent
tomorrow
production
hammer
blamed
clark
marks
normal
partly
extending
caucus
sea
markets
pressing
spared
discussions
reinstated
guarantees
pool
q
advanced
size
dianne
gangs
surely
jumped
deemed
lists
celebrate
wednesdays
foster
youths
weak
illegals
sixth
ross
wouldbe
struggling
mistake
considers
radical
ann
match
quietly
committing
pregnant
complicated
guess
delaware
corner
airports
threeday
oral
meaningful
primarily
mandate
reconsider
muslim
code
arizonas
chiles
negative
sad
europe
fairly
unveiled
1980s
submitted
gunned
anticrime
agencys
sens
attitudes
ease
exempt
lastminute
roberts
alexandria
ranks
cocaine
demanded
investigations
paperwork
residence
campbell
quarter
rival
lawenforcement
priorities
tragedies
cop
questioning
baptist
invited
tells
listed
franklin
scores
tex
answers
kick
dick
zimmerman
supervisor
guilt
principle
engaged
phoenix
troubled
returning
honest
robinson
moments
edwards
floridians
abandoned
manufacturer
consumers
prepare
carter
embraced
volunteer
pataki
convenience
republicancontrolled
institutions
screen
convince
drawing
delays
argues
express
episcopal
bottom
posts
platform
controlled
restraining
assaultstyle
idaho
contended
plane
investigate
silver
reviewed
estate
hills
abroad
mo
focusing
contends
restricted
founder
shares
appropriations
toomey
maintained
transfer
punish
graduate
asks
returns
jeffrey
lies
lay
jennifer
skills
stake
desert
elian
sorry
gender
maria
serial
deliver
jesus
portion
pinellas
chain
weekly
injunction
fit
designated
insist
investigating
confident
sees
alaska
russian
volunteers
scientists
classaction
lax
scheme
chest
reportedly
contracts
contributed
stabbing
viewed
amended
tactics
spoken
admit
colorados
england
cnn
nightclub
desperate
resistance
processing
clips
marco
executing
brings
felon
raleigh
era
trained
neighbor
clause
sam
responsibilities
antonio
longstanding
recovered
knife
sisters
feelings
camden
anyway
shooters
encouraged
barely
silence
georgians
cheney
contained
commonwealth
letting
ray
canadian
minute
confusion
responding
castro
proposing
fiveday
theft
discretion
dinner
plenty
seattle
heston
jurys
thoughts
islamic
detectives
reflects
gubernatorial
schwarzenegger
fred
heated
reverse
route
responses
contains
signature
donations
industries
households
slaughter
thrown
funded
prosecuted
pete
karen
minds
stem
juveniles
profits
practical
greatest
hailed
gunfire
everytown
arming
rjr
evil
plead
pages
reprieve
recalled
crowded
undercover
spree
raises
wage
features
acknowledge
garden
strip
10th
concealedweapons
ten
vietnam
describe
tired
rodriguez
marched
discriminatory
warner
promising
expects
skilled
contest
guatemala
compelling
string
inspired
polling
preserve
workplaces
pope
hundred
intend
understood
gregory
toll
fleeing
overseas
games
founding
acceptance
horror
addressing
bridge
victories
involves
rhode
accepting
adoption
vows
choices
newsom
instate
procedural
jerseys
halted
seconddegree
frustration
thursdays
upset
solely
sentiment
reputation
endorse
backlash
smokeless
juror
burglary
roman
k
exists
racist
halls
pose
cox
tool
troops
privacy
ship
southwest
analyst
stringent
ok
projects
unnecessary
ap
orleans
heading
demonstrated
forget
airlines
mccarthy
lock
pressed
sounds
soviet
screening
aide
jeb
goals
dcalif
implications
walls
dark
roy
objections
detailed
interviewed
typical
indicate
publicity
arlington
blunt
achieve
hollywood
images
busy
inspector
battles
hed
keeps
municipalities
european
charleston
linda
plastic
abolish
reaching
causing
removal
jews
visited
windsor
examine
metal
matthew
mixed
serves
democracy
crossed
oakland
rich
blocking
atlantic
unlicensed
parade
dny
laborers
africanamerican
quiet
pasco
creates
pounds
occur
traditionally
flawed
boards
art
nice
intention
amounts
necessarily
accident
journey
buyer
yesterdays
carefully
restore
matt
equivalent
pace
kills
harsh
mainly
stations
hopeful
privileges
totally
contribute
widow
malvo
scientific
deals
newspapers
shame
extraordinary
mitchell
diverse
denounced
israel
steady
treasury
migrant
antiimmigrant
automatically
freed
chemicals
nebraska
bias
quoted
attracted
informed
worldwide
tony
mcauliffe
basically
declining
arrive
celebration
involve
interesting
mount
youve
academy
rational
teaching
roll
experienced
routinely
logic
tape
severely
outlawed
throw
lowest
twin
filibuster
via
denies
availability
stops
exceptions
privately
escaped
chosen
mercy
collected
lawrence
wound
postdispatch
faculty
vs
pentagon
reduction
comfortable
mainstream
interpretation
rock
bright
resolved
nationals
assaultweapons
involvement
somehow
11th
tiny
hair
uncertain
principal
employed
definitely
cameras
consistently
unarmed
hidden
surveys
pattern
sensitive
suburbs
hightech
items
developing
vending
elizabeth
mans
juan
holmes
catch
fingerprints
lengthy
carries
plants
falling
demonstrators
enormous
operating
montana
reads
bigger
touch
ford
guaranteed
transgender
accidents
abusers
uniform
bomb
deliberations
newark
visiting
justify
memory
communications
silent
assume
clayton
writes
pictures
barr
lungs
walmart
patches
pastors
raping
intelligence
greg
carlos
navy
suicides
babies
accidental
fridays
gap
studying
drafted
performance
fake
presidency
sight
germany
breaks
ward
bound
grade
combination
wore
decides
lying
metropolitan
mouth
expired
missed
ridge
evans
spitzer
advertisements
civic
category
lgbt
bloombergs
goods
kessler
grassroots
tobaccorelated
stevens
russell
prosecute
unfairly
strongest
signal
harvard
probation
handled
tide
wild
obligation
arriving
ak47
adviser
minnesotans
smokes
relevant
sufficient
pro
detective
coleman
diaz
corporation
springfield
fans
headline
traveled
littleton
moreover
manufacturing
demonstrations
lie
crop
daca
ga
beaten
examined
german
roof
essential
abujamal
extensive
charlotte
governing
mix
answered
lift
misleading
gingrich
checked
certificate
teach
supportive
md
patrons
humane
managed
bernie
technical
attitude
stark
electronic
nypd
blessing
parker
warrants
text
stewart
wars
chapel
refusal
motor
gold
abc
jon
gunshow
library
manchin
besides
4th
dignity
drinking
eighth
prayers
hadnt
lifetime
authors
implement
succeed
wounds
barry
household
simon
timing
accusing
awarded
billboards
arrivals
infringed
gum
oppositesex
sc
prospects
ranging
kicked
prefer
precedent
traveling
explanation
barnes
plain
poised
fly
avoided
india
powell
climate
empty
speeches
republic
lott
earn
fails
guests
nathan
frustrated
assigned
gerald
expenses
adds
replaced
engage
abused
denial
sun
gift
tie
shifted
ceo
disaster
undermine
zone
exemption
diversity
restriction
enacting
cessation
reasoning
sends
lobbied
showdown
title
rapidly
featured
cry
raid
bitter
rating
webb
senseless
demonstration
olson
offensive
investors
capable
jason
theory
editors
emotion
identical
trail
fallen
walter
actor
equipment
lisa
harrisburg
admission
lopez
spotlight
symbolic
performing
antigay
lifted
gabrielle
device
holiday
sullivan
awareness
lighting
posed
visible
stanley
renew
harmful
verify
contractors
thousand
retreat
agricultural
enthusiasts
dreamers
noncitizens
gilmore
painful
tries
competent
schedule
taxpayer
convict
weigh
feature
deadliest
minnesotas
studied
recorded
griffin
ridiculous
sells
regard
location
knowingly
merits
color
destroy
reed
freedoms
tone
crazy
tour
unemployment
anymore
attract
establishments
guestworker
survive
disturbed
byrd
brutal
casey
junior
broward
customer
rely
reference
afghanistan
1960s
favorite
accountable
dedicated
africa
advocating
ave
realized
swift
tourist
legislator
twoyear
situations
irish
dave
propose
gunsafety
dismiss
jump
stuck
participating
hatch
jails
perspective
cooper
cap
resulting
cooperation
selected
substance
disturbing
gather
shocked
wealthy
blocks
upcoming
jordan
francis
import
outright
permitting
gavin
quitting
trayvon
arthur
models
kitchen
imprisonment
nights
hanging
historically
anne
vital
carl
phil
fundraising
quinn
foot
stamps
net
accurate
casino
christians
vendors
chewing
indication
plot
antonin
weighing
northeast
ticket
luther
butts
appearing
cohen
normally
sanctions
oh
disagreed
approached
acceptable
bradley
recipients
assemblyman
enjoyed
influential
threaten
unrelated
instructions
merit
appealing
funeral
botched
torture
wright
christ
conscience
intends
robbed
loving
horrible
object
christine
gross
peterson
clinic
bell
upholding
repeat
headlines
attached
ninth
rallied
outspoken
backs
duke
shifting
classroom
corporations
zones
farreaching
turnout
classrooms
tested
stuff
pittsburgh
lesser
doubled
wood
willingness
jesse
plays
upper
justified
charlie
reluctant
destroyed
inadequate
marion
simpson
dear
costly
ordinary
recess
concerning
launch
context
voiced
coffee
advisory
overcome
pointing
famous
regulatory
southeast
relative
expire
landscape
evangelical
vocal
documented
distribution
deferred
bisexual
traced
voterapproved
tools
intervene
deterrent
french
jailed
excuse
19yearold
design
prime
hunter
legality
woods
careful
voluntary
ineffective
lied
flags
gunshot
liable
superintendent
reserved
compliance
spirit
extension
tweeted
influx
newcomers
lorillard
lottery
heinous
alexander
retirement
clothes
journalists
noon
random
6yearold
remarkable
winter
organizing
lesson
boycott
scholars
recognizes
educators
gunfree
tobaccofree
loud
affirmed
bench
hole
laid
rejecting
privilege
debt
payment
eve
declaration
blasted
overturning
listening
fierce
forever
youngsters
pieces
commentary
content
shortage
array
lobbys
generations
ecigarettes
washingtons
assist
excluded
somewhere
prompting
yard
ride
strength
bucks
irresponsible
activism
incumbent
dad
luis
todd
zero
hudson
separately
patch
mexicos
debating
addicted
undergo
nowhere
traffickers
federation
flights
struggled
stretch
clarence
material
ramsey
historical
agrees
discussing
objected
captured
somewhat
cbs
nevertheless
depend
unlawful
pilot
prescription
suspicion
panels
approximately
delta
starts
doctrine
shape
stadium
profit
reminder
muslims
gunmakers
silicon
glock
sexually
locations
stress
minorities
files
briefly
independence
signaled
determination
predict
photos
dropping
removing
proven
addresses
methods
indicates
donors
discount
professionals
faster
surveyed
depending
progressive
implemented
nuptials
sport
prosecutions
disappeared
punished
comparison
adequate
teams
succeeded
1970s
sean
confronted
subsequent
ferguson
shock
staying
certificates
interracial
football
permanently
rabbi
print
lucky
billboard
unauthorized
corbett
competition
prop
tancredo
foes
crash
dissent
ralph
northwest
bed
gordon
lane
passionate
familys
lunch
regions
16yearold
crew
universitys
hearts
wind
managers
absence
backlog
checking
differently
alike
portrayed
wishes
injections
acquitted
aggravating
whenever
doubts
articles
pursuing
disclose
covers
sgt
ordering
seize
rogers
detain
presbyterian
waste
explaining
kid
celebrated
super
cable
bag
airline
farmer
fights
suggestion
affects
optimistic
exemptions
heritage
packing
backgroundcheck
theodore
jimmy
coordinator
determining
notified
reveal
extent
carol
switch
tremendous
repealed
knives
agreeing
gallup
covering
greatly
approving
accidentally
dominated
14th
outraged
festival
educate
inaction
honduras
languages
hotels
deporting
15yearold
classified
persuaded
wording
devastating
boyfriend
vincent
rent
neighboring
charging
wisdom
breathe
scope
kim
husbands
plaza
improving
stripped
ineligible
eat
respondents
forth
wear
voluntarily
constant
singer
counted
spots
degrees
attacking
bennett
ethics
rage
substantially
suburb
france
conducting
nonetheless
jonathan
similarly
doug
destruction
decrease
civilians
myers
grave
weaken
catholics
controlling
praise
documentation
electrocution
rolling
grief
inevitable
survivor
confrontation
lifelong
accompanied
aspects
professors
reversal
contain
dog
rid
beings
participated
seventh
interpreted
distinction
guantanamo
phrase
operate
edition
prevents
chemical
charlton
elements
collective
channel
theyd
electionyear
missourians
heterosexuals
violators
buried
enemy
listened
naturalized
fbis
discriminate
mere
grove
guidance
seemingly
clearwater
competing
processed
revised
corruption
japan
considerable
constitutionally
connected
counting
seconds
speaks
concert
fires
pension
ore
midterm
hero
deliberated
taught
pays
onethird
versions
turner
disclosure
fashion
opens
postal
touched
counterparts
glenn
absurd
profile
neck
aboard
disclosed
trends
symbol
investigated
uncertainty
comfort
ocean
saving
prayer
marches
administrators
researcher
labeled
visits
roots
sharing
surrender
tracks
unfortunate
welcomed
fiveyear
lessons
councils
perfectly
passport
franciscos
gains
lambda
pretrial
storm
mitigating
tightening
raymond
disability
evolving
carolinas
throat
politician
brooks
representation
frederick
spends
scenes
soft
topics
bedroom
absolute
arrival
commonly
trace
leaf
herring
surgery
ignoring
investment
warn
paterson
casinos
boehner
misconduct
badly
keith
insanity
morales
observers
element
postponed
accomplice
attributed
sole
ariz
summit
worship
writers
precisely
wins
generated
inspectors
documentary
conceded
accommodate
carnahan
invoked
wanting
nativeborn
crist
player
tea
theme
labels
fundraiser
stick
resigned
confused
bunch
mistakes
odonnell
shed
distributed
australia
perez
tackle
eligibility
lady
reminded
lined
organizer
nurse
bearing
emails
landed
delivery
sundays
merchants
populations
hide
sworn
strangled
fault
afterward
instances
sandra
transferred
collection
negotiators
reflected
httpwwwnytimescom
wyoming
gods
grandmother
subjected
patient
nbc
eliminated
cool
johns
useful
flew
buck
earth
mounting
archbishop
raton
explicitly
tickets
reasonably
auto
detroit
lawfully
bags
etc
soil
movements
asia
workforce
consultant
underage
massacres
friendly
smiths
grocery
guide
oath
retain
dale
wrongly
unexpected
finished
televised
insane
liquor
hiding
embassy
exonerated
pursuit
dawn
passenger
criticizing
hernandez
forest
extends
savings
kaine
clarify
recreation
factory
museum
belong
stable
ehrlich
backgrounds
strange
separated
revolver
copy
cornyn
tables
consumption
denomination
physicians
rudolph
milwaukee
lacked
alongside
reinstate
eating
nursing
champion
jacksonville
punishable
unknown
belt
laura
vision
russia
alameda
surveillance
marilyn
oversees
generate
describes
plaintiff
picking
camps
salt
nosmoking
apple
improperly
meets
victor
columnist
dates
unsuccessful
freeman
chase
advised
ben
confession
cells
manslaughter
hometown
clothing
bloody
stars
cite
gaining
confront
prejudice
