said
gun
would
state
new
marriage
court
states
one
people
death
law
bill
guns
years
last
gay
two
tobacco
us
samesex
could
federal
year
also
climate
president
ban
national
mr
house
change
control
first
laws
percent
public
time
weapons
smoking
rights
many
city
case
issue
right
penalty
county
even
global
say
amendment
may
senate
supreme
like
school
warming
week
police
couples
make
firearms
support
since
health
united
emissions
legal
judge
get
legislation
three
whether
vote
group
decision
including
says
washington
violence
florida
congress
take
attorney
shooting
day
man
made
dont
way
second
government
murder
background
officials
york
million
association
much
california
republican
use
life
american
rifle
tuesday
carbon
found
another
district
children
general
today
used
industry
country
monday
gov
wednesday
members
next
high
measure
campaign
without
political
want
debate
still
thursday
according
think
nra
nations
greenhouse
assault
ruling
told
going
among
companies
trial
crime
energy
part
obama
checks
ago
killed
report
month
back
well
convicted
bush
long
cigarette
carry
passed
called
justice
former
friday
administration
put
already
americans
every
groups
action
must
news
execution
defense
need
yesterday
days
republicans
cigarettes
office
appeals
civil
act
study
four
gas
university
lawmakers
power
white
go
committee
courts
clinton
policy
home
jury
world
democrats
department
recent
smoke
local
several
sales
john
know
might
allow
prison
capital
marriages
keep
voters
system
least
five
thats
virginia
good
help
show
cases
see
asked
constitutional
come
st
smokers
sen
others
less
plan
money
environmental
safety
research
legislature
family
san
number
sentence
center
never
owners
evidence
advocates
killing
set
benefits
work
believe
likely
scientists
leaders
handgun
lawyers
issues
woman
shot
concealed
around
far
past
democratic
effect
mass
tax
saying
council
become
months
times
took
guncontrol
across
stop
came
proposal
dioxide
end
major
prosecutors
march
unions
students
punishment
reduce
proposed
governor
little
majority
measures
gases
shows
yet
nearly
texas
criminal
company
business
expected
six
men
away
later
voted
place
question
director
enough
approved
constitution
weeks
citizens
billion
church
domestic
row
shootings
im
similar
left
georgia
handguns
increase
though
colorado
mayor
hearing
pass
conference
rep
trying
problem
nation
efforts
something
however
person
enforcement
making
attorneys
married
air
important
filed
give
buy
check
chief
allowed
appeal
women
executive
america
whose
program
restrictions
call
point
protect
earlier
effort
union
supporters
victims
fact
june
face
doesnt
period
wrote
human
north
stand
statement
big
drug
clear
lives
permit
circuit
young
didnt
meeting
countries
community
missouri
got
record
brady
protection
bills
order
firearm
night
move
require
began
board
weapon
lawsuit
cancer
scheduled
sentenced
almost
cause
taking
fight
maryland
illegal
announced
opponents
within
prevent
ruled
released
trump
nothing
force
arms
michael
hours
louis
early
history
permits
criminals
deal
instead
outside
changes
lead
dealers
private
anyone
able
held
charged
waiting
future
black
given
panel
spokesman
based
david
recently
legislative
agency
crimes
care
die
conservative
process
levels
james
using
agreement
cant
guilty
massachusetts
jersey
taken
marry
better
theres
look
rules
area
comes
signed
pay
cities
current
executed
social
find
cut
done
international
security
although
consider
really
kill
election
lawyer
mental
schools
real
plans
makes
often
society
charges
known
letter
include
led
judges
ever
science
r
along
lesbian
george
wants
reason
lobby
legally
officers
presidential
bear
party
matter
thing
toward
south
robert
hands
continue
went
top
press
despite
lot
data
final
rifles
issued
someone
required
west
half
july
agreed
plants
illinois
votes
decided
sign
getting
step
seek
information
sunday
cost
position
different
opinion
seeking
sale
employees
banning
age
best
fire
cannot
head
april
settlement
licenses
rather
review
deaths
officer
small
regulations
residents
idea
areas
inmates
address
free
lethal
let
things
failed
possible
opposed
late
result
added
ballot
wanted
member
costs
full
bans
open
water
became
largest
executions
means
strong
products
dead
families
wont
proposition
november
live
justices
response
decades
leader
argued
died
decide
francisco
wrong
senator
challenge
level
seven
philip
organization
reported
records
semiautomatic
questions
purchases
provide
calls
kind
allowing
jr
temperatures
great
try
minnesota
rejected
morris
favor
risk
problems
needed
democrat
massacre
side
jurors
latest
list
accused
rate
sense
large
partners
opposition
average
hope
per
arguments
session
saturday
tried
natural
atlanta
committed
hold
theyre
ownership
mother
stay
nicotine
brown
isnt
legislators
coal
sell
attack
beach
medical
spent
paul
limit
governments
experts
thousands
line
key
certain
oil
sent
potential
close
start
morning
common
working
leading
couple
ground
always
serious
soon
mark
dc
impact
economic
religious
hes
injection
rise
growing
seen
armed
sure
received
behind
higher
store
near
rule
chairman
congressional
longer
bring
atmosphere
together
ask
vice
j
authorities
feel
poll
hear
richard
kids
significant
anything
smith
lost
license
example
parents
william
street
wife
coming
post
college
programs
argument
eight
access
car
threat
old
carrying
purchase
environment
violent
suit
activists
politics
unconstitutional
sold
bad
dangerous
pollution
equality
brought
proposals
push
probably
hard
special
gave
third
pennsylvania
ammunition
places
attention
simply
interview
ill
lower
candidates
carolina
secretary
assembly
commission
capitol
disease
run
clean
politicians
role
either
especially
responsible
annual
weather
showed
refused
attempt
supported
increased
read
battle
agree
citys
begin
thought
scientific
ordinance
individual
seems
son
tell
considered
message
researchers
banned
turn
ms
war
meet
partner
market
rising
yes
lawsuits
bars
buyers
personal
lung
service
media
turned
denied
heat
worlds
earth
park
thomas
recognize
sea
professor
heard
ice
calling
standards
sides
senators
bar
effects
movement
talk
actually
californias
advertising
nine
course
military
manufacturers
chance
building
food
economy
caused
institute
love
scott
claim
needs
heart
killer
available
fear
mentally
front
friends
gays
short
body
bloomberg
view
buying
child
included
joined
taxes
antismoking
electric
safe
regulation
subject
newtown
ways
sentences
request
involved
obamas
hundreds
jan
testimony
treaty
gop
policies
bureau
cars
limits
restaurants
requiring
dr
nationwide
light
century
claims
requires
powerful
offer
studies
fuels
story
speech
fall
coalition
initiative
changed
official
philadelphia
event
raise
words
budget
father
following
article
martin
ads
individuals
quit
editor
particularly
summer
answer
kyoto
freedom
connecticut
approval
reducing
single
charles
job
difficult
parole
allows
oppose
floor
authority
insurance
candidate
parkland
alcohol
perhaps
possession
started
chicago
adults
floridas
everyone
goes
name
interest
town
student
offered
editorial
price
term
fossil
sought
race
create
survey
quickly
education
passage
declined
struck
hill
steps
decisions
hall
gore
deadly
amount
focus
events
decade
introduced
concerns
january
makers
comment
temperature
fuel
fund
elected
lawabiding
mean
millions
series
published
conviction
goal
actions
streets
ones
true
helped
magazines
ordered
equal
murders
w
feb
licensed
block
rest
raised
reports
room
davis
save
victory
includes
beyond
reached
weve
concerned
december
regulate
looking
property
approach
pm
denver
designed
running
documents
asking
pressure
takes
views
agenda
chair
dec
noted
sources
ad
fla
arrested
degrees
staff
bob
inmate
sandy
columbia
understand
owner
defend
innocent
existing
happened
convention
charge
dozen
governors
aimed
share
rates
project
sept
demand
target
counties
form
necessary
businesses
worked
drugs
joe
china
prevention
due
youre
dollars
written
representatives
organizations
effective
argue
leave
l
workers
minutes
fbi
selling
los
giving
forward
trade
wake
stores
associated
immediately
appeared
unusual
husband
oklahoma
oct
bay
urged
defendants
watch
total
ive
greater
intended
considering
impose
palm
pack
reasonable
biggest
douglas
voting
team
happen
declared
numbers
else
wasnt
stricter
easy
selfdefense
statewide
technology
highest
polls
created
tom
nov
concern
win
saw
assistant
spending
jim
firstdegree
prosecutor
campus
amendments
services
seem
supports
conn
results
hand
additional
tough
release
signs
buildings
secondhand
stopped
met
provision
doubt
e
inside
ability
agencies
remains
appears
controls
present
conservatives
separate
elementary
plant
journal
socalled
rally
tampa
senior
angeles
spoke
alone
follow
moved
spend
liberal
planet
attacks
hook
increasing
avoid
expect
spokeswoman
sponsored
chamber
robbery
lesbians
tougher
television
version
reach
certainly
miles
grant
carried
previous
discrimination
talks
moment
sheriffs
homes
remain
relationship
living
repeal
upheld
communities
wouldnt
apply
opportunity
speaker
vermont
daughter
killings
cuomo
sex
reasons
talking
granted
arent
veto
johnson
gunman
analysis
unless
southern
traditional
drive
leadership
estimated
recognition
choice
teenagers
changing
clearly
east
electricity
sentencing
williams
central
consequences
believes
controversial
challenges
population
epa
investigation
popular
date
compared
range
island
development
sexual
pending
gone
jail
restaurant
centers
followed
resources
land
continued
suggested
hospital
heterosexual
developing
hit
donald
reynolds
produce
february
mind
presidents
americas
whats
largely
facing
verdict
road
apparently
fellow
tragedy
described
burning
compromise
fired
jobs
planned
terms
ohio
resolution
receive
return
test
beginning
customers
fighting
join
product
language
pushing
faces
video
critics
adopted
wedding
forced
usa
teachers
green
commitment
training
play
pleaded
knew
pistol
enacted
everything
paid
victim
showing
financial
hunting
parts
simple
condemned
ended
broad
comments
primary
word
twice
weekend
finding
recognized
lee
finally
poor
judiciary
al
affect
superior
online
wounded
causes
wait
main
lines
cited
lets
specific
ocean
throughout
v
gets
mostly
bought
possibility
witnesses
spring
status
aug
huge
vegas
accept
opened
moving
arizona
expand
believed
mike
supporting
ryan
prove
lobbying
todays
inc
districts
works
farmers
difference
nras
trend
limited
related
seemed
prohibit
atmospheric
funding
felons
raising
starting
site
historic
damage
overturned
focused
santa
addition
felt
petition
announcement
provided
appear
daily
sued
nature
holding
antigun
discussion
determine
standard
crowd
ready
column
facts
curb
source
dropped
standing
whole
las
columbine
ahead
administrations
b
practice
willing
backed
youth
earths
october
conducted
mandatory
truth
august
worth
representative
putting
maybe
reporters
testified
marketing
named
adding
points
speaking
passing
shift
previously
neither
barack
firm
targets
fair
middle
defendant
responsibility
calif
bipartisan
kept
growth
gives
behalf
legalize
paper
delay
plea
package
judicial
catholic
feet
concluded
approve
extreme
produced
easier
prohibited
joseph
institution
f
currently
vehicles
elections
moral
arguing
smokefree
advocacy
bushs
provisions
lack
worst
break
expressed
c
commit
foundation
fewer
warning
class
none
send
friend
speak
felony
cigar
keeping
findings
sponsor
tv
strict
afternoon
proponents
writer
space
increasingly
mayors
rev
production
bullets
author
entire
loophole
prices
king
progun
low
september
co
orlando
restrict
slaying
manager
progress
involving
european
trigger
serve
wisconsin
cover
witness
opposes
brother
defeat
cold
protest
file
endorsed
critical
safer
renewable
basis
openly
potentially
add
discuss
stephen
page
influence
illness
brooklyn
prosecution
otherwise
landmark
club
legislatures
smoked
arctic
choose
minors
stoneman
voice
experience
commissioner
nuclear
reality
reduction
represents
sometimes
treatment
driving
warned
reform
risks
obtain
negotiations
particular
harm
statistics
purpose
upon
hillary
colleagues
jones
relationships
churches
dozens
overall
retired
kennedy
threatened
occurred
rick
suggest
deny
boston
meanwhile
couldnt
plaintiffs
harris
gunrights
chris
exactly
drew
generally
served
machine
magazine
elsewhere
shoot
shouldnt
door
wayne
god
deputy
respect
damages
consensus
increases
solution
movie
definition
gathered
courtroom
build
northern
basic
advocate
strategy
funds
lose
terrorist
penalties
loss
becoming
suspect
account
leaving
foreign
jose
ensure
pushed
rape
brief
forces
solar
clintons
knows
countrys
agents
statements
shop
methane
arrest
counsel
wind
danger
phase
indeed
fully
stood
smoker
hopes
suggests
represent
oregon
marjory
activity
wed
alternative
ceremony
unlikely
presented
counts
enact
concealedcarry
airport
region
investigators
homosexual
fine
allen
christian
piece
promised
manhattan
emotional
dealer
radio
andrew
except
conduct
regarding
eventually
field
caught
failure
quite
claimed
abuse
protocol
delegates
mexico
culture
straight
revenue
sanders
hurt
original
mothers
continues
figure
task
minority
strongly
details
violated
cuts
miami
virtually
politically
protections
easily
enforce
performed
reagan
comprehensive
pretty
benefit
books
killers
murderer
longterm
specifically
interests
predicted
shown
opposing
behavior
h
opening
imposed
japan
drop
utah
repeatedly
urging
campaigns
cents
un
decline
linked
planning
various
protecting
partnership
blood
visit
scientist
habit
girl
western
book
rural
determined
abortion
referendum
directly
letters
statute
rose
hour
doctors
success
faced
convictions
parks
richmond
reduced
requirements
factors
stronger
walk
dna
shooter
highly
worse
criticized
telling
meant
cruel
thinking
red
murdered
limiting
blame
aside
stage
arm
effectively
names
models
challenged
turning
dangers
summit
provides
hearings
heres
guy
prohibits
parties
hasnt
ultimately
extend
severe
returned
departments
iowa
wilson
lapierre
coverage
criticism
hawaii
vehicle
immediate
setting
combat
associations
homicides
prepared
militia
miller
computer
maine
seriously
challenging
divided
offering
walker
stocks
owned
fourth
activist
tons
ran
industrial
vowed
loaded
adult
developed
acknowledged
respond
paris
exchange
boy
reductions
opponent
litigation
promote
anthony
suicide
weddings
worldwide
fell
cutting
ronald
rulings
licensing
grounds
canada
minimum
clerk
instant
species
looked
clemency
teens
sue
table
environmentalists
successful
web
prisoners
sweeping
type
terrorism
internet
sheriff
automatic
frank
publicly
montgomery
pointed
attempted
murdering
guard
thus
direct
creating
admitted
fundamental
racial
albany
complete
adopt
whatever
situation
citizen
applied
homicide
sound
terrorists
affected
supposed
prominent
happens
deathpenalty
generation
providing
usually
fatal
eligible
larger
newspaper
faith
relatives
steve
remarks
note
registration
highcapacity
slow
goals
solutions
universal
va
serving
nonsmokers
explain
circumstances
motion
overturn
seat
injured
coast
threats
causing
learned
helping
sort
types
intent
prompted
warmer
happening
deep
requirement
transportation
values
persons
appropriate
representing
worry
base
cruz
lake
n
attempts
shall
unanimously
urban
systems
phone
fort
meaning
registered
amid
michigan
cigars
complex
winter
season
mrs
model
kansas
fda
efficiency
significantly
blue
alaska
drought
recommended
anywhere
evening
issuing
minister
peoples
obtained
sports
reaction
reelection
host
houses
purchased
ought
mary
bump
heads
dramatic
station
offices
ceremonies
roughly
activities
writing
alleged
rampage
heavy
crisis
countys
regional
suspected
pain
older
ordinances
consumers
stands
degree
possibly
acting
locks
hot
improve
patients
rounds
bit
percentage
credit
applications
independent
responded
widely
shortly
losing
section
factor
walked
daniel
placed
stance
addictive
illegally
organized
division
heavily
patrick
valley
value
grand
pistols
bringing
conditions
reading
played
fatally
kelly
defeated
becomes
brian
rare
remember
playing
humans
email
promise
dismissed
surprise
barred
established
apartment
campuses
closer
obvious
prevented
trees
vast
regardless
closed
estimates
harder
kerry
expanded
violate
employee
link
uses
dan
bullet
angry
draft
heattrapping
aggressive
housing
younger
overwhelming
citing
expensive
sensible
boys
europe
closing
warm
figures
bank
initiatives
illnesses
rj
connection
indicated
treated
define
document
positions
devices
intense
allies
consideration
id
christie
atf
corporate
eliminate
romney
forests
mention
relatively
schumer
track
gary
lobbyist
develop
modern
springs
army
scene
chambers
seeks
advance
game
neighborhood
identified
acts
mom
striking
brands
violates
cap
larry
sister
quality
cash
eyes
orders
protected
firing
projects
eric
fee
round
hampshire
unfortunately
violation
militarystyle
questioned
forest
thanks
worried
headed
prohibition
tim
virginias
backing
corrections
suffered
stock
register
legitimate
g
stolen
encourage
arkansas
incident
howard
commissioners
absolutely
emergency
downtown
jackson
conversation
jay
count
wall
shops
momentum
filing
unmarried
conclusion
unit
billions
lived
allegedly
trumps
sellers
havent
folks
spread
remove
happy
pulled
hoped
commerce
expert
broader
multiple
longtime
remained
nonprofit
cast
orientation
giffords
theyve
hoping
seeing
proof
learn
wish
represented
leaves
liability
murphy
clerks
shotguns
survivors
matters
therefore
stated
peace
broke
papers
halt
duty
watched
pledged
facilities
pursue
dispute
write
blocked
theater
british
technologies
affairs
timothy
accepted
mississippi
deciding
bond
terry
ar15
audience
generals
industrys
consumption
henry
joint
fate
massive
attended
walking
dean
instance
jerry
dennis
baltimore
normal
suits
smokingrelated
dealing
facebook
registry
retarded
teen
yorks
sat
supply
academy
impossible
grow
companys
fast
methodist
commercial
false
removed
p
endorsement
appealed
hotel
telephone
teacher
outcome
renewed
closely
peter
unable
agriculture
thompson
contribute
denying
league
handful
posted
prohibiting
possess
legalizing
built
sitting
substantial
prince
onto
overwhelmingly
innocence
understanding
continuing
religion
fees
strike
method
juvenile
commonsense
surface
blamed
industries
utilities
internal
puts
ideas
traffic
powers
essentially
hate
attend
fought
kidnapping
looks
wide
launched
colo
deeply
defending
restricting
tallahassee
permitted
claiming
surprised
aware
honor
referring
suspects
williamson
expanding
greenhousegas
amounts
resident
conspiracy
9th
protesters
draw
familiar
sets
finance
unlike
louisiana
option
valid
guys
retailers
river
numerous
begins
gang
paying
blacks
india
image
ministers
forum
van
organizers
nevada
favored
quick
teenage
melting
plus
atlantic
twothirds
gathering
notice
network
picture
executives
suing
marlboro
spouses
juries
priority
crucial
double
appointed
antitobacco
active
gain
twitter
contributions
reporting
yorkers
shotgun
broken
preventing
travel
split
kentucky
susan
nichols
offers
covered
trip
modest
vulnerable
barring
maker
de
meetings
kevin
impacts
regular
accord
warrant
search
sarah
offenders
owens
pat
settled
tech
income
collins
addiction
application
partnerships
sick
fulton
bid
storms
announce
balance
unprecedented
controversy
mccain
wonder
moratorium
welcome
deserve
owning
deathrow
alliance
widespread
testing
entitled
diseases
nominee
relations
thinks
bombing
rain
direction
entered
backers
regulating
handle
murderers
applicants
edward
trucks
unanimous
avenue
moderate
secret
regulated
finds
management
firms
aides
talked
warnings
hardly
addressed
nationally
attacked
refuse
photo
metro
nearby
camel
gunrelated
ken
barbara
shes
suburban
truly
lobbyists
georgias
aurora
bishop
addressing
differences
jack
reject
parking
theory
annually
neighbors
durham
recognizing
contract
execute
polar
begun
immigration
flooding
opposite
smaller
enter
marked
obviously
filled
medicaid
legalized
wave
consumer
usual
sharply
anderson
recommendations
award
extra
trouble
box
holders
mcveigh
gayrights
coastal
pope
combined
opinions
nc
defender
constitutionality
ending
newly
tighter
joining
mountain
condition
omalley
stabbed
belief
ted
protests
treating
waste
baker
sharp
grew
card
watching
clara
defined
homosexuality
cleared
schwarzenegger
options
pick
star
drivers
vetoed
urge
treat
misdemeanor
moore
doma
industrialized
burden
contrast
fears
establish
indoor
oceans
maintain
music
werent
fail
sending
taxpayers
career
lewis
database
purchasers
pledge
authors
aftermath
positive
counter
emission
oped
merely
surgeon
realize
survived
identify
perry
veterans
nixon
hurricane
predict
ny
failing
steven
fairfax
liberty
cops
ashcroft
droughts
occur
binding
falls
chose
hospitals
supporter
correct
manmade
imagine
fox
film
path
giant
appellate
delayed
signing
dallas
dole
stories
colorados
marylands
jefferson
adam
loved
biden
hurricanes
margin
hell
confirmed
trafficking
coalfired
repeated
topic
imposing
arnold
capacity
trials
sporting
regions
fahrenheit
unclear
periods
requests
temporary
feinstein
tied
spot
tuesdays
highprofile
farm
rubio
wearing
override
storm
dramatically
importance
signatures
incidents
girlfriend
muhammad
achieve
suggesting
1990s
turns
chances
clergy
nelson
jurisdiction
christopher
rapidly
markets
suffer
struggle
kinds
odds
winning
fifth
ultimate
defended
eye
headquarters
advantage
dying
aim
brand
hunt
tests
perform
locked
consistent
purchasing
shared
declaring
beat
square
gray
leads
actual
saved
delivered
lots
del
violations
explosives
constitutions
truck
prime
corp
pacific
subcommittee
weight
eastern
defining
mandate
proud
rhetoric
settle
please
solve
noting
missing
arrived
anniversary
fix
comply
harry
preliminary
disagree
cell
forms
meaningful
operations
iii
bodies
equally
homosexuals
judgment
sons
wesson
sniper
applies
crack
sciences
gasoline
variety
entirely
runs
threejudge
persuade
guarantee
minor
brain
amend
snow
rich
negotiators
alive
convinced
disappointed
passes
boulder
everybody
enjoy
targeted
reid
cdc
madison
manufacture
pull
ambitious
wildlife
completed
notes
greatest
pressing
surrounding
baby
flow
alabama
exposed
grown
committees
exercise
packs
rooms
injuries
immunity
size
reverse
follows
strengthen
extended
medicine
african
discussions
visitors
interested
demanding
implications
accounts
encouraging
liberals
cross
jeff
dakota
taylor
users
liberties
slayings
heller
pollutants
rush
harmful
californians
slightly
girls
exposure
readers
nomination
suffering
teenager
faster
england
climatechange
explained
unique
machines
protects
employers
indiana
prepare
assessment
recorded
voluntary
el
proceedings
fresh
debated
iraq
childrens
outdoor
daughters
display
initially
missouris
chiefs
procedures
outlaw
gaymarriage
appearance
patterns
everywhere
smart
baseball
maximum
banks
restrictive
mall
pastor
bernardino
possessing
promoting
drawn
emerged
ignored
feeling
seized
originally
threatening
completely
reversed
divorce
parent
equivalent
pact
gotten
extremely
revealed
contend
clients
chemicals
analysts
manner
typically
somebody
scalia
beating
hunters
born
guards
boost
cultural
conservation
error
capandtrade
flood
knowledge
recall
demands
surprising
mission
introduce
perfect
pleas
pride
carnage
moms
prospective
fires
petersburg
fraud
houston
picked
core
discovered
character
contrary
insisted
courage
properly
hammer
brothers
website
submit
prospect
exist
bottom
conflict
mentioned
deadline
morgan
tennessee
trust
driver
threw
graham
nonsmoking
cheap
fairness
moves
co2
panels
expansion
glaciers
divisive
demonstrate
advanced
replace
bishops
courthouse
narrow
deserves
chapter
successfully
personally
notion
contentious
participate
bus
proper
testify
sites
exception
reflect
tens
outrage
injury
radical
tonight
discussed
refusing
purposes
scrutiny
veteran
referred
associate
formal
mccarthy
animals
acted
nobody
initial
breaking
federally
prior
complaint
robinson
prisons
oceanic
retail
bears
healthy
researcher
speed
recommend
enforcing
defines
physical
formed
surely
jurisdictions
handed
confessed
bible
generate
thank
desk
border
announcing
rarely
sponsors
prisoner
regulatory
minneapolis
nancy
cool
operation
bigger
selection
spare
owns
nj
chuck
agent
fathers
violating
tragic
liggett
unfair
resolve
intergovernmental
ignore
tend
presence
ends
afraid
towns
driven
ties
formally
whos
payments
roberts
assassination
sevenday
apparent
hillsborough
auto
tears
concept
blow
la
promises
voter
directed
terror
straw
holder
requested
administrator
partly
pace
receiving
favors
desire
delaware
divide
recommendation
alan
moussaoui
client
marrying
practices
preparing
primarily
ongoing
ed
awaiting
listen
nasa
holds
recover
choices
marshall
races
anybody
memo
hills
shut
defenders
secure
beliefs
horrific
custody
slain
argues
knowing
mainly
participants
interstate
sacramento
senates
doctor
workplace
lies
portion
raises
resulted
aid
voices
broadcast
guilt
cheney
epidemic
pronounced
reporter
proved
churchs
ozone
embrace
rapid
village
lawmaker
wednesdays
shots
constituents
frequently
agencys
flawed
construction
suddenly
marks
forcing
founded
pattern
threeday
complicated
healthcare
partisan
statutes
raped
ford
ron
detailed
bronx
debates
credits
pipeline
exists
cooling
window
adviser
worker
17yearold
messages
tomorrow
craig
zimmerman
sit
tiny
pew
sens
sun
interviews
pair
anger
native
loopholes
theyll
jewish
declare
baptist
compelling
membership
bruce
female
spouse
granting
reinstated
pounds
confident
efficient
investors
negative
afford
acknowledge
remaining
contributed
ii
universities
estimate
players
exempt
spared
midnight
episcopal
correctional
examine
dick
drawing
unveiled
warmest
investment
movies
fairly
permission
attitudes
grants
kenneth
narrowly
tragedies
lastminute
floridians
manufacturer
assaultstyle
labor
jennifer
flight
weak
convince
harvard
gunned
anticrime
quarter
swing
feared
posts
praised
profits
municipal
ranks
ross
reviewing
cleaner
feels
francis
endorse
facility
institutions
stayed
sparked
considers
shooters
queens
clark
convenience
sierra
reconsider
resulting
tradition
hollywood
crop
tony
stations
invited
officially
pleased
fill
guarantees
proceed
rob
warner
guess
dekalb
martinez
cobb
practical
utility
attempting
costly
terrible
memorial
miss
collect
stalled
1980s
rhode
extending
clips
escape
minds
preserve
lt
era
procedure
toll
evil
toughest
cop
complaints
ages
garden
enormous
suspended
lay
manufacturing
executing
responses
anyway
hired
jerseys
jeffrey
attending
lowest
orange
complained
republicancontrolled
identification
waves
apart
resume
signal
deliver
oral
viewed
partys
indicate
kick
gained
serial
commonwealth
hb
adams
nightclub
heston
toomey
conclusions
contends
relief
rock
string
regularly
chemical
corporations
sixth
controlled
platform
mistake
shopping
fiveday
personnel
honest
doors
thoughts
minute
enforced
sessions
celebrate
uphold
jurys
stabbing
arming
everytown
rjr
questioning
listed
answers
dcalif
tool
generated
sees
clubs
lawrence
returns
founder
guidelines
shares
slaughter
outofstate
raleigh
offense
warren
moments
recovered
concealedweapons
committing
globe
australia
pinellas
diego
extent
projected
contributing
mondays
sad
montana
pool
cook
signature
sorry
idaho
petitions
congressman
seattle
operating
helps
disaster
features
stringent
extensive
engaged
creates
cnn
punitive
stake
necessarily
shifting
campbell
asks
contended
kills
male
floods
denial
cycle
funded
experienced
pages
train
drinking
submitted
basically
christmas
ray
branch
councilman
fred
resistance
mo
smokeless
disabled
interesting
threaten
discourage
contains
responding
opportunities
scale
highway
northeast
russia
shifted
promising
mitt
images
reviewed
motivated
mcauliffe
juror
camden
franklin
knife
spree
weekly
devastating
principle
embraced
wild
text
rely
speakers
collected
sounds
mix
oakland
roll
screen
incentives
lawful
dinner
learning
silence
chiles
gender
charleston
gunfire
falling
packed
indian
uncertain
equipment
inspired
describe
barely
fields
hailed
objections
rival
maintained
ten
vows
polling
felon
lock
restraining
tells
germany
trends
stark
orleans
emails
studying
reflects
lists
threatens
principal
justify
plenty
awareness
contained
heights
estate
mount
stopping
treasury
ann
carter
deter
acceptance
amended
indicted
civilian
declining
eager
lisa
chinese
mainstream
uncertainty
proposing
handling
curbing
fit
foster
match
troubled
youths
soldiers
juveniles
pataki
edwards
chest
tropical
welfare
analyst
ceo
express
buyer
adoption
unnecessary
letting
airlines
somewhat
newsom
georgians
cox
mail
lax
karen
georges
households
professional
duke
donations
lifetime
zone
timing
canadian
pa
headline
designated
victories
contact
flag
seats
indictment
clause
seas
logic
destruction
focusing
producers
universitys
dianne
controlling
q
strongest
earned
hottest
code
satellite
obligation
thrown
advice
transfer
tactics
implement
temporarily
responsibilities
understood
procedural
priorities
authorized
detectives
aids
ok
deemed
reaching
breaks
brings
vs
drove
games
blunt
keeps
nebraska
refusal
somehow
silver
longstanding
battles
sb
principles
stepped
restricted
stevens
malvo
studied
misleading
evangelical
relevant
lungs
encouraged
combination
plastic
lighting
copenhagen
corner
destroy
colleges
availability
gregory
roy
horror
parade
moreover
adds
greg
10th
carries
bridge
demanded
steady
acres
municipalities
windsor
postdispatch
workplaces
lawenforcement
assaultweapons
insist
poised
fallen
essential
shape
posed
faculty
nice
appropriations
retreat
obtaining
shield
demonstrated
womens
bernie
caucus
abolish
tucson
evans
classaction
tree
undermine
urgent
heating
writes
1970s
allegations
austin
design
chain
involves
patrol
md
abandoned
documentary
bloombergs
strip
feelings
patches
identity
unarmed
pose
qualify
matthew
survive
gulf
roof
halls
regulators
totally
zones
examined
crist
via
dave
coleman
consistently
ring
reno
accidental
alexandria
cocaine
generations
africa
inevitable
decrease
explanation
waters
quietly
propose
inaction
jumped
mitchell
whites
holmes
mexican
suicides
aggravated
burned
content
thursdays
marine
urgency
involve
technical
cards
golden
matt
expects
stanley
exceptions
routine
filibuster
supervisors
marijuana
outlawed
seconddegree
prosecuted
lgbt
tobaccorelated
replaced
caps
offset
struggling
hopeful
substantially
substance
bias
tackle
intention
teaching
fiscal
forget
definitely
capable
hundred
goods
intend
publicity
pasco
vending
unlicensed
barr
smokes
motor
tide
dark
trading
reportedly
reputation
elderly
plead
quoted
fines
context
involvement
janet
deliberations
spoken
mercy
kessler
catastrophic
surveys
contribution
typical
supervisor
throw
lie
hidden
metal
severely
tired
halted
tighten
giuliani
abujamal
ak47
ap
frequent
predictions
jason
managed
featured
pressed
communications
surge
rational
linda
gunshow
chosen
climatic
sight
targeting
conventional
shame
drafted
permanent
remarkable
blocking
delta
feature
declaration
strategies
neighbor
advertisements
pastors
burglary
widow
africanamerican
legalization
restore
accurate
britain
aide
contest
items
gap
rallies
identical
serves
gubernatorial
permitting
boards
reads
abc
manchin
gum
transgender
oppositesex
tape
skeptics
stuff
woods
gather
admit
informed
wood
commitments
soil
upper
depending
russian
extraordinary
youve
ranging
performance
avoided
enacting
mouth
delays
ward
classes
fans
eighth
uniform
heated
accidents
cessation
household
influential
landscape
bound
accepting
produces
poverty
heading
busy
charlie
vital
tex
jonathan
traditionally
chapel
camp
founding
clayton
waited
bail
raping
discriminatory
infringed
abusers
savings
zero
minnesotans
indicates
regard
exemption
berkeley
ease
sector
historical
upset
saving
engage
carefully
scores
symbolic
grassroots
patrons
deals
silent
k
enthusiasts
crazy
volunteer
deputies
port
punish
fridays
growers
bright
sensitive
net
answered
rejecting
normally
pointing
intelligence
presidency
jon
pictures
speeches
backlash
hair
byrd
gerald
sc
bomb
editors
wouldbe
springfield
reforms
antigay
doubts
mans
hole
scenario
todd
device
northwest
interpretation
ridge
olson
missed
yesterdays
farreaching
harrisburg
catch
recalled
rating
lobbied
minnesotas
blessing
senseless
absence
dry
destroyed
capture
gross
switch
france
hotter
mixed
trap
losses
neighborhoods
guaranteed
sport
comfortable
corporation
sufficient
wound
actor
quitting
supportive
griffin
gabrielle
gilmore
4th
gunsafety
shell
emit
observed
fly
adopting
sam
perspective
privately
hire
prayers
jeb
precedent
wounds
solely
littleton
barnes
trayvon
warn
risen
applying
breathe
stem
favorite
tour
quiet
inches
gift
ordinary
launch
awarded
lengthy
trained
russell
governing
antonin
emotion
roman
restriction
pregnant
establishments
billboards
privileges
concerning
dear
negotiated
attributed
appearing
wars
phil
vocal
collective
supplies
donors
evolution
cohen
weigh
outright
newspapers
denounced
frustration
tie
jesus
birth
casey
butts
asthma
burn
resource
producing
color
assistance
reference
proven
celebration
measured
gavin
signaled
democracy
competent
trail
resolved
guests
handled
dny
parker
chewing
nowhere
ratified
conclude
fails
plain
irresponsible
mitigating
aims
retirement
greatly
agreements
stops
barry
confusion
succeed
sells
pittsburgh
sullivan
distribution
memory
investigations
reasoning
reprieve
undercover
webb
lesson
participating
independence
weaken
storage
hadnt
20th
hed
teach
realized
expenses
contain
tweeted
islamic
art
administrative
denies
fundraising
wore
pro
conscience
loving
decides
theft
freedoms
casino
revolution
achieved
merits
assume
painful
prize
alternatives
affects
famous
alter
besides
comparison
11th
nevertheless
disturbing
historically
schedule
performing
liable
lott
offenses
convict
bisexual
lorillard
strength
detective
drilling
visited
delegation
accident
agricultural
category
kicked
route
location
map
advisory
ranges
enjoyed
laid
stuck
lobbys
prefer
peterson
patch
indication
showdown
hanging
cooper
deadliest
nypd
tobaccofree
depend
solid
sustainable
spotlight
intensity
attitude
ga
recognizes
doubled
ineffective
visiting
qualified
mcconnell
disturbed
commentary
investigate
tools
affirmed
starts
marion
grade
childhood
customer
pentagon
bitter
injunction
sisters
privacy
gunfree
voterapproved
ecigarettes
wildfires
celsius
lift
justified
arlington
optimistic
investigating
seemingly
occurring
willingness
dismiss
agreeing
pieces
fierce
ralph
profit
mine
christians
addicted
upcoming
object
horrible
traced
beaten
wright
gunshot
junior
globalwarming
debating
compliance
headlines
concludes
inconvenient
wisdom
articles
useful
array
french
toxic
monitoring
reed
listening
anymore
advocating
journalists
gold
cameras
broward
wealthy
contracts
jesse
assemblyman
nuptials
botched
gunmakers
relative
educational
investments
disagreed
rolling
laboratory
onethird
dream
careful
swift
overturning
gallup
automatically
weighing
upholding
intervene
marched
objected
touch
loud
diaz
prosecute
heinous
glock
discussing
southeast
thousand
methods
centuries
surveyed
holiday
prospects
emerging
london
dependence
nobel
advisers
approving
covering
overcome
nathan
missourians
burns
marco
legislator
brutal
lifted
christ
prescription
producer
edition
stick
midwest
negotiating
likelihood
jump
clouds
slowly
guide
dedicated
airline
cry
aggressively
southwest
traveled
rabbi
lesser
separately
attached
navy
acceptable
prop
cbs
carolinas
unrelated
lying
injections
interracial
eve
factories
excuse
census
nonetheless
scope
attracted
voiced
competitive
carol
considerable
stress
demonstration
lifestyle
grave
christine
employment
respondents
arrests
washingtons
title
sentiment
vendors
aggravating
quinn
buildup
fish
tracks
covers
affecting
activism
singer
yard
friendly
stanford
scheme
cooperation
eat
bradley
forever
ridiculous
demonstrations
premature
1960s
belt
superintendent
airports
doctrine
discretion
wording
ferguson
discount
anne
robbed
backgroundcheck
rocky
reliable
rejection
arthur
mere
councils
potent
visible
graduate
doug
confidence
confront
selected
photos
prompting
recreation
crowded
circulation
leaf
intends
outspoken
metropolitan
charlotte
hearts
buried
coloradans
blocks
shocked
dog
hunter
pension
lifelong
alexander
deterrent
gwinnett
unexpected
cite
existence
depends
materials
offensive
ore
reveal
ninth
oh
gordon
corbett
reluctant
poses
progressive
distributed
print
carl
plane
luther
clarence
portrayed
volunteers
devoted
material
plot
gains
locations
ben
sheet
skeptical
inadequate
automakers
shifts
extends
tone
turner
experiment
babies
passionate
ethics
accusing
gods
educators
succeeded
walls
borders
evolving
billboard
simon
accidentally
sooner
determining
epas
debt
whenever
noaa
islands
spots
improving
roads
somewhere
21st
attacking
perfectly
blasted
tested
smiths
reversal
modified
seize
kaine
hudson
theodore
unfairly
reserved
undergo
football
electrocution
heterosexuals
framework
profound
brazil
exemptions
enemy
financing
accompanied
appealing
bold
biological
twin
beings
sends
creation
struggled
plays
ordering
habits
similarly
fights
suggestion
bennett
jimmy
consultant
writers
screening
imprisonment
ramsey
hatch
knives
phenomenon
topics
polluters
economists
renew
situations
explaining
consecutive
metric
suburbs
dissent
reminder
roger
concert
commonly
elizabeth
phrase
keith
summers
mounting
praise
neighboring
absolute
immigrants
freed
walter
casinos
rail
conceded
planets
negotiate
merit
backs
briefly
vision
forth
warrants
element
dirty
foes
super
teams
tar
dropping
captured
stadium
ignoring
electronic
deliberated
pretrial
funeral
instructions
cable
throat
lambda
anticipated
passengers
disclose
diverse
kitchen
emitted
approximately
seventh
alameda
animal
cells
empty
reasonably
persuaded
differently
channel
frustrated
trace
routinely
detail
carnahan
tries
odonnell
sexually
classroom
lane
interviewed
alike
coffee
lied
noon
assigned
accountable
bench
incumbent
presbyterian
grief
charlton
economies
walmart
dire
certainty
rio
contributes
establishing
assertion
random
attract
foot
updated
dominated
scenes
coordinator
brooks
kim
overseas
professors
johns
describes
aspects
precisely
stable
nights
champion
beer
delivery
confronted
bag
bucks
checked
grove
approached
youngsters
economics
explicitly
fraction
elements
disputes
versions
prevents
exxon
gores
strangled
raymond
implemented
vietnam
festival
bed
passenger
hero
setback
listened
labels
boyfriend
legality
pete
insanity
antonio
constitutionally
accomplice
denomination
19yearold
gangs
exonerated
massacres
adequate
approaches
invoked
developments
safely
score
mandates
participated
damaging
unusually
mandated
farmer
ticket
insane
youll
hazards
logical
highlighted
windows
subsequent
twoyear
bell
nicholas
lone
strictest
voluntarily
rallied
bunch
classrooms
repealed
shock
rage
revolver
15yearold
nosmoking
residential
titled
wyoming
determination
literally
theyd
removing
rid
wishes
stars
passion
competing
concrete
alarming
german
revised
nino
collection
theme
featuring
scholars
celebrated
spurred
lights
pennsylvanias
trenton
extension
kid
politician
seconds
myers
underage
civilians
altria
operate
automobiles
legacy
notably
disclosure
sundays
meets
remote
examples
ethanol
intervention
birds
stripped
ranked
liquor
herring
lautenberg
escaped
wear
disappeared
civic
band
catholics
disability
dad
misconduct
postal
confession
turnout
sean
vincent
racist
projections
reflected
observers
abroad
humanity
stream
tremendous
function
import
scare
salt
counting
lab
hansen
societys
powell
instances
preferred
reinstate
militias
interpreted
comfort
graphic
garcia
physicians
jacksonville
skepticism
altered
crops
output
sole
returning
sudden
tank
taught
blog
10year
agrees
packing
dealt
eliminated
opens
wins
lunch
stewart
freeman
improved
outraged
conversations
reminded
confrontation
fundraiser
paterson
integrity
lands
fisher
sharing
player
aspect
asserted
implementation
glass
16yearold
televised
welcomed
demonstrators
proliferation
creek
spirit
recess
neck
chronic
conducting
clarify
smell
reservations
english
void
fe
bearing
labeled
administrators
newark
repeat
stating
