said
gun
state
would
law
year
court
new
marriage
one
people
death
right
bill
u
immigration
federal
say
last
immigrant
president
two
gay
could
time
mr
case
also
samesex
issue
house
change
country
city
national
united
climate
weapon
week
republican
american
group
many
day
control
county
ban
first
school
make
illegal
senate
official
firearm
penalty
legal
judge
public
percent
amendment
couple
even
police
government
support
like
may
shooting
month
attorney
global
vote
life
get
supreme
nation
measure
since
child
warming
take
decision
way
crime
washington
congress
three
legislation
california
million
member
emission
florida
want
rifle
check
family
york
gas
murder
whether
including
appeal
policy
man
justice
show
made
district
come
violence
bush
today
dont
woman
tuesday
democrat
political
work
need
criminal
home
background
second
plan
debate
administration
handgun
part
without
number
union
action
monday
report
execution
wednesday
much
association
another
leader
obama
world
office
found
nra
department
back
thursday
according
think
ruling
effort
carbon
act
lawyer
campaign
told
go
citizen
general
high
service
center
use
gov
next
system
program
used
still
among
white
student
going
assault
called
question
friday
worker
ago
put
problem
permit
well
long
border
sentence
convicted
greenhouse
clinton
news
know
study
america
trial
energy
local
passed
civil
proposal
former
must
power
carry
already
benefit
yesterday
killed
trump
enforcement
prison
university
record
lawmaker
call
advocate
committee
four
voter
community
recent
sale
agency
several
help
john
officer
defense
every
governor
place
killing
prosecutor
sen
company
church
security
jury
san
allow
effect
five
set
health
virginia
owner
keep
see
came
legislature
others
might
least
business
good
job
license
capital
become
authority
area
across
end
asked
thing
face
charge
scientist
hearing
rule
georgia
texas
constitutional
order
le
shot
thats
give
safety
democratic
march
believe
victim
past
point
never
level
conservative
mayor
far
director
men
mass
around
st
majority
saying
evidence
took
senator
likely
environmental
person
resident
nearly
colorado
fact
human
executive
statement
constitution
left
little
party
force
six
later
election
concealed
stop
yet
rep
away
conference
side
punishment
supporter
guncontrol
hour
protection
dioxide
step
major
argument
cost
expected
research
mean
organization
enough
money
reason
decade
trying
though
candidate
stand
chief
increase
purchase
hand
partner
industry
attack
domestic
period
approved
opponent
move
voted
whose
row
pas
proposed
arm
making
im
sign
find
night
meeting
reduce
council
street
inmate
lesbian
similar
however
result
something
let
social
allowed
married
temperature
held
car
limit
challenge
dealer
june
letter
plant
important
process
thousand
drug
black
clear
individual
mexico
charged
released
status
poll
international
line
wrote
tax
earlier
north
look
claim
regulation
board
announced
mother
hope
history
reform
lawsuit
legally
filed
view
maryland
didnt
undocumented
taking
matter
restriction
cause
protect
lead
got
began
position
seek
buy
cut
circuit
along
fight
agent
require
instead
doesnt
panel
taken
rate
young
presidential
head
better
employee
sentenced
jersey
almost
brady
spokesman
nothing
idea
deal
waiting
talk
south
scheduled
within
event
often
early
care
missouri
parent
deportation
george
air
visa
recently
given
lot
guilty
known
ruled
fuel
anyone
michael
mexican
pay
science
current
stay
able
concern
ground
sunday
based
fear
future
signed
college
legislative
cant
opinion
prevent
outside
agreement
activist
live
term
information
friend
done
threat
address
issued
open
seeking
although
using
word
hold
robert
illegally
toward
big
bear
there
james
standard
lobby
provision
real
response
working
different
led
private
david
consider
really
someone
water
atlanta
population
kind
provide
citizenship
earth
include
store
favor
marry
louis
review
cannot
west
massachusetts
continue
executed
comment
interview
economic
went
name
economy
son
run
top
expert
alien
kill
july
failed
building
saturday
press
society
getting
despite
session
post
representative
list
arrested
story
mental
impact
father
war
large
possible
data
april
required
seven
ice
ever
small
rather
attempt
dozen
mark
sent
wife
r
accused
november
francisco
final
hundred
fire
arizona
wanted
document
conviction
die
request
ballot
terrorist
became
try
half
coming
decided
begin
foreign
park
chance
turn
beach
offer
late
feel
billion
opposed
allowing
morning
dead
killer
best
free
strong
committed
source
full
target
proposition
added
needed
congressional
special
wrong
age
brought
key
great
risk
sheriff
bring
illinois
massacre
secretary
sense
interest
near
agreed
jr
died
juror
theyre
growing
defendant
serious
start
argued
naturalization
certain
application
fall
he
obamas
degree
smith
read
thought
semiautomatic
refugee
close
opposition
gop
example
sea
wont
behind
initiative
tell
largest
military
lethal
meet
politician
decide
received
rejected
politics
soon
tried
town
message
injection
goal
hard
eight
legislator
reported
religious
together
access
always
card
bureau
battle
latest
living
m
sure
rise
race
paul
potential
ask
armed
bar
longer
old
sept
dc
project
relationship
in
push
natural
seen
movement
commission
violent
ad
role
denied
capitol
return
form
ownership
belief
body
isnt
carrying
common
editor
coal
technology
oil
subject
hispanic
average
turned
chairman
hear
william
speech
pennsylvania
answer
anything
education
significant
century
attention
jail
lost
magazine
grant
article
banning
gave
either
witness
summer
front
language
demand
leading
buyer
j
unconstitutional
calling
atmosphere
simply
minnesota
freedom
island
third
arrest
refused
paper
opportunity
investigation
fbi
supported
professor
course
assembly
green
heard
chamber
probably
hill
richard
finding
fund
los
equality
focus
rally
denver
dangerous
apply
spent
considered
love
carolina
scott
medium
especially
nine
employer
seems
higher
suit
approach
heat
vice
leave
philadelphia
central
yes
increased
ammunition
showed
brown
lower
agree
environment
daughter
boy
china
jan
chicago
safe
requires
vehicle
weather
responsible
actually
ordinance
ill
bad
coalition
recognize
pollution
teacher
book
suspect
protest
short
available
included
difficult
wedding
joined
block
guard
liberal
involved
thomas
solution
medical
create
personal
rising
nationwide
husband
release
treaty
sought
mile
driver
parole
spring
amount
sell
angeles
speaker
adult
ceremony
hall
allows
resource
granted
requirement
following
changed
clean
passage
raise
editorial
per
campus
worked
mentally
pistol
ordered
minute
particularly
helped
floor
annual
elected
martin
quickly
labor
requiring
victory
january
connecticut
electric
remain
brother
la
newtown
land
offered
kid
perhaps
scientific
w
site
gore
count
institute
looking
testimony
everyone
true
moment
activity
room
price
oppose
possession
running
understand
single
rest
food
road
difference
powerful
bloomberg
charles
beyond
agenda
practice
manufacturer
series
reporter
bay
december
figure
approval
market
donald
region
estimated
win
kyoto
pressure
test
struck
palm
team
researcher
commissioner
relative
southern
patrol
convention
equal
version
feb
ocean
started
chair
tragedy
lawabiding
condition
insurance
parkland
senior
budget
declined
door
bullet
catholic
innocent
discussion
drive
buying
survey
asylum
includes
doubt
staff
immediately
caused
mind
present
due
asking
moved
english
oct
dec
reduction
miami
fossil
created
assistant
pm
latino
plea
weve
happened
reach
concerned
davis
trade
value
petition
raised
homeland
designed
giving
tom
critic
met
forward
voting
introduced
range
tough
sponsor
existing
light
responsibility
property
noted
choice
homicide
play
necessary
east
watch
pending
felon
commitment
judiciary
bipartisan
airport
saw
l
sold
deputy
delay
written
wait
fla
happen
unusual
heart
licensed
planet
date
reducing
columbia
save
robbery
spoke
reached
voice
gang
discrimination
class
institution
oklahoma
development
defend
controversial
compromise
account
appeared
v
hospital
spokeswoman
reasonable
model
factor
nov
total
lack
purpose
ability
facing
type
produce
avoid
felony
primary
operation
sandy
published
slaying
mostly
urged
speak
join
forced
dollar
violation
intended
johnson
stopped
banned
heterosexual
seem
remains
jose
declared
easy
argue
douglas
bob
promise
wake
shift
author
greater
training
deadly
pleaded
gunman
expect
youre
else
temporary
loophole
resolution
analysis
e
custom
send
aimed
wasnt
crowd
largely
shop
page
field
alone
talking
unless
stricter
highest
consequence
minister
murderer
socalled
permanent
tampa
weekend
fee
veto
hit
additional
considering
visit
eligible
leadership
trend
partnership
share
inside
comprehensive
sex
selfdefense
homosexual
fellow
increasing
follow
clerk
firstdegree
previous
conn
vermont
described
carried
round
liberty
receive
affect
applicant
ive
epa
add
elementary
brooklyn
barack
separate
continued
break
video
appears
fired
arent
sexual
jim
followed
moving
situation
firm
tougher
williams
detention
coast
bank
february
incident
girl
repeal
changing
finally
file
sponsored
planned
television
writer
everything
extreme
forest
growth
associated
ended
king
gone
specific
estimate
el
certainly
impose
biggest
statute
spending
usa
upheld
truck
provided
speaking
holding
note
recognition
prosecution
sentencing
beginning
guy
experience
announcement
traditional
cuomo
strategy
believed
danger
restaurant
prisoner
neighborhood
investigator
effective
broad
prove
alcohol
poor
wall
reagan
god
paid
station
willing
hook
clearly
financial
determine
detail
main
wouldnt
reality
middle
deported
path
serve
simple
foot
build
deny
electricity
email
christian
priority
credit
driving
possibility
sometimes
october
apparently
club
suggested
minority
adopted
accept
obtain
cuban
european
aid
whats
leaving
ohio
wilson
fighting
pushing
eye
amnesty
kennedy
fine
drought
focused
limited
expand
throughout
popular
terrorism
addition
advocacy
supporting
culture
vega
huge
shooter
recognized
online
increasingly
wave
piece
appear
kept
shotgun
august
proponent
fair
previously
condemned
manhattan
al
afternoon
generation
opened
easier
legalize
aug
hunting
curb
ready
lee
passing
brief
rev
suspected
enter
knew
dr
sister
northern
ahead
twice
facility
standing
native
enforce
package
santa
compared
enacted
served
whole
seemed
respect
showing
expressed
ryan
commit
option
joe
returned
column
felt
cited
wounded
september
worst
computer
failure
mandatory
statewide
mom
sound
basic
teenager
space
adding
wind
damage
promised
spend
critical
currently
superior
lived
burning
otherwise
cover
foundation
upon
suicide
neither
spouse
daily
product
none
calif
judicial
born
keeping
nature
moral
backed
chinese
developing
putting
discus
newspaper
arrived
andrew
progress
threatened
tobacco
joseph
manager
movie
base
ensure
basis
funding
overturned
b
maybe
colleague
related
doctor
atmospheric
canada
involving
rape
client
alternative
starting
track
romney
verdict
hurricane
applied
haitian
named
selling
warning
loss
regulate
entire
arguing
columbine
definition
antigun
truth
cap
particular
hillary
caught
statistic
abortion
valley
meanwhile
seat
storm
politically
behalf
procedure
elsewhere
task
becoming
lock
drew
f
radio
tree
edward
low
bishop
orlando
custody
travel
harm
stephen
customer
represent
concluded
treatment
endorsed
bought
abuse
rick
dropped
shoot
journal
worth
lobbying
conducted
ten
gathered
influence
neighbor
occurred
organizer
machine
militia
historic
de
opposes
entered
holder
stood
disease
utah
boston
trigger
lake
criticism
generally
c
testified
defeat
exactly
remark
eventually
produced
stock
emergency
emotional
wisconsin
dream
cruz
jurisdiction
housing
crisis
aide
army
delegate
utility
mike
scene
violated
chris
false
contract
approve
fewer
conclusion
queen
worry
warrant
strict
progun
warned
jones
repeatedly
recommendation
renewable
suggest
regarding
openly
nuclear
supply
arctic
lobbyist
phone
negotiation
continues
counsel
stage
raising
highly
sort
learn
indeed
racial
migrant
fox
potentially
retired
courtroom
defender
apartment
prohibit
represents
sander
search
conduct
immediate
planning
game
couldnt
circumstance
pushed
host
stoneman
protocol
western
flood
faced
fully
cold
easily
provides
winter
trip
minor
juvenile
un
strongly
providing
id
section
shouldnt
ran
iowa
complaint
japan
lose
allen
guarantee
walker
pattern
illness
registration
alleged
consensus
overall
hire
oregon
cop
admitted
walk
claimed
ally
motion
hurt
unlikely
gain
various
gunrights
setting
referendum
survivor
harris
production
wayne
farm
conversation
rural
injury
criticized
plaintiff
secure
tv
offering
determined
drop
complex
opening
prohibited
season
blame
exchange
stance
advance
proceeding
straight
extend
wish
solar
tie
adam
hawaii
independent
faith
picture
census
worse
meant
performed
landmark
success
welfare
veteran
wed
choose
amid
methane
acknowledged
learned
sued
division
opposing
reaction
marjory
challenged
urging
presented
helping
ton
youth
europe
vowed
maker
concealedcarry
original
h
india
summit
contribution
serving
protecting
flow
enact
phase
telling
identified
van
miller
reelection
network
offense
organized
signature
specifically
seriously
dispute
respond
frank
red
safer
divided
sweeping
photo
cruel
predicted
automatic
steve
table
acting
pretty
here
thinking
bringing
prepared
nominee
duty
instance
turning
suggests
complete
imposed
pastor
larger
creating
severe
draw
challenging
minimum
restrict
quite
ultimately
combat
topic
broken
method
environmentalist
placed
anthony
detained
reading
urban
except
wage
filing
taxpayer
stronger
supposed
obtained
effectively
prompted
murdered
christie
prospect
writing
coverage
bombing
schumer
consumer
limiting
sport
mountain
intent
feeling
fundamental
daniel
image
strike
principle
publicly
maine
affair
bus
whatever
baby
connection
meaning
vast
improve
guest
pointed
ronald
database
aim
regardless
usually
link
fourth
protester
registered
evening
cuba
barred
rose
prominent
register
happening
mary
consideration
traffic
refuse
dna
allegedly
longterm
virtually
web
directly
welcome
attempted
construction
river
loaded
hot
slow
kelly
fort
deep
injured
walked
shown
rubio
lapierre
looked
attend
issuing
shall
paris
transportation
mention
draft
deadline
forum
unit
linked
heavily
happens
correction
pledge
alaska
affected
blocked
rampage
inc
decline
promote
clemency
shortly
honor
licensing
deport
grand
outcome
prince
fell
visitor
offender
employment
instant
residency
explain
hasnt
overturn
device
treated
industrial
patrick
nonprofit
behavior
prevention
religion
iraq
dramatic
widely
reduced
adopt
peter
commercial
murdering
specie
peace
expanded
michigan
roughly
va
angry
valid
flight
aside
bit
headed
closed
losing
appropriate
regional
spot
possibly
montgomery
identification
albany
thus
worldwide
income
household
hoping
registry
efficiency
proof
dealing
flag
gathering
rare
bond
handle
universal
deathpenalty
worried
fate
supervisor
relation
owned
protected
fatal
ought
surprise
pew
harder
cross
identity
broader
multiple
adviser
responded
remember
highcapacity
atf
closer
direct
notice
camp
representing
crack
cutting
questioned
warmer
established
eric
hotel
played
playing
pain
unable
folk
prohibits
longtime
tech
relatively
n
relief
pick
causing
legitimate
cast
kansa
trouble
broke
perry
obvious
jackson
jerry
indicated
older
attended
percentage
bump
star
hampshire
conspiracy
downtown
pope
encourage
foreigner
passenger
hunter
volunteer
pulled
burden
internet
film
halt
successful
fatally
richmond
massive
developed
tool
sensible
seller
kerry
fast
pledged
violate
smuggling
career
becomes
endorsement
intense
overwhelming
contribute
commerce
citing
audience
fraud
mccain
error
misdemeanor
struggle
sending
raid
us
remove
fix
launched
firing
warm
mistake
reject
exception
secret
defeated
avenue
remained
cell
aggressive
purchased
denying
write
theater
mandate
renewed
thanks
g
prevented
arkansas
deeply
unfortunately
controversy
significantly
trafficking
violates
spread
lie
built
hiring
filled
cash
headline
split
moderate
onto
fill
brian
boat
methodist
window
advantage
disaster
theyve
striking
stolen
muslim
identify
joint
reporting
absolutely
happy
backing
define
prohibition
wonder
therefore
attitude
dismissed
unanimously
grew
facebook
pursue
modern
detective
sue
heattrapping
urge
double
hoped
cultural
failing
vulnerable
anywhere
thompson
academy
zone
stated
murphy
suffered
appealed
overwhelmingly
momentum
begun
conflict
crucial
closing
telephone
recommended
entry
understanding
larry
owen
impossible
contrast
dan
feature
diego
professional
tim
associate
metro
blood
alabama
orientation
kidnapping
closely
posted
investment
referring
removed
demonstration
african
entitled
explosive
cry
ending
p
suburban
purchaser
legalizing
familiar
sat
indictment
militarystyle
establish
quality
nevada
margin
rhetoric
seeing
pose
mission
league
box
dean
bid
picked
soldier
civilian
surface
expensive
agriculture
farmer
baltimore
ashcroft
muhammad
signal
rain
represented
giffords
unmarried
eliminate
gary
essentially
animal
accepted
walking
posse
hate
wide
substantial
normal
eastern
havent
barring
direction
continuing
balance
expanding
receiving
gonzalez
nomination
paying
hired
handful
barbara
henry
alliance
newly
twitter
wound
reid
backer
sanctuary
dennis
asian
houston
knife
british
administrator
appearance
timothy
accident
terry
modest
addressed
watched
jay
correct
jewish
deciding
ar15
accord
melting
wood
moratorium
defending
dallas
smuggler
sun
patient
surprised
feinstein
truly
aware
numerous
dick
9th
extended
addressing
howard
theory
nelson
kevin
positive
deserve
corporation
leaf
fought
retarded
blamed
unlike
ring
qualify
attacked
fairfax
commonsense
tighter
overhaul
assistance
active
sitting
louisiana
confirmed
lewis
aurora
innocence
anderson
management
widespread
plane
appointed
analyst
sharp
enforcing
unprecedented
colo
grown
covered
parking
shes
quick
score
marked
ted
baker
waste
subcommittee
crossing
usual
beating
girlfriend
announce
treat
settled
completed
train
nationally
presence
granting
tuition
pollutant
implication
oped
fail
talked
location
airline
imagine
tradition
opposite
proper
twothirds
sarah
pat
garden
shared
negotiator
founder
schwarzenegger
internal
reader
claiming
greenhousegas
heavy
tear
website
suburb
divide
nearby
fence
younger
courthouse
awaiting
clara
afraid
core
favored
ken
stem
entering
yorkers
detainee
highway
sharply
hardly
joining
congressman
delayed
taylor
teen
unclear
delivered
repeated
surge
permission
birth
legalized
capacity
develop
graham
achieve
glacier
obligation
recognizing
jeff
ny
missing
harry
aftermath
legalization
dramatically
obviously
contentious
drawn
nichols
owning
branch
defended
discovered
locked
1990s
trust
merely
indian
pull
cleared
watching
temporarily
arrival
participate
tactic
beat
maintain
perform
speed
chapter
flooding
permitted
corporate
typically
fiscal
dole
prayer
nasa
solve
village
terror
highprofile
partisan
tallahassee
del
privilege
foreignborn
preventing
tied
atlantic
latin
stake
werent
deathrow
lesson
constitutionality
saving
signing
rival
snow
surrounding
susan
realize
clip
demanding
applying
transfer
wearing
blue
headquarters
cheap
sector
ship
size
migration
proud
revenue
importance
classroom
consistent
inspector
omalley
scrutiny
survived
character
fingerprint
execute
gunrelated
odds
seized
height
grow
declaring
mitt
defined
gayrights
stabbed
sniper
graduate
testing
merit
restricting
reno
doma
polar
pair
miss
canadian
mccarthy
certificate
fairness
mcveigh
chose
vetoed
germany
category
spanish
originally
gray
equally
finance
manner
counter
insisted
emotion
homosexuality
coastal
driven
notion
smaller
hell
extra
allegation
winning
embrace
jack
everybody
bridge
unanimous
desire
ambitious
rich
plus
pacific
breaking
expansion
emerged
ignored
poverty
indiana
music
loved
chemical
assessment
rush
tonight
escape
hunt
actual
outrage
donation
override
prohibiting
ultimate
variety
highlight
divisive
tomorrow
biden
fled
disagree
binding
denial
participant
appellate
desert
fulton
divorce
replace
boulder
manmade
rapid
debated
art
camera
element
fifth
anger
janet
arnold
industrialized
collins
cycle
defining
pride
noting
tennessee
threejudge
constituent
meaningful
greatest
pressing
player
suggesting
ii
alan
crackdown
incentive
primarily
follows
russia
steven
anniversary
clergy
coalfired
predict
satellite
alive
strengthen
scheme
revealed
preparing
match
properly
amend
display
h1b
founded
recall
demonstrate
prime
maximum
jefferson
mall
kentucky
pipeline
complicated
fahrenheit
radical
pace
occur
regulated
communication
resolve
referred
fit
nixon
advanced
targeted
rapidly
faster
corner
entirely
material
rank
producer
christopher
intention
acted
restrictive
salvador
soil
root
tourist
square
russian
durham
petersburg
portion
californian
suffer
auto
wildlife
co
explained
remaining
interstate
unique
afford
resulted
attending
applies
martinez
africa
knowledge
uncertainty
extremely
deliberation
hammer
initially
exercise
comply
exist
bail
refusing
vow
introduce
desk
aspect
giant
imposing
swing
combined
nj
courage
voluntary
economist
please
surprising
memo
sanction
tend
shut
physical
outlaw
somebody
rarely
pass
protects
lawful
initial
burn
threatening
journalist
contact
contrary
prepare
disappointed
guideline
persuade
smart
preliminary
chuck
formal
interested
shortage
stayed
reverse
marshall
male
gotten
membership
resume
concept
requested
submit
assassination
prospective
unfair
slightly
blow
bomb
qualified
tide
knowing
suddenly
apart
caucus
prior
purchasing
route
judgment
authorized
cobb
corp
sierra
crop
saved
fresh
stalled
recorded
reflect
objection
annually
motor
port
female
bronx
narrow
violating
wesson
indicted
heller
hopeful
england
gasoline
import
contend
discussed
nobody
equivalent
giuliani
bernardino
possessing
platform
hillsborough
mainly
feared
nancy
scale
rock
suspended
robinson
formally
surely
teaching
personnel
sacramento
austin
perfect
eager
apparent
dakota
directed
federally
quarter
estate
morgan
contest
convinced
bottom
attempting
everywhere
prediction
ethnic
ignore
climatechange
unveiled
detailed
chain
litigation
personally
invited
ongoing
foster
handed
scalia
raped
france
boost
baptist
german
encouraging
francis
deserves
yard
listen
stepped
commonwealth
completely
questioning
announcing
conservation
clark
learning
mentioned
engineer
gap
formed
tragic
warren
gaymarriage
spare
express
reversed
sparked
scenario
era
officially
drove
broadcast
threw
haiti
orange
factory
gift
bag
routine
capandtrade
mississippi
partly
craig
1980s
ross
horror
carnage
buck
horrific
bound
co2
marine
childrens
successfully
hb
declare
proved
code
testify
manufacture
argues
moore
cook
roof
abandoned
theft
convict
lay
preserve
nc
australia
experienced
anybody
cite
mainstream
terrible
difficulty
christmas
complained
regular
teach
garcia
defines
disabled
slain
automobile
forcing
soviet
regulating
adoption
praised
sentiment
rating
bible
committing
struggling
focusing
ed
actor
obtaining
ticket
memory
seattle
northeast
oceanic
southwest
acknowledge
flawed
threeday
fairly
marco
stopping
moussaoui
burglary
profit
globe
enormous
tucson
color
suffering
exists
thank
cheney
packed
handling
residence
rabbi
confessed
marrying
selection
roll
waited
embraced
fly
pool
iii
frustration
ease
cnn
sporting
barely
bigger
consumption
tiny
minneapolis
tighten
intergovernmental
golden
item
silver
sb
clause
sheet
frequently
plain
practical
contributed
idaho
mail
drawing
advertising
uphold
sevenday
intelligence
cloud
memorial
straw
fed
agricultural
responding
bruce
mine
recommend
workplace
maria
reference
retailer
congregation
ozone
pronounced
advice
earned
celebration
enjoy
controlled
republicancontrolled
epidemic
castro
lt
persecution
who
tex
reflects
promising
islamic
skill
outofstate
submitted
pact
principal
jennifer
explanation
rio
denomination
examine
tony
reviewing
compelling
sit
celebrate
dianne
parade
sixth
campbell
gender
alexandria
reprieve
illegals
pleased
cooling
efficient
costly
confident
investor
longstanding
ford
deemed
interpretation
reconsider
strip
quietly
gained
aggravated
shore
administrative
screen
rely
proceed
brings
sight
negative
investigate
dog
donor
franklin
admission
rob
contractor
spared
gunned
immunity
lastminute
theyll
deliver
warner
dcalif
troubled
delaware
carter
shield
episcopal
correctional
elderly
jesus
reinstated
ray
presidency
resistance
oakland
municipal
essential
studying
weak
settle
inspired
demanded
enforced
guilt
describe
midnight
extending
anticrime
proposing
implement
lawrence
string
regard
mount
viewed
journey
endorse
targeting
pa
motivated
honest
cox
childhood
lawenforcement
writes
perspective
convince
britain
promoting
insist
uncertain
investigating
extent
considers
17yearold
ridge
montana
threaten
elli
laborer
warmest
skeptic
nebraska
guess
zimmerman
text
tour
reviewed
user
abroad
touch
mcauliffe
paperwork
wouldbe
nightclub
assaultstyle
hole
shifting
award
understood
landscape
necessarily
democracy
stamp
expense
sam
israel
toomey
mix
gulf
listed
shifted
polling
barrier
tape
serial
returning
elian
map
reaching
narrowly
q
moreover
trail
fiveday
engaged
heading
holiday
slaughter
municipality
phoenix
admit
deter
urgent
delegation
silence
inch
typical
plenty
refusal
processing
suggestion
toughest
confusion
sad
arlington
racist
cleaner
stark
orleans
contributing
justify
stringent
reportedly
madison
halted
tank
shopping
spoken
toll
marched
bias
executing
jew
stabbing
passport
metal
wild
declaration
extensive
diverse
demonstrated
blessing
indicate
recovered
windsor
spree
destruction
projected
tackle
devastating
heated
unnecessary
acceptance
liability
pinellas
trained
twin
discretion
shape
trap
precedent
appropriation
mo
blocking
throw
pilot
floridian
roman
sorry
letting
heston
noncitizen
net
wildfire
matthew
fred
thrown
interesting
maintained
object
hailed
pressed
creates
channel
gubernatorial
abuser
desperate
arrive
loan
dying
posed
asks
context
gather
theme
scholar
dark
jumped
walter
guatemala
lax
everytown
generate
newsom
consultant
retreat
involves
denounced
undermine
capture
resulting
treasury
basically
diversity
instruction
hair
backlash
gunfire
concealedweapons
arming
ron
skilled
equipment
improvement
generated
baseball
k
combination
accepting
restore
rhode
exemption
contends
camden
plead
silicon
evangelical
ap
payment
suing
busy
replaced
reputation
charleston
jeb
operating
simon
founding
fan
via
serf
collect
antonio
vietnam
restraining
uniform
fleeing
holmes
prosecuted
arriving
tropical
copy
stretch
educational
extraordinary
blunt
library
cooperation
kenneth
troop
pentagon
falling
shame
evil
grade
funeral
chapel
plastic
threatens
rational
inaction
gregory
involve
hollywood
missed
indication
metropolitan
boycott
demonstrator
somehow
availability
logic
accurate
offset
contended
urgency
enemy
filibuster
crossed
incumbent
10th
discriminatory
instate
bird
timing
lifetime
vital
forget
tone
traveled
assertion
procedural
regularly
enthusiast
removal
seconddegree
rodriguez
automatically
brain
performance
ranging
phrase
informed
carefully
harsh
abolish
marijuana
injunction
teenage
catch
jeffrey
duke
winner
sensitive
privately
steady
encouraged
dekalb
zero
anyway
severely
mitchell
recalled
solely
dny
grove
parker
widow
unlicensed
documentary
poised
contained
gate
owns
relevant
abc
accomplice
pardon
gunshot
punish
somewhat
hottest
controlling
technical
jason
harvard
design
hidden
traditionally
southeast
propose
intend
griffin
sand
jon
schedule
absence
1970s
commentary
declining
frequent
excuse
crowded
pataki
fugitive
malvo
antiimmigrant
tweet
comparison
survive
quiet
resort
crash
plot
engage
routinely
weight
visiting
concentration
pete
silent
comfortable
karen
destroy
restricted
capable
humanity
cool
observer
stream
grassroots
forecast
matt
bernie
arrangement
governing
11th
navy
powell
mercy
byrd
freed
diaz
spirit
screening
monitor
greg
historical
mixed
dinner
elizabeth
ride
strongest
accidental
delta
upset
tired
chest
gwinnett
assaultweapons
shadow
avoided
appointment
stevens
remarkable
noaa
sick
walmart
unarmed
curbing
crew
progressive
sufficient
lisa
involvement
amended
artist
hightech
evans
simpson
title
prize
dry
participating
visited
collected
studied
rejection
counterpart
carlos
cousin
councilman
advertisement
escaped
unemployment
upper
weekly
circle
managed
passion
quoted
foe
roy
inevitable
lift
berkeley
farreaching
contains
symbolic
lengthy
spotlight
postdispatch
hero
backlog
dreamer
privacy
transgender
catastrophic
influential
pound
faculty
funded
examined
shell
reminder
normally
ok
stewart
wright
consistently
interviewed
juan
nurse
barr
copenhagen
destroyed
asia
traveling
20th
swift
drafted
bright
pro
assume
safeguard
hed
afghanistan
bed
guide
ann
linda
expired
lgbt
rejecting
revolution
expects
depending
republic
reef
crist
publicity
risen
denies
exempt
newcomer
crazy
extremist
employed
georgian
raping
ak47
salvadoran
burned
civic
stuck
answered
wealthy
weigh
guaranteed
debating
pointing
ordinary
bell
herring
raleigh
nathan
transaction
cooper
prosecute
littleton
daca
chosen
decrease
favorite
empty
substantially
independence
festival
resolved
depend
trace
attracted
fallen
jump
oral
pregnant
determination
confrontation
enacting
ga
humane
manchin
abujamal
probation
vision
reed
featured
london
awareness
profile
disturbing
ceo
academic
conscience
grandmother
champion
coleman
gunshow
permitting
nice
component
scope
launch
fierce
nowhere
french
northwest
acre
creation
pack
overseas
manufacturing
reasoning
youve
concerning
gerald
upcoming
sportsman
photograph
fake
jordan
cocaine
undercover
oppositesex
heating
climatic
greatly
stress
fundraising
settlement
spitzer
mcconnell
repeat
md
historically
feed
identical
decides
kitchen
checked
revolver
producing
misleading
reversal
gavin
master
collection
improving
regulatory
obstacle
physician
suspicion
array
dedicated
hanging
federation
tweeted
showdown
pocket
pasco
brutal
christ
dignity
emitter
edition
careful
frustrated
celebrity
exposed
sends
fails
vocal
confession
earn
weighing
assist
sc
springfield
unfairly
newark
corbett
beaten
nypd
senseless
infringed
doubled
projection
famous
advocating
gross
prefer
engineering
laboratory
charlie
gallup
polluter
totally
optimistic
sullivan
underscore
disability
organizing
minnesotan
origin
shelter
verify
disturbed
gabrielle
africanamerican
bisexual
antigay
phenomenon
hotter
contributor
strength
educator
turnout
arthur
inadequate
besides
jonathan
hurdle
shoulder
renew
presbyterian
warn
monitoring
documented
update
ward
storage
signaled
attract
twoyear
lowest
laid
conclude
succeed
pension
reluctant
inquiry
supportive
gingrich
exhibit
leg
outlawed
lifted
midterm
guestworker
todd
phil
solid
influx
lane
observed
activism
disagreement
wear
extension
evolution
alexander
antonin
anymore
outspoken
abused
competent
trafficker
gunsafety
nobel
barry
existence
experiment
blog
captured
bitter
museum
apple
russell
carl
switch
tension
bradley
pittsburgh
occasion
doctrine
dismiss
praise
horrible
concert
blasted
convenience
torture
imprisonment
stranger
trayvon
symbol
content
midwest
being
achieved
emit
dependent
nonetheless
brazil
band
recognizes
fish
rage
listening
tip
cabinet
debt
gold
willingness
eighth
ninth
disagreed
cdc
olson
lopez
handled
wore
deadliest
casey
considerable
intensity
stuff
sustainable
reliable
affirmed
medicine
edge
appearing
explaining
collective
irresponsible
expire
hudson
stick
definitely
selected
ethic
employ
justified
irish
clinic
legality
performing
adopting
buried
depends
flaw
discussing
singer
grave
nevertheless
luis
costa
lobbied
dissent
dad
lying
adequate
painful
superintendent
deferred
assigned
bench
embassy
loving
knowingly
drilling
strategist
trading
indicates
dave
mitigating
unrelated
eve
emerging
skeptical
heritage
setback
distinction
paterson
confronted
finger
broward
botched
similarly
function
concrete
intends
confront
struggled
subsequent
wing
traced
stone
realized
shocked
lady
tucker
borough
19yearold
recess
harrisburg
alarm
discourage
lifestyle
wyoming
publication
reveal
intervene
updated
somewhere
regulator
accusation
voiced
staffer
drinking
kicked
loud
ehrlich
charlotte
upholding
outright
prejudice
peterson
classmate
passionate
conventional
useful
reflected
structure
rogers
compare
improved
welcomed
lesser
stable
differently
jimmy
profound
prompting
overcome
refuge
fundraiser
offensive
overturning
ineffective
clayton
gunfree
hadnt
substance
compliance
slowly
reserve
celsius
instrument
respondent
competitive
enjoyed
forever
shock
scare
unlawful
accountable
robbed
electrocution
heinous
gilmore
4th
6yearold
columnist
sky
ratified
melt
occurring
sharing
oh
visible
ignoring
encounter
seize
briefly
approving
agrees
revised
approached
luther
marketing
webb
voterapproved
climatologist
framework
brook
detroit
rail
anticipated
alter
underground
acceptable
globalwarming
venture
implementation
determining
accompanied
onethird
length
transport
invasion
ferguson
jailed
noon
walkout
rallied
affidavit
deterrent
inconvenient
coloradan
cancer
ecosystem
counted
retirement
toy
bloombergs
21st
cheer
discount
ben
turner
covering
dominated
unauthorized
theodore
nuptials
boyfriend
lott
gunmakers
dirty
establishing
participation
approximately
unknown
aggressively
remote
affecting
attached
kim
habitat
injustice
barrel
pelosi
assemblyman
portrayed
quinn
forth
boehner
rid
anne
vendor
glock
interracial
tancredo
harmful
implemented
constant
attacking
flower
coauthor
precisely
metric
competition
objective
sample
1960s
episode
mill
friendly
attributed
reasonably
premise
bold
highlighted
excluded
jesse
knight
ore
sweep
packing
coordinator
football
undergo
medicaid
dire
economics
belt
iran
lottery
stanley
removing
aggravating
absolute
permanently
accidentally
competing
distribution
disappeared
documentation
sexually
nightmare
clarence
staying
touched
morale
barnes
acquitted
detain
backgroundcheck
seemingly
unexpected
dropping
weaken
healthy
rocky
whenever
stanford
wisdom
fortune
unusually
harbor
guidance
pickup
departure
14th
reserved
liable
sean
deporting
buildup
commonly
mere
explicitly
glass
charging
blanket
super
boxer
challenger
concludes
fault
preference
dealt
evolving
pursuing
distance
residential
describes
laura
renewal
emphasized
corruption
missourian
objected
territory
alike
junior
wording
hijacker
proven
ass
safely
likelihood
16yearold
lawn
persuaded
smoke
infrastructure
celebrated
taught
expression
tea
arena
disclose
conducting
tested
horse
ave
pursuit
marion
edgar
ridiculous
accusing
ineligible
grief
carol
negotiate
description
summary
gallon
isolated
titled
interior
voluntarily
agreeing
steadily
confused
perception
comfort
certainty
philip
measured
confidence
paint
lab
prompt
connected
speaks
oak
random
invitation
discriminate
appealing
unfortunate
extends
korean
diocese
charity
checking
interpreted
repealed
15yearold
guantanamo
strange
advisory
layer
keith
bunch
assumption
craft
distributed
devoted
fashion
roger
chart
mounting
mouth
dawn
leak
sole
peak
enterprise
hatch
disclosure
etc
chase
shed
quote
jean
portland
statehouse
gordon
outraged
surrender
constitutionally
archbishop
codefendant
charlton
lambda
mechanism
automaker
jet
chicken
rent
brewer
tale
inspection
representation
perfectly
participated
korea
potent
tremendous
spurred
absurd
void
spike
accomplish
rice
christine
flew
criticizing
insanity
recruit
odonnell
trooper
sgt
honduras
briefing
rolling
fraction
grip
affordable
alert
shortterm
dialogue
alameda
literally
angel
ralph
imminent
raymond
slavery
wanting
pakistan
cable
bedroom
processed
naturalized
circulation
doug
measurement
invoked
needle
lunch
clarify
contender
breakthrough
volume
succeeded
lined
arab
joke
tightening
tracking
hosted
notified
transcript
deliberated
resigned
vigil
televised
temple
mormon
frederick
synagogue
nativeborn
reinstate
franciscos
salt
chile
seventh
bolster
hamilton
operator
frame
counting
operate
invite
integrity
alongside
insane
retain
transferred
notably
hang
ensuring
samuel
grocery
ordering
pathway
aaron
collector
recipient
worship
afterward
consecutive
contain
whitman
output
labeled
excerpt
legacy
triggered
sooner
collapse
skepticism
outlined
negotiated
disclosed
ranked
anonymity
flying
belong
landed
recording
milwaukee
stripped
solicitor
iraqi
separately
lacked
racism
hogan
electionyear
eligibility
lawfully
prop
mercury
alarming
transition
jane
emitted
intervention
reservation
zoo
10year
blind
finished
print
commute
mann
frontpage
hampton
ariz
badly
vincent
bloody
charter
bin
criterion
prevents
style
victor
swiftly
revision
exonerated
cornyn
spur
outline
negotiating
coral
monthly
airplane
misguided
nino
threshold
accounting
mandated
cooperate
wash
lover
kick
exxon
logical
reminded
unwilling
bearing
weighed
slogan
classified
cheered
aisle
campaigned
kaine
workforce
clearwater
dale
arbitrary
exit
priest
usmexico
strangled
hometown
emanuel
alto
iron
karl
wrongly
clothes
revive
antarctica
troubling
leonard
broadly
lone
duck
porter
compassion
wondered
postponed
caribbean
investigated
carnahan
sworn
antiimmigration
eat
allowance
throwing
ideological
establishment
advocated
diplomat
examination
hansen
blair
describing
deficit
glenn
joy
discovery
wolf
treating
gaining
brand
fiveyear
preferred
cigarette
song
sympathy
improperly
businessman
aboard
limitation
rudolph
perez
marilyn
retail
soft
mateo
hernandez
manslaughter
aclu
chester
mario
trenton
applause
ranking
soul
hide
remedy
formerly
modified
pac
conflicting
dependence
humanitarian
traveler
lifelong
leon
biological
specialist
stating
paso
mitch
wounding
marcher
nonpartisan
firmly
operated
shouted
disparity
oversight
outcry
ear
clothing
listened
bos
poster
separated
richardson
marshal
mccollum
innovation
ethanol
transit
gut
manage
underlying
heel
rightwing
billionaire
alex
meat
ritter
sudden
ruth
credible
rushed
healthcare
deeper
riot
deserved
lincoln
empire
authorization
bobby
httpwwwnytimescom
confirm
conceded
congresswoman
arsenal
neck
shaw
mirror
valentine
bennett
pretrial
dominican
silencer
withdraw
freeze
financing
endangered
ideal
observation
segment
chip
waiver
compiled
realistic
volatile
accountability
classic
relied
intact
punished
directive
emotionally
tower
cleveland
creek
rapist
profiling
tight
uncle
stressed
electronic
surprisingly
advised
contention
echoed
nbc
proliferation
lamar
vigorously
picking
steal
demographic
jacob
columbus
banner
oversees
cohen
grim
communist
campaigning
ala
dissenting
strictest
deranged
grower
billboard
palestinian
prosecuting
birthday
brick
commuted
punishable
surveillance
romer
harassment
accommodate
asserted
effectiveness
awarded
educate
aircraft
companion
carrier
disruption
saudi
placing
proportion
lieberman
theyd
sounded
novel
located
italian
replied
morally
youll
rolled
reception
blast
finish
castle
stunned
benjamin
enable
educated
shoe
favoring
filling
plaza
brave
protesting
authorize
exile
strapped
pakistani
tortured
ruger
largecapacity
homeowner
burst
bailey
technique
philippine
japanese
featuring
footprint
regret
regime
resist
instructor
quest
yield
satisfied
insists
everyday
altered
correctly
sandra
hiding
nazi
unsuccessful
robin
misconduct
tossed
specter
perpetrator
republicanled
unlimited
sane
checkpoint
intruder
confiscated
rainfall
clock
accomplished
organize
petroleum
fracking
ball
pawlenty
surrounded
latter
fruit
marathon
shocking
slight
ipcc
twoday
prof
notorious
disorder
curtail
vacation
drama
pause
civilized
morality
echo
steel
investigative
freeman
notable
enthusiasm
resumed
highpowered
administered
wire
subjected
computerized
sleep
graduated
constituency
sanchez
boom
protective
odd
clash
contributes
fueled
implementing
posting
oath
triple
embracing
carolyn
perceived
quit
impression
meantime
dana
remind
sr
lautenberg
neighboring
scared
stuart
albert
lynn
shameful
chavez
11yearold
squad
coach
iq
breyer
shootout
guatemalan
minuteman
invest
lately
shirt
inhofe
