said
gun
state
would
law
year
court
marriage
new
people
one
death
right
bill
immigration
federal
u
immigrant
last
say
two
gay
case
city
tobacco
president
samesex
ban
time
mr
also
could
house
issue
county
american
weapon
group
week
school
national
day
republican
control
many
country
first
public
illegal
judge
make
legal
penalty
attorney
official
united
firearm
senate
smoking
amendment
police
couple
child
percent
government
shooting
vote
support
get
even
month
life
supreme
may
like
million
measure
cigarette
florida
since
decision
want
crime
member
three
legislation
company
take
congress
family
health
york
check
rifle
appeal
way
woman
washington
murder
district
justice
man
whether
california
including
dont
show
violence
made
nation
association
tuesday
criminal
lawyer
today
come
general
second
background
democrat
policy
handgun
number
work
home
department
wednesday
campaign
found
office
execution
without
monday
program
political
go
another
thursday
ruling
union
need
nra
sale
debate
part
student
back
think
service
used
told
high
citizen
gov
worker
use
according
trial
center
among
still
industry
plan
going
friday
leader
assault
yesterday
action
effort
much
passed
act
change
ago
put
next
convicted
know
local
border
sentence
enforcement
proposal
civil
jury
system
former
called
permit
prison
administration
lawmaker
bush
clinton
long
killed
carry
place
advocate
white
four
owner
report
news
committee
benefit
question
officer
well
help
tax
trump
must
voter
call
every
community
business
killing
obama
prosecutor
five
several
already
america
allow
john
defense
governor
virginia
church
legislature
keep
study
sen
problem
san
smoker
recent
smoke
came
license
good
money
university
security
st
asked
others
area
authority
least
charge
see
lawsuit
hearing
georgia
drug
give
capital
men
never
might
become
job
mayor
constitutional
thing
safety
victim
order
shot
record
face
thats
across
march
stop
person
end
executive
took
democratic
set
texas
saying
director
resident
majority
agency
effect
rep
mass
believe
nearly
constitution
council
le
conservative
rule
senator
left
concealed
six
later
side
party
statement
little
point
punishment
away
hour
supporter
far
around
likely
evidence
trying
election
approved
past
guncontrol
force
fact
cost
voted
purchase
organization
stand
hand
filed
argument
im
reason
young
street
allowed
proposed
similar
attack
yet
whose
pas
though
expected
opponent
inmate
partner
black
bar
chief
row
pay
night
sign
enough
world
let
colorado
billion
arm
domestic
increase
employee
board
lesbian
find
care
married
held
candidate
claim
individual
social
restriction
dealer
charged
maryland
however
mother
didnt
period
letter
making
mean
move
step
line
status
got
spokesman
june
missouri
something
store
buy
thousand
parent
circuit
major
rate
reform
agent
began
north
earlier
protect
undocumented
wrote
seek
poll
result
look
meeting
legally
mexico
regulation
process
announced
conference
clear
jersey
ruled
hope
history
anyone
protection
sentenced
doesnt
restaurant
outside
scheduled
matter
cause
brady
early
deal
waiting
louis
cancer
important
guilty
almost
fight
ad
college
within
nothing
product
decade
friend
deportation
visa
view
able
challenge
taking
lot
often
michael
legislative
taken
instead
given
stay
head
position
mexican
seeking
require
cant
released
south
better
prevent
private
provision
society
kill
human
along
big
recently
atlanta
george
power
building
lobby
went
idea
illegally
document
based
opinion
word
sunday
name
robert
fear
age
someone
open
signed
hold
research
known
information
die
lead
activist
beach
presidential
although
live
son
ground
issued
car
using
david
limit
r
done
citizenship
marry
comment
father
free
james
consider
really
provide
executed
current
massachusetts
favor
arrested
include
kind
concern
wife
review
mental
attempt
april
working
ordinance
session
park
term
cannot
alien
failed
war
event
died
risk
list
july
decided
became
medical
getting
wanted
led
fire
different
there
accused
seven
minnesota
response
try
sent
ballot
despite
suit
feel
toward
run
press
interview
request
representative
mark
required
illinois
november
continue
conviction
settlement
ever
proposition
francisco
adult
dozen
west
arizona
bear
terrorist
juror
morning
killer
saturday
special
hundred
agreed
small
allowing
panel
level
brought
full
theyre
sheriff
received
tried
begin
talk
story
defendant
added
top
final
legislator
offer
kid
chance
opposed
post
possible
dead
banning
decide
interest
late
education
half
rather
jr
population
massacre
message
town
access
wrong
spent
best
start
he
naturalization
argued
wont
lethal
committed
congressional
thought
real
near
tell
semiautomatic
old
foreign
reported
card
bring
large
paul
application
turn
sense
international
battle
m
certain
strong
military
refugee
ask
morris
carolina
food
close
body
magazine
injection
philip
rejected
smith
bureau
brown
read
fund
denied
great
coming
sell
armed
jail
gop
disease
lost
opposition
eight
soon
sept
gave
needed
living
religious
latest
always
j
largest
return
address
fall
capitol
in
turned
pennsylvania
hispanic
threat
sure
room
behind
commission
william
ownership
race
nicotine
buyer
witness
common
relationship
grant
freedom
cut
agreement
hard
dc
initiative
expert
carrying
key
future
hear
employer
heart
unconstitutional
violent
politician
lung
belief
politics
richard
market
movement
form
arrest
heard
boy
chairman
third
longer
example
subject
growing
ill
isnt
seen
supported
together
hill
investigation
either
considered
push
fbi
refused
language
front
hospital
manufacturer
assembly
hall
anything
philadelphia
love
secretary
nationwide
potential
showed
maker
apply
answer
teacher
bad
los
daughter
serious
equality
dangerous
editor
husband
calling
jan
nine
leave
chamber
campus
chicago
thomas
simply
rally
budget
safe
sold
ammunition
personal
allows
attention
ordered
especially
involved
commissioner
coalition
suspect
medium
reduce
probably
scott
course
speech
banned
wedding
victory
price
obamas
yes
demand
minute
available
lower
guard
block
speaker
opportunity
denver
worked
floor
role
article
raise
included
survey
share
protest
seems
angeles
parole
standard
professor
meet
palm
joined
sought
recognize
labor
ceremony
granted
air
brother
offered
driver
teenager
mentally
helped
leading
passage
pack
test
martin
approval
pistol
annual
vice
advertising
started
target
bloomberg
estimated
changed
requires
data
following
actually
book
class
island
testimony
charles
difficult
practice
paper
win
focus
possession
requirement
insurance
significant
responsible
antismoking
sponsor
count
door
liberal
newtown
declined
connecticut
elected
higher
spring
central
looking
finding
short
quit
january
everyone
introduced
la
damage
raised
minor
buying
requiring
oppose
cigar
editorial
figure
remain
economic
per
patrol
running
spokeswoman
violation
pm
create
property
agree
light
particularly
moment
relative
innocent
alcohol
struck
shop
bullet
staff
asking
moved
tragedy
chair
lawabiding
single
parkland
quickly
firm
english
site
plea
miami
increased
choice
immediately
giving
dollar
asylum
version
petition
project
airport
bob
illness
tough
pressure
perhaps
designed
feb
oct
latino
w
donald
difference
pending
fee
powerful
assistant
equal
deadly
approach
fla
green
stopped
reporter
mind
true
understand
series
youth
inside
homicide
includes
homeland
danger
dec
voting
fine
judiciary
licensed
catholic
summer
davis
rest
trade
paid
road
receive
reached
voice
created
girl
felon
robbery
met
date
watch
tom
deputy
beyond
discrimination
impact
present
team
gang
forced
saw
convention
defend
critic
usa
value
release
drive
happened
appeared
nov
spending
total
bipartisan
senior
considering
youre
v
controversial
weve
clerk
felony
written
tampa
break
unusual
file
mile
custom
necessary
wait
pleaded
l
responsibility
oklahoma
play
reasonable
compromise
else
easy
operation
condition
type
douglas
slaying
forward
television
intended
jose
joe
training
selling
purpose
reach
southern
veto
teen
heterosexual
speak
send
wasnt
sex
wake
agenda
discussion
prevention
goal
loophole
source
crowd
delay
temporary
gunman
statewide
institute
verdict
ive
solution
concerned
jim
effective
due
noted
guy
stock
doctor
spoke
declared
east
field
machine
economy
avoid
johnson
additional
urged
murderer
december
holding
amount
argue
brooklyn
save
eligible
stricter
columbia
sponsored
aimed
customer
separate
ability
remains
liberty
williams
elementary
partnership
happen
carried
warning
permanent
doubt
dr
wall
firstdegree
homosexual
repeal
farmer
facing
king
e
join
applicant
selfdefense
highest
lack
caused
sexual
conn
upheld
institution
statute
bay
page
associated
resolution
fellow
round
detention
planned
hit
primary
knew
seem
spend
club
investigator
expect
range
incident
secondhand
visit
neighborhood
existing
fired
cuban
popular
prove
prisoner
follow
alone
vermont
weekend
wouldnt
gone
hook
impose
researcher
tougher
aid
followed
sentencing
average
treatment
finally
bank
manager
arent
february
video
wilson
prosecution
factor
minority
talking
situation
ended
sandy
unless
described
movie
mostly
recognition
traditional
experience
comprehensive
package
apparently
continued
financial
enforce
enacted
kennedy
eye
serve
deported
ohio
opened
provided
everything
manhattan
willing
appears
fair
abuse
kept
obtain
cuomo
determine
addition
believed
middle
plaintiff
culture
socalled
add
promise
amnesty
god
lee
previous
easier
behalf
sister
aug
clearly
throughout
vega
largely
limited
reynolds
greater
certainly
proponent
sometimes
afternoon
deny
facility
supporting
dropped
santa
station
newspaper
writer
expand
speaking
moving
august
statistic
inc
condemned
electric
appear
daily
suggested
shotgun
reagan
account
seat
prohibit
shooter
advocacy
legalize
suspected
caught
accept
enter
twice
adopted
october
poor
christian
ryan
fighting
simple
recognized
joseph
felt
september
possibility
passing
served
brief
land
beginning
suicide
returned
rev
column
standing
seemed
leaving
superior
client
wounded
broad
note
terrorism
mom
mike
announcement
pushing
vehicle
previously
regulate
activity
spouse
born
compared
whats
detail
funding
lived
lobbyist
affect
bought
overturned
respect
hunting
b
involving
named
wisconsin
estimate
judicial
currently
brand
cited
expressed
complaint
cover
radio
jurisdiction
foundation
ready
testified
c
neither
online
contract
showing
maybe
native
backed
piece
promised
sued
keeping
conducted
biggest
fewer
published
path
lobbying
leadership
arrived
rape
edward
procedure
holder
prohibited
priority
barack
tv
none
lose
calif
resource
driving
courtroom
haitian
apartment
neighbor
basis
specific
development
antigun
putting
focused
definition
violated
counsel
columbine
ice
applied
adding
orlando
andrew
sound
couldnt
custody
main
section
worth
marketing
defeat
boston
whole
veteran
approve
shoot
otherwise
minister
author
upon
queen
strategy
conduct
starting
bishop
abortion
discus
failure
basic
foot
el
phone
lock
option
ensure
becoming
base
threatened
arguing
habit
huge
game
militia
commitment
stood
increasing
emotional
smokefree
shift
organizer
elsewhere
f
id
hurt
co
stephen
entered
scene
related
endorsed
juvenile
injury
shouldnt
safer
hotel
table
exchange
restrict
increasingly
commit
generally
sport
entire
army
utah
strict
dream
revenue
represent
hire
opposes
housing
water
romney
walker
alleged
racial
colleague
drew
historic
pushed
openly
progun
miller
jones
taxpayer
region
admitted
motion
success
trigger
walk
loss
raising
offering
warrant
division
moral
eventually
except
reality
gain
harris
drop
patient
consequence
recommendation
particular
cop
exactly
ten
track
migrant
chris
ran
truth
wish
low
emergency
baby
defender
meanwhile
retired
survivor
wayne
harm
build
politically
smoked
repeatedly
false
travel
stoneman
device
faced
aide
trend
rick
image
worst
offense
bond
montgomery
referendum
registration
circumstance
regarding
learn
choose
easily
remark
search
hillary
allen
guarantee
farm
critical
gathered
tie
century
learned
opening
email
ahead
determined
represents
chinese
sander
gunrights
straight
welfare
strongly
extend
highly
fox
iowa
adam
claimed
strike
criticism
sort
providing
frank
red
telling
cruz
stage
fully
wed
placed
meant
signature
enact
virtually
picture
census
sweeping
income
plant
task
workplace
analysis
performed
serving
influence
hawaii
original
imposed
barred
rise
marjory
filing
cruel
secure
flight
technology
provides
space
concealedcarry
rose
journal
identified
specifically
blood
feeling
nonsmoker
various
complete
urging
oregon
steve
occurred
truck
wage
criticized
decline
host
worry
coast
prohibits
cuba
vowed
sue
h
behavior
photo
challenged
opposing
evening
rural
cash
automatic
supposed
minimum
grand
shown
amid
prompted
phase
allegedly
helping
visitor
usually
de
consumer
peter
fell
model
injured
presented
northern
closed
warned
richmond
intent
unlikely
conversation
pastor
bus
kelly
ronald
divided
credit
dispute
anthony
affair
acknowledged
stance
duty
murdered
detained
guest
ally
obtained
walked
valley
computer
reaction
publicly
van
indeed
prince
effectively
curb
bombing
proceeding
potentially
cross
network
schumer
correction
method
leaf
bringing
overall
reelection
consideration
aside
attempted
secret
younger
cent
register
directly
mary
landmark
trip
fourth
dna
organized
fraud
immediate
protecting
lake
suggest
progress
va
turning
canada
older
albany
coverage
concluded
draw
percentage
welcome
successful
principle
treated
loaded
supervisor
faith
acting
shall
setting
database
pain
blame
licensing
fda
employment
prohibition
pretty
unit
daniel
shortly
changing
violate
registered
proof
owned
crack
quite
lapierre
overturn
commercial
hasnt
connection
writing
analyst
identification
fort
broken
appropriate
looked
offender
challenging
thinking
maine
pointed
angry
meaning
mandatory
n
issuing
regardless
nominee
downtown
rampage
ultimately
ought
wave
clemency
refuse
protester
michigan
gore
representing
instant
theater
deport
conspiracy
continues
valid
fatal
fundamental
happens
residency
notice
alternative
instance
avenue
spot
contribution
smuggling
seller
prepared
recommended
blocked
blue
litigation
volunteer
attend
protected
murdering
pick
whatever
traffic
handle
christie
science
trouble
remember
internet
honor
folk
identity
box
stronger
unanimously
dismissed
unable
patrick
planning
degree
exception
conclusion
generation
universal
hoping
web
relation
deathpenalty
anywhere
metro
paying
flag
broke
improve
remove
star
al
religion
respond
crisis
produce
theyve
retailer
losing
independent
atf
questioned
cell
prospect
affected
registry
highcapacity
payment
harder
happy
hiring
deadline
misdemeanor
legitimate
character
expanded
thus
camp
surprise
rare
flow
career
gas
owen
suffered
purchased
promote
possibly
advance
heavily
medicaid
bump
firing
violates
relief
creating
responded
defeated
prevented
closing
playing
topic
passenger
indicated
headed
endorsement
growth
filled
seriously
league
larger
professional
explain
urban
foreigner
