tobacco
said
smoking
cigarette
state
year
would
company
health
smoker
smoke
industry
new
ban
one
people
percent
say
tax
city
million
public
cancer
american
law
last
also
billion
could
bill
county
product
time
settlement
court
group
first
study
nicotine
restaurant
morris
two
philip
program
lawsuit
lung
u
federal
money
government
general
make
school
day
attorney
week
child
bar
sale
case
many
get
like
even
business
antismoking
drug
may
official
use
cigar
disease
cost
want
pack
campaign
increase
quit
go
month
way
advertising
area
florida
house
department
report
president
issue
council
lawyer
york
help
death
among
much
take
secondhand
dont
effect
pay
maker
since
ad
woman
right
three
found
place
still
association
national
part
today
risk
including
effort
plan
made
center
administration
university
according
nation
food
next
mr
member
yesterday
cause
judge
reynolds
high
price
work
going
senate
research
st
student
come
control
proposal
market
used
measure
legal
big
good
smokefree
damage
whether
building
show
store
every
think
thursday
know
policy
medical
congress
support
life
care
stop
legislation
young
number
california
habit
rate
executive
farmer
committee
smoked
ordinance
brand
clinton
well
country
five
kid
proposed
le
office
another
already
minnesota
tuesday
suit
ago
teen
adult
decision
long
back
heart
need
nonsmoker
wednesday
thats
put
owner
director
least
district
monday
minor
problem
thing
see
major
regulation
fund
former
never
give
four
researcher
marketing
friday
document
filed
age
deal
jury
share
might
appeal
fda
vote
cut
washington
local
cent
keep
air
nearly
level
told
claim
call
sell
recent
board
trial
without
prevention
co
likely
called
illness
youth
teenager
little
several
action
community
service
society
rule
united
trying
change
budget
family
must
employee
news
passed
around
gov
dr
room
hospital
brown
agreement
others
agency
addictive
warning
light
become
worker
set
park
world
spokesman
virginia
rj
half
similar
north
spent
asked
meeting
far
past
home
per
im
expected
end
result
sold
revenue
louis
approved
danger
start
missouri
republican
away
camel
sign
free
largest
smokingrelated
saying
got
however
firm
lawmaker
question
john
look
early
reduce
dollar
began
mayor
agreed
survey
beach
system
took
restriction
lot
enough
outside
raise
higher
leader
antitobacco
customer
decade
reported
fact
buy
job
manufacturer
almost
using
carolina
maryland
ruling
marlboro
based
lead
legislature
institute
men
banned
six
line
yet
patch
white
move
include
didnt
making
amount
second
though
face
doesnt
inc
came
evidence
allow
justice
announced
advocate
important
annual
allowed
believe
private
find
released
sen
fire
williamson
regulate
workplace
organization
education
addiction
hearing
small
across
parent
chief
authority
future
stock
interest
recently
georgia
consumer
really
amendment
earlier
selling
within
point
caused
fine
medicaid
theyre
san
machine
cant
individual
side
supreme
street
ever
went
police
man
let
whose
later
getting
statement
reason
step
indoor
increased
joe
begin
something
kill
top
try
mean
black
rep
casino
political
continue
current
surgeon
person
started
finding
best
nonsmoking
protect
die
died
journal
better
act
fight
voted
seeking
estimated
message
letter
average
force
limit
able
payment
order
bad
concern
car
march
old
given
liggett
taking
michael
name
chairman
although
clear
lower
alcohol
debate
information
spend
hour
idea
hope
wont
july
benefit
patient
known
there
usa
david
paid
added
anyone
america
banning
spending
governor
especially
kind
received
expert
working
class
great
r
resident
late
leaf
award
commissioner
fee
reached
pas
provide
often
june
tried
commission
lost
aimed
college
run
verdict
democrat
billboard
nothing
growing
manager
rjr
effective
doctor
decline
decided
attempt
litigation
atlanta
jersey
talk
done
trade
isnt
charge
south
attack
statewide
smokeless
feel
total
test
instead
treating
latest
thought
open
plaintiff
night
event
april
choice
head
war
became
hand
left
exposure
brought
plant
probably
despite
seek
comment
retailer
word
soon
tell
project
third
near
hard
large
international
argument
along
toward
friend
led
final
taken
analyst
real
vice
legislator
prevent
gum
profit
treatment
leading
west
enforcement
butt
compared
biggest
human
body
establishment
movie
stand
seen
colorado
town
gave
common
ruled
held
full
robert
wanted
chemical
turn
recover
required
illinois
party
blue
club
showed
introduced
break
tobaccorelated
example
professor
coalition
consider
nationwide
wrote
richard
review
j
hotel
available
approval
protection
require
scientist
paul
special
offer
vending
figure
associated
cdc
insurance
matter
majority
magazine
hall
grower
raised
battle
spokeswoman
initiative
longer
dropped
corp
data
mother
list
illegal
seven
thousand
panel
teenage
field
cessation
punitive
sick
sued
voter
outdoor
liability
rather
considered
cannot
facility
shop
published
crop
classaction
record
chance
ill
session
inside
dangerous
hundred
always
loss
potential
signed
designed
conference
course
campus
target
hold
kessler
source
decide
period
strong
jan
provision
lose
close
save
history
pressure
affect
bob
possible
cover
sure
poor
involved
chewing
safety
impact
fall
younger
sponsor
certain
economic
foot
lorillard
medicine
scheduled
eight
tobaccofree
different
coming
officer
mississippi
seems
opponent
story
goal
label
declined
sent
low
union
legislative
fewer
significant
bond
quitting
helped
tv
ordered
property
violation
term
floor
environmental
mike
form
lobbyist
ive
additional
funding
youre
lighting
dozen
circuit
ecigarettes
power
behavior
key
particularly
considering
staff
drop
team
kick
meet
table
he
environment
deadly
receive
victory
financial
holding
failed
clean
trend
blood
penalty
responsible
thomas
issued
representative
foundation
serious
giant
raising
image
bring
reducing
regular
settle
hurt
behind
farm
estimate
offered
either
included
pound
includes
actually
process
looking
flight
exposed
starting
activist
suing
device
section
reach
hill
everyone
wall
success
someone
sue
william
development
agree
hit
healthcare
palm
pennsylvania
ask
single
press
paper
position
girl
role
income
tough
author
stopped
post
addicted
prison
access
prohibit
knew
front
retail
space
interview
middle
threat
citizen
argued
standard
charles
george
social
live
complaint
read
sport
senator
response
bloomberg
taxpayer
rejected
civil
healthy
substance
minute
airport
weve
user
paying
finance
congressional
view
rose
abuse
package
created
defense
hazard
designated
buying
needed
separate
increasing
nosmoking
worked
brain
sponsored
personal
site
series
grant
daily
montgomery
advertisement
anything
altria
morning
discourage
except
demand
win
practice
worth
mark
giving
answer
license
greater
player
restrict
intended
harmful
character
overall
door
simply
james
favor
massachusetts
forced
add
drive
television
spring
allows
medium
patron
appears
behalf
popular
freedom
weight
lobby
turned
exemption
puff
produce
wrong
return
annually
conducted
subject
aid
truth
wife
game
chile
concerned
editor
rise
gone
heavy
francisco
bush
pipe
wouldnt
charged
cash
commercial
stadium
article
create
guy
summer
democratic
opinion
short
sense
scientific
caught
living
activity
supporter
present
request
attention
alone
check
addition
senior
underage
boy
grow
nine
negotiation
operation
alderman
heard
asking
gain
virtually
los
wisconsin
employer
consumption
opportunity
difficult
previous
percentage
approach
santa
population
exchange
leave
huge
else
emphysema
jim
capitol
baby
block
carcinogen
november
condition
c
together
corporate
quota
develop
critic
avoid
successful
ashtray
statistic
version
strategy
veteran
indian
miami
lounge
seat
challenge
perhaps
january
sunday
due
continued
road
science
play
beginning
joined
expense
showing
victim
cigaret
purchase
difference
speaker
powerful
fraud
pm
belief
model
arent
related
supported
corporation
couldnt
election
criminal
address
twice
curb
winston
push
file
tampa
nc
adopted
factor
unit
speech
experience
durham
production
mile
contract
throughout
whats
type
stay
opened
represents
join
richmond
baseball
rest
requiring
argue
prohibited
east
wasnt
appear
historic
sound
investigation
apparently
aside
peter
changed
fear
mind
clearly
philadelphia
testimony
promotion
angeles
appeared
shown
reduction
assembly
m
expect
prove
moved
settled
seem
suggests
enforce
easy
agent
breathe
growth
warehouse
link
smell
aug
internal
tom
texas
chronic
juror
suggested
true
release
main
safer
collect
fell
opposed
urged
moore
older
running
harm
shield
quarter
enacted
account
teacher
column
grade
reduced
impose
comprehensive
domestic
refused
lobbying
secretary
met
forward
hear
quickly
sought
fighting
proposition
division
safe
dec
landmark
bought
accused
airline
entire
consequence
jr
premium
nov
fair
puffing
mouth
quality
ground
focus
alternative
secret
asthma
newspaper
nabisco
water
southern
becoming
requires
league
carton
investor
counter
helping
red
contribution
developing
dole
inmate
understand
remains
vehicle
yes
offering
abc
follow
opposition
directly
prescription
adolescent
linked
recommended
military
love
mall
september
picture
economy
denied
remain
whole
opening
physician
choose
killed
father
produced
husband
planned
radio
martin
noted
kept
poll
representing
accept
son
jail
direct
developed
station
eye
card
date
highest
bank
kentucky
wigand
excise
eventually
island
tar
page
spot
limited
clinic
specific
hasnt
jurisdiction
editorial
longterm
discussion
politician
youngster
piece
chicago
named
affair
immediately
maybe
existing
dying
necessary
warned
cutting
cross
willing
anywhere
determined
region
quite
putting
dear
various
awarded
felt
internet
beyond
fan
saw
madison
permit
august
box
producer
metro
targeted
doubt
compromise
colleague
brother
prohibits
defendant
approve
boston
following
adding
combined
discus
tavern
followed
dekalb
voice
f
treat
sept
certainly
hooked
cited
ventilation
season
pretty
agriculture
memo
plus
affected
miller
bus
provided
allowing
movement
assistant
everything
scott
pushed
couple
e
send
responsibility
status
calling
remove
apply
eliminate
liquor
telling
funded
nonprofit
walk
currently
theyve
ability
owns
deputy
postal
regulatory
exception
lie
announcement
declared
denver
strike
judgment
foreign
british
discount
hole
sweeping
manhattan
rising
specifically
boost
dispute
childrens
tougher
closed
clerk
pushing
witness
seemed
potentially
testified
racketeering
humphrey
prohibition
b
suffering
roughly
finally
written
facing
gore
writer
downtown
note
track
saving
determine
influence
winstonsalem
sometimes
believed
expensive
turning
visit
epa
detail
yorkers
happen
howard
dining
presented
subcommittee
crime
supposed
surprise
columbia
extra
oct
original
looked
l
easier
broad
portion
minority
lowest
regulating
neither
moving
eclipse
progress
display
central
smaller
joseph
generally
controversial
land
belt
guilty
aggressive
conclusion
placed
carry
cold
shouldnt
pending
generation
councilman
telephone
merchant
basis
passenger
havent
network
learned
1990s
otherwise
concluded
bowling
conduct
happy
smith
associate
breast
worse
promised
cell
w
security
hike
jose
management
harvard
marlboros
enjoy
complete
analysis
candidate
unless
pain
watch
taste
advocacy
worry
build
range
variety
attendant
manufacturing
value
round
saturday
particular
attitude
ballot
setting
recipient
thus
dc
option
id
comply
providing
labor
killing
barn
nbsp
king
highly
ended
healthier
mostly
baltimore
improve
stroke
reform
december
feeling
convenience
blame
factory
cool
dismissed
grand
talking
material
courtroom
petition
davis
solution
infant
promote
star
usually
electronic
video
apartment
unanimously
owned
exempt
trouble
avenue
meant
proof
counsel
rank
claiming
drink
welfare
double
blow
credit
ready
reservation
va
michigan
permitted
beer
diagnosed
none
notice
significantly
window
losing
suffered
preventable
snuff
commerce
relation
partnership
chain
reader
theater
moment
eating
provides
phone
web
bear
urge
calif
ceo
encourage
february
lack
shot
recommendation
century
jack
gas
driver
suggest
burn
premature
book
regional
requirement
constitutional
effectively
count
feature
largely
drinking
smokeout
bid
keeping
enact
unlike
killer
delivery
passage
involving
decrease
ramsey
prohibiting
buyer
signature
buyout
critical
williams
filter
meanwhile
visitor
breathing
cartoon
waiting
regularly
bay
flavor
politics
coffee
alley
purpose
worried
exactly
resolution
investment
instance
educational
strict
slims
neighbor
shift
lawton
daughter
dan
compensatory
predicted
playing
dead
recoup
neighborhood
retired
spends
promoting
sort
myers
johnson
investigator
addict
ohio
nixon
therapy
passive
injury
surveyed
sponsorship
n
candy
violate
dinner
larger
previously
performance
ten
cbs
connection
accepted
positive
lee
weekly
fix
contains
seeing
played
ran
crack
sidewalk
gun
lucky
racing
stick
folk
counseling
partner
overseas
film
unfair
prosecutor
master
promise
welcome
ultimately
frank
accident
slightly
supply
immunity
wish
focused
negotiator
shareholder
ought
trust
deep
surgery
driving
simple
sharply
throat
aware
raleigh
sheriff
completely
art
fellow
serve
global
faced
ann
represented
kool
communication
al
advisory
arrested
obama
medicare
nature
continuing
joint
oral
respiratory
creating
minneapolis
phase
traditional
defeat
described
item
pregnant
closing
veto
recall
fla
mental
wilson
socalled
ingredient
ticket
spread
resource
unlikely
worldwide
smoky
print
cuban
square
tobaccogrowing
graphic
remained
evening
werent
bit
oppose
feb
restricting
peer
handle
protecting
corner
becomes
motion
thinking
encouraging
elsewhere
criticized
content
leadership
compensation
increasingly
stage
fully
delay
reimbursement
regulator
thanks
burden
hired
toxic
export
capital
conspiracy
built
consideration
assault
established
birth
backed
h
nearby
generate
heat
advantage
connecticut
female
headquarters
henry
waxman
tribe
proponent
enclosed
koop
asbestos
pool
cohen
ron
reporter
remember
balance
ahead
expects
dave
preliminary
shes
shopping
urging
launched
massive
pregnancy
eat
exercise
cocaine
sex
compensate
draw
fought
q
reaction
atlantic
anyway
valley
nascar
ford
questioned
kennedy
acre
fluecured
admitted
standing
closely
administrator
lied
kenneth
canada
targeting
indeed
fiscal
negative
theyll
pick
online
happened
design
expressed
fat
leaving
passing
spoke
primary
prepared
grown
principal
skin
violated
unusual
served
fourth
smokingcessation
citing
hunt
train
bronchitis
suffer
initially
aide
gop
prospect
weekend
october
host
afternoon
harder
publicly
earned
dog
maintain
possibly
compound
vendor
method
interested
client
ecigarette
vapor
arguing
auction
professional
independent
mission
handful
pursue
music
unfortunately
infection
volunteer
walking
complained
acknowledged
broke
pollution
happens
bringing
filing
testing
easily
net
chamber
relationship
entirely
hardly
watched
chest
cv
merit
cigarettemakers
mandate
stake
competition
preventing
tie
race
substantial
enforced
