said
gun
would
state
new
states
people
court
law
one
marriage
death
bill
immigration
federal
us
last
years
guns
two
gay
tobacco
samesex
year
also
could
mr
immigrants
president
house
ban
laws
national
many
first
rights
county
control
city
illegal
public
time
legal
case
united
weapons
smoking
police
right
senate
issue
school
percent
penalty
say
even
amendment
country
week
supreme
may
like
make
officials
get
judge
support
since
couples
three
legislation
firearms
american
children
government
health
congress
group
million
attorney
vote
york
florida
washington
day
whether
decision
man
including
dont
republican
violence
says
made
take
way
shooting
district
life
members
murder
second
background
tuesday
association
found
without
want
political
another
general
wednesday
california
today
rifle
monday
thursday
measure
used
told
campaign
high
gov
debate
back
use
work
crime
department
according
justice
among
office
ruling
still
think
home
going
americans
much
passed
part
republicans
nra
ago
month
trial
assault
next
friday
convicted
local
civil
yesterday
enforcement
family
former
policy
called
groups
long
killed
days
checks
number
go
four
appeals
news
workers
industry
must
put
carry
well
act
lawmakers
every
courts
system
democrats
cigarette
need
obama
five
prison
several
come
already
white
cases
allow
companies
citizens
committee
help
execution
defense
san
center
know
cigarettes
program
jury
john
border
recent
students
administration
voters
clinton
came
months
money
st
asked
keep
others
bush
advocates
least
security
sen
sales
benefits
criminal
action
smoke
lawyers
virginia
good
never
might
become
capital
marriages
constitutional
show
men
safety
woman
nations
see
thats
report
across
trump
smokers
legislature
sentence
took
democratic
saying
university
texas
owners
killing
change
march
america
shot
georgia
stop
director
believe
prosecutors
nearly
service
handgun
issues
proposal
mass
majority
left
concealed
immigrant
six
church
later
end
times
less
business
rep
governor
leaders
little
set
study
place
away
plan
council
far
around
likely
weeks
evidence
executive
trying
community
approved
guncontrol
past
unions
hearing
punishment
measures
women
order
voted
give
mayor
company
filed
tax
constitution
im
allowed
proposed
young
similar
yet
person
whose
pass
though
shows
expected
attorneys
nation
enough
appeal
domestic
victims
row
shootings
question
check
supporters
held
married
effect
social
handguns
lives
drug
charged
however
care
face
pay
didnt
bills
authorities
making
night
call
status
got
residents
june
something
charges
families
crimes
union
colorado
major
schools
spokesman
board
restrictions
began
hours
billion
chief
earlier
north
effort
stand
protect
undocumented
wrote
lawsuit
circuit
statement
legally
buy
permit
officers
criminals
lawyer
announced
world
point
efforts
ruled
force
find
anyone
fact
sentenced
doesnt
outside
problem
process
clear
period
thousands
scheduled
move
early
maryland
waiting
louis
black
conference
important
guilty
almost
area
opponents
increase
within
history
nothing
missouri
firearm
brady
able
judges
taking
often
legislative
weapon
mexico
taken
instead
michael
party
conservative
election
given
reform
seeking
cancer
require
cant
released
permits
arms
south
better
prevent
employees
private
parents
jersey
cities
licenses
along
big
recently
went
illegally
based
fight
dealers
deal
meeting
signed
stay
human
known
research
information
die
wants
services
look
presidential
although
live
issued
letter
atlanta
someone
using
david
r
officer
done
marry
citizenship
reason
consider
really
provide
let
executed
james
free
seek
society
arrested
mother
include
makes
mental
massachusetts
current
sunday
beach
cannot
failed
working
april
died
kill
decided
open
became
deportation
medical
getting
july
thing
wanted
plans
different
led
hands
theres
agents
matter
accused
agency
lot
seven
college
comes
sent
despite
toward
george
votes
lesbian
review
required
press
record
continue
illinois
rules
job
lobby
ever
robert
francisco
sign
jobs
inmates
west
leader
proposition
agreed
rifles
allowing
small
age
member
full
brought
theyre
senator
received
tried
license
head
added
organization
november
morning
hold
final
opposed
line
wife
opinion
lead
idea
fire
possible
dead
banning
decide
late
ballot
democrat
settlement
sale
war
power
top
rather
half
deaths
education
calls
records
problems
side
cause
bear
saturday
position
street
things
justices
minnesota
hope
access
try
spent
best
step
means
special
protection
hes
argued
bans
questions
wont
lethal
committed
congressional
naturalization
fear
wrong
documents
near
real
jr
mexican
executions
reported
favor
foreign
list
bring
large
old
response
sense
ms
father
international
programs
strong
certain
kind
son
ask
attack
child
couple
rejected
panel
philip
countries
semiautomatic
purchases
official
paul
session
denied
result
kids
coming
armed
lost
morris
great
opposition
mark
soon
feel
eight
close
gave
sept
living
needed
religious
military
latest
legislators
always
population
jurors
j
largest
arguments
governments
cost
ins
turned
massacre
hundreds
sure
behind
arizona
products
william
ownership
partners
aliens
areas
hard
common
capitol
bureau
nicotine
risk
gop
carrying
citys
brown
start
hear
store
run
changes
challenge
unconstitutional
violent
post
dc
interview
food
friends
rate
future
politics
activists
richard
carolina
smith
heard
longer
key
third
poll
growing
candidates
taxes
seen
injection
isnt
student
proposals
suit
together
supported
bar
chairman
either
considered
costs
refused
ordinance
anything
commission
ground
thought
sides
regulations
senators
potential
pennsylvania
nationwide
showed
millions
numbers
attempt
car
park
battle
apply
message
places
bad
chance
request
tell
jail
push
serious
los
ill
sell
name
dangerous
agreement
equality
secretary
address
front
calling
jan
read
rule
nine
leave
assembly
bars
claim
argument
simply
sold
ammunition
purchase
personal
begin
town
allows
individuals
thomas
attention
ordered
especially
involved
philadelphia
individual
lawsuits
offer
freedom
building
claims
reduce
needs
safe
probably
talk
heart
banned
politicians
love
turn
restaurants
obamas
story
yes
available
movement
example
buyers
worked
return
subject
media
included
lower
partner
decades
seems
policies
angeles
chicago
disease
budget
coalition
joined
fbi
charge
sought
recognize
language
lung
granted
palm
candidate
offered
air
sentences
labor
mentally
helped
leading
race
attacks
annual
body
advertising
started
bloomberg
estimated
vice
changed
gays
requires
data
view
scott
following
actually
course
charles
floor
killer
visas
husband
words
passage
difficult
testimony
provision
adults
insurance
parole
responsible
significant
antismoking
approval
employers
newtown
room
authority
declined
elected
higher
denver
streets
possession
hall
interest
market
role
looking
editor
fall
central
quit
hill
cut
introduced
everyone
level
ads
january
investigation
martin
raised
buying
organizations
oppose
requiring
manufacturers
comment
experts
short
limit
conviction
remain
economic
grant
per
initiative
running
counties
communities
refugees
answer
pm
create
spokeswoman
agree
particularly
goes
island
struck
article
floridas
alcohol
meet
moved
asking
agencies
businesses
hispanic
lawabiding
speech
block
quickly
professor
editorial
event
parkland
english
staff
threat
term
citizen
increased
connecticut
giving
immediately
asylum
actions
ad
designed
sheriffs
perhaps
tough
feb
oct
bob
single
dozen
drugs
donald
w
owner
pending
californias
ones
powerful
concerns
deadly
focus
rally
fla
victory
stopped
survey
true
understand
series
ways
inside
includes
miami
minutes
decisions
voting
dec
innocent
form
green
assistant
win
property
licensed
raise
paid
judiciary
equal
murders
receive
reached
created
met
beyond
magazines
stores
restaurant
defendants
share
discrimination
visa
rates
pressure
inmate
representatives
makers
daughter
opportunity
applications
forced
centers
hand
defend
saw
patrol
trade
views
governors
davis
happened
appeared
nov
spending
bipartisan
considering
tom
youre
controversial
weve
written
speaker
amendments
unusual
terrorist
watch
rest
chair
necessary
pleaded
conservatives
light
takes
reasonable
polls
l
else
easy
impact
summer
intended
selling
forward
jose
joe
southern
homeland
regulation
demand
arrest
hospital
total
training
usa
send
speak
dollars
wasnt
decade
prosecutor
wake
statewide
temporary
release
douglas
ive
television
signs
tampa
effective
concerned
jim
noted
convention
spoke
declared
compromise
customs
east
avoid
approach
urged
additional
argue
provisions
eligible
sex
stricter
prevention
relatives
supports
critics
aimed
sponsored
version
oklahoma
wait
pack
due
fund
remains
elementary
happen
carried
permanent
dr
agenda
firstdegree
facing
present
veto
separate
trumps
reasons
reports
campus
brooklyn
selfdefense
highest
ability
practice
mean
teachers
caused
robbery
sexual
williams
conn
upheld
december
chamber
target
road
repeal
institute
homes
associated
senior
planned
save
steps
economy
e
knew
seem
spend
expect
secondhand
columbia
faces
fellow
bay
teenagers
existing
liberal
price
date
studies
fired
prove
popular
alone
follow
test
guard
wouldnt
relationship
gone
catholic
miles
presidents
impose
tougher
killings
drive
followed
door
word
sentencing
finally
reach
arent
february
concern
commissioner
lesbians
felony
choice
moment
talking
hook
ended
project
crowd
sandy
unless
mostly
traditional
described
comprehensive
detention
card
recognition
americas
apparently
class
continued
protest
team
johnson
tragedy
victim
enforce
financial
districts
enacted
elections
serve
results
deported
everything
witnesses
provided
average
opened
willing
holding
appears
gunman
believes
kept
limits
terms
obtain
cuomo
controls
determine
verdict
believed
airport
mind
vermont
treatment
middle
lines
file
socalled
easier
representative
previous
behalf
aug
brother
fair
clearly
throughout
king
events
limited
largely
primary
heterosexual
greater
certainly
comments
sometimes
site
reynolds
petition
addition
deny
manhattan
dropped
supporting
amnesty
drivers
play
join
expand
speaking
moving
sponsor
condemned
lee
weekend
hit
appear
suggested
terrorists
electric
lack
daily
santa
resolution
august
prohibit
youth
advocacy
legalize
caught
wedding
suspected
accept
enter
ohio
buildings
twice
adopted
afternoon
lets
cards
resident
break
ryan
fighting
felons
simple
recognized
v
passing
served
applicants
inc
october
kennedy
returned
seemed
felt
leaving
friend
vegas
september
standing
investigators
wounded
broad
rev
poor
terrorism
pistol
pushing
beginning
superior
video
previously
boy
plea
regulate
worker
born
lived
whats
compared
funding
gets
doubt
las
bought
minors
overturned
hunting
mike
joseph
named
involving
farmers
reporters
package
voice
judicial
currently
gives
penalties
cited
gang
range
customers
challenges
wilson
expressed
possibility
testified
ceremony
suspect
abuse
neither
maybe
online
ready
responsibility
culture
column
backed
showing
c
promised
sued
goal
biggest
fewer
keeping
conducted
defendant
published
spring
lobbying
visit
hearings
arrived
radio
nras
b
dozens
prohibited
fine
experience
barack
none
calif
product
lose
driving
researchers
papers
amount
leadership
announcement
basis
antigun
focused
putting
offices
violated
statistics
applied
adding
couldnt
custody
works
worth
columbine
counts
delay
manager
land
proponents
approve
whole
points
marketing
otherwise
names
departments
main
tv
upon
starting
discussion
wall
prosecution
difference
latino
finding
deputy
firm
orlando
mayors
ensure
bushs
path
becoming
threatened
arguing
wisconsin
reagan
hopes
minority
loophole
huge
stood
basic
increasing
churches
emotional
borders
smokefree
slaying
boston
legislatures
counsel
elsewhere
sheriff
cigar
bullets
standards
respect
plaintiffs
protections
forces
witness
statements
facts
entered
native
related
shouldnt
situation
safer
endorsed
god
discuss
mothers
restrict
commit
generally
increasingly
purpose
convictions
strict
entire
represent
f
opposes
romney
alleged
racial
housing
page
defeat
illness
brief
historic
rape
openly
drew
pushed
progun
shop
admitted
girl
knows
advocate
conduct
foundation
raising
machine
benefit
parts
except
courtroom
eventually
countrys
definition
funds
institution
exactly
writer
chris
ice
ran
failure
books
retired
meanwhile
todays
politically
smoked
jones
repeatedly
harris
wayne
false
relationships
stoneman
faced
doctors
moral
worst
particular
offering
requirements
choose
easily
regarding
learn
rick
critical
shoot
id
hillary
gathered
learned
specific
trigger
determined
ahead
represents
add
chinese
queens
warning
gunrights
details
montgomery
strongly
welfare
low
extend
stephen
highly
base
club
phone
statute
truth
application
apartment
field
damages
causes
claimed
miller
adult
commitment
providing
houses
clintons
hour
letters
cruz
hurt
telling
build
fully
placed
persons
grounds
abortion
army
opening
virtually
hire
straight
meant
solution
wed
enact
registration
levels
administrations
sweeping
census
christian
emergency
standard
success
cars
el
performed
red
homosexual
exchange
figure
affect
serving
imposed
barred
marjory
smoker
cruel
travel
danger
secure
boys
allen
original
provides
concealedcarry
neighborhood
dealer
resources
operation
suspects
parties
shift
identified
violations
specifically
iowa
movie
complete
various
utah
prisoners
urging
occurred
steve
walk
development
criticized
prohibits
activist
agent
drop
h
vowed
blood
values
analysis
cover
book
challenged
station
orders
newspaper
opposing
rural
cash
arm
campaigns
supposed
countys
co
partnership
killers
referendum
effects
shown
minimum
amid
murderer
magazine
grand
sanders
helping
allegedly
prompted
reality
sister
fox
fees
usually
andrew
requirement
automatic
presented
injured
frank
northern
task
suicide
unlikely
fell
closed
influence
warned
harm
divided
coast
ronald
sue
acknowledged
section
colleagues
journal
murdered
strategy
detained
technology
habit
walked
rulings
obtained
indeed
piece
figures
publicly
criticism
guy
effectively
phase
circumstances
employee
walker
intent
richmond
potentially
oregon
associations
schumer
evening
cuba
damage
bringing
aside
anthony
attempted
consequences
younger
violation
prince
rose
directly
dream
dna
protecting
organized
immediate
clerk
fourth
reelection
overall
fraud
suggest
shooter
remarks
teens
opponent
older
concluded
bank
turning
mexicans
coverage
treated
successful
va
interests
loaded
shall
acting
militia
division
licensing
homicides
cuban
cents
employment
shortly
violate
pretty
registered
changing
valley
search
water
mrs
attempts
conditions
bond
quite
owned
revenue
lapierre
hasnt
source
parks
thinking
looked
rise
appropriate
challenging
landmark
broken
progress
angry
mandatory
pointed
income
register
fort
homicide
regardless
issuing
kelly
ultimately
incident
behavior
ought
albany
aid
proof
organizers
clemency
representing
stage
instant
deport
promise
continues
n
identification
fatal
seat
valid
weddings
downtown
motion
happens
loss
hawaii
residency
lake
smuggling
table
ceremonies
percentage
prepared
scene
welcome
recommended
blacks
meaning
century
litigation
cross
visitors
attend
blocked
protected
stocks
ordinances
murdering
whatever
sort
fundamental
remember
overturn
acts
internet
traffic
type
stronger
dismissed
unable
unanimously
fee
planning
feet
protesters
decline
conspiracy
account
hotel
canada
positions
universal
pain
hoping
web
anywhere
van
mary
deathpenalty
paying
broke
metro
improve
peoples
filing
patients
author
setting
theyve
de
faith
respond
space
sports
michigan
losing
stance
affected
credit
questioned
gain
maine
highcapacity
nonsmokers
harder
count
happy
blame
hiring
blue
note
secret
expanded
legitimate
al
track
host
contract
rampage
computer
region
thus
farm
rare
findings
suffered
promote
purchased
refugee
possibly
consideration
paper
heavily
responded
violates
creating
defeated
cigars
fda
prevented
daniel
relief
playing
crisis
medicaid
indicated
survivors
headed
georgias
writing
trend
filled
seeks
growth
teacher
sound
wish
seriously
eyes
liberties
bump
closing
explain
larger
urban
types
pulled
patrick
stands
arrests
mom
truck
crack
pick
estimates
avenue
played
sending
email
attended
kansas
dangers
surprise
direct
database
rounds
worried
edward
relations
longtime
spouses
shops
brian
appealed
reaction
neighbors
suggests
curb
telephone
gas
removed
vehicle
strike
remained
commissioners
gore
taxpayers
folks
hired
fatally
corrections
firing
trafficking
dan
pistols
rubio
ashcroft
connection
citing
multiple
becomes
priority
backing
locks
represented
factors
yorks
addictive
receiving
g
requests
increases
sensible
worse
entitled
generals
obvious
chambers
limiting
reducing
overwhelmingly
reading
remove
stolen
yorkers
striking
clerks
picked
springs
absolutely
construction
affairs
worry
onto
liberty
pursue
walking
condition
religion
duty
cast
split
warrant
hoped
eric
bullet
barring
broader
tech
stories
hospitals
diego
trip
heres
deep
larry
honor
complex
notice
document
driver
deadline
talks
game
rj
proceedings
identify
threats
peter
thanks
prominent
network
roughly
fate
closely
renewed
arkansas
adopt
denying
stock
devices
atf
peace
baltimore
howard
iraq
established
launched
haitians
sat
dispute
trouble
eliminate
shes
watched
suburban
clients
bombing
fought
havent
closer
dean
heads
value
widely
foreigners
campuses
prohibition
dealing
accepted
protests
grew
nonprofit
legalizing
sources
permitted
advantage
round
gary
unit
murphy
registry
subcommittee
halt
deciding
orientation
jackson
teen
hate
militarystyle
illnesses
claiming
settled
reduced
science
bid
flow
theater
allies
nominee
brands
unmarried
juvenile
offenders
referring
bit
teenage
parking
dennis
aware
enforcing
hispanics
controversy
mccain
holders
sellers
ties
define
cultural
therefore
league
kidnapping
reporting
sitting
overwhelming
unlike
conversation
career
establish
matters
deeply
fears
facebook
giffords
migrants
mention
handful
offers
unfortunately
brothers
procedures
suits
nearby
posted
facilities
lobbyist
guards
tim
nationally
china
jerry
internal
prices
assistance
western
failing
deserve
produced
christie
shotguns
familiar
terry
gonzalez
begins
p
virginias
handle
fix
fill
risks
independent
flight
liability
dole
defending
alien
predicted
firms
season
prohibiting
modern
numerous
write
dallas
presence
draw
endorsement
la
owens
activity
commerce
ar15
uses
baby
qualify
possess
encourage
newly
wave
tens
powers
misdemeanor
mississippi
factor
hampshire
retarded
minor
photo
fairfax
jewish
proper
henry
identity
ending
9th
image
surprised
aides
audience
stated
produce
fiscal
smokingrelated
nature
jay
sick
treat
methodist
joint
innocence
restricting
sons
forms
puts
maintain
regular
feinstein
bus
african
pat
nevada
guys
appointed
alternative
operations
prisons
thompson
extended
outcome
expanding
overhaul
finance
sponsors
commonsense
retailers
granting
houston
clean
aurora
linked
confirmed
timothy
aggressive
option
afraid
lewis
advance
tighter
tuition
leaves
looks
refuse
targeted
attacked
jurisdiction
momentum
juries
dramatic
marked
active
burden
systems
companys
contributions
entry
vast
box
latinos
perry
heavy
wearing
plus
durham
truly
legalized
fast
backers
thinks
forum
commercial
preventing
picture
grown
watching
delegates
rhetoric
testing
cops
facility
relatively
continuing
settle
complaints
williamson
built
quick
differences
headquarters
impossible
twothirds
negotiations
werent
colleges
double
girls
moratorium
kentucky
essentially
bishop
tallahassee
method
awaiting
shotgun
fulton
plant
industrys
cold
alabama
louisiana
nomination
correct
clara
wonder
permission
spread
begun
maker
jack
model
entering
wide
environment
sanctuary
ny
cleared
mission
smugglers
legalization
murderers
veterans
constitutionality
antitobacco
delayed
treating
perform
positive
obviously
marlboro
owning
talked
drawn
susan
nelson
suing
sarah
corporate
loved
worlds
rising
grants
struggle
seeing
falls
birth
barbara
defended
realize
everybody
incidents
crucial
covered
del
injuries
addressed
ideas
foreignborn
originally
repeated
interviews
proud
jeff
instance
executives
twitter
extra
deathrow
missing
completed
bodies
minister
eye
harry
music
classes
baker
universities
runs
complaint
expensive
daughters
temporarily
favored
vetoed
defender
nichols
survived
conclusion
initiatives
typically
aftermath
recognizing
award
unclear
unanimous
beat
hardly
joining
grow
participate
guest
stabbed
film
appellate
execute
supporter
chances
anderson
locked
pledged
reid
gunrelated
partnerships
finds
janet
seized
signatures
opinions
scrutiny
guarantee
workplace
defined
camel
chose
moore
teenager
winning
annually
fail
intense
nc
usual
ken
spanish
solutions
alliance
tests
shared
activities
terror
spot
aids
gayrights
doma
character
reno
mcveigh
1990s
jurisdictions
fairness
delivered
draft
massive
applying
merely
pew
alan
discovered
opposite
star
unfair
parent
handed
lots
martinez
declaring
balance
tuesdays
imagine
cubans
voter
jefferson
graham
ted
sessions
pastor
alive
rooms
moderate
hot
gathering
homosexuality
restrictive
counter
heat
highprofile
please
addiction
fled
violating
hell
comply
cell
childrens
nixon
meetings
expert
recommendations
kevin
fifth
understanding
latin
offense
cuts
regional
threejudge
trials
urge
belief
female
applies
extreme
towns
degree
girlfriend
indictment
taylor
supply
fathers
suffering
demanding
environmental
lobbyists
trust
wages
deportations
client
severe
mall
combat
announce
sharply
passes
camp
divisive
surgeon
purchasers
natural
river
feeling
cobb
override
fields
reject
christopher
breaking
contrast
beating
insisted
consensus
ii
outrage
ministers
resulted
acted
explosives
marylands
omalley
biden
personnel
steven
substantial
interested
giuliani
eastern
amend
anniversary
detainees
shut
exercise
disappointed
sporting
prospective
introduce
banks
develop
demands
possessing
baseball
minneapolis
h1b
rush
bail
properly
ultimate
significantly
muhammad
odds
exposed
passengers
adam
margin
indoor
initially
veteran
boat
constitutions
suspended
fines
equally
homosexuals
chiefs
immunity
madison
hunt
direction
generation
debated
clergy
regulated
defining
nj
deputies
courthouse
bronx
strengthen
purchasing
founded
pleas
brain
judgment
stayed
tennessee
nancy
anger
soldiers
tears
entirely
contentious
preliminary
kinds
targets
collins
revealed
topic
ethnic
enjoy
tonight
earned
weight
turns
signing
allegations
somebody
pull
follows
colo
protects
brand
escape
surrounding
requested
successfully
completely
interstate
widespread
crackdown
flag
lawful
indian
consistent
persuade
sets
complained
referred
appearance
actual
indiana
corp
dekalb
afford
committees
miss
longterm
pride
mitt
error
iii
doctor
associate
sniper
physical
manner
doors
expansion
management
medicine
growers
threw
bishops
unprecedented
indicted
authorized
sharp
reporter
agriculture
knowing
noting
tied
purposes
enforced
link
desk
variety
payments
memo
refusing
transportation
manufacture
divorce
heights
preparing
village
discourage
rarely
highway
ignored
holds
oped
warnings
resolve
owns
wesson
salvador
desire
suggesting
maximum
saved
testify
anybody
ends
recall
unique
train
attempting
conflict
happening
aim
golden
british
directed
reforms
gained
gotten
extremely
learning
sparked
disabled
heller
tradition
combined
suffer
kerry
website
consumer
remaining
procedure
hillsborough
senates
bible
tend
favors
initial
partys
packs
vulnerable
congressman
diseases
perfect
terrible
personally
slayings
leads
contend
speakers
liberals
injury
pledge
vehicles
prisoner
window
gray
apart
recommendation
prior
raped
reversed
professional
qualified
neighborhoods
modest
nobody
replace
promises
readers
everywhere
asian
submit
californians
outlaw
analysts
gaymarriage
shopping
ring
importance
cdc
cheap
machines
surprising
chuck
targeting
bernardino
exposure
holder
moms
developed
deserves
narrow
petersburg
beliefs
guidelines
scalia
ages
dying
dakota
courage
options
mountain
spouse
contact
chapter
smaller
horrific
feared
formal
messages
employer
federally
dramatically
membership
migration
accounts
stopping
tragic
whites
handling
billions
imposing
listen
memorial
hb
sites
stalled
elderly
statutes
stepped
mail
slow
smart
educational
broadcast
lawmaker
slightly
carnage
encouraging
practices
emerged
speed
retail
nonsmoking
missouris
confessed
waited
lt
praised
offenses
garcia
display
prospect
attending
solve
square
constituents
outdoor
regulating
orange
midnight
slain
fence
whos
knowledge
crossing
periods
outofstate
spare
correctional
mondays
municipal
craig
ed
packed
petitions
proved
declare
poverty
core
feels
obtaining
races
hunters
voices
reviewing
convinced
administrative
officially
cook
partisan
blow
collect
defines
driven
sacramento
exception
deter
ongoing
uphold
sit
participants
boost
haiti
17yearold
notes
shield
contrary
eager
surge
thank
adams
formed
ron
disagree
advice
global
debates
loopholes
marrying
pair
announcing
capacity
rob
aggravated
sb
estimate
motivated
principles
players
users
persecution
suddenly
defenders
churchs
selection
pleased
austin
explained
recommend
proceed
sevenday
regularly
flood
fresh
moves
cutting
marshall
haitian
morgan
swing
clubs
demonstrate
tighten
supervisors
giant
liggett
rallies
ignore
promoting
drove
routine
childhood
christmas
narrowly
theyll
embrace
healthcare
punitive
epidemic
healthy
assassination
male
georges
ellis
threatening
branch
reflect
concept
exist
opportunities
frequently
toughest
energy
moussaoui
tucson
councilman
divide
kenneth
bruce
forcing
warren
marijuana
resume
pa
movies
seats
port
recover
shots
quality
womens
formally
civilian
helps
discussed
gwinnett
notion
straw
raids
production
clark
hammer
arnold
mentioned
apparent
marks
pronounced
tomorrow
partly
normal
extending
caucus
blamed
sea
markets
spared
gangs
reinstated
wednesdays
pool
foster
jumped
youths
advanced
surely
deemed
guarantees
lists
pressing
size
weak
celebrate
dianne
q
discussions
illegals
sixth
mistake
struggling
radical
considers
wouldbe
ross
primarily
ann
match
delaware
pregnant
guess
complicated
oral
corner
threeday
committing
mandate
quietly
airports
meaningful
reconsider
negative
europe
muslim
gunned
chiles
submitted
code
1980s
fairly
arizonas
sad
anticrime
attitudes
agencys
exempt
ease
sens
unveiled
alexandria
cocaine
demanded
lawenforcement
priorities
roberts
lastminute
ranks
campbell
quarter
paperwork
investigations
rival
tragedies
residence
tells
cop
scores
kick
tex
listed
franklin
answers
questioning
baptist
supervisor
invited
dick
zimmerman
moments
returning
troubled
edwards
engaged
abandoned
principle
guilt
robinson
phoenix
honest
manufacturer
floridians
consumers
carter
prepare
delays
embraced
convenience
bottom
drawing
volunteer
pataki
convince
argues
posts
restraining
republicancontrolled
express
episcopal
controlled
institutions
screen
platform
assaultstyle
appropriations
mo
investigate
hills
reviewed
contends
plane
focusing
contended
idaho
abroad
founder
estate
silver
restricted
shares
toomey
maintained
graduate
punish
stake
jennifer
lay
asks
jeffrey
returns
lies
desert
transfer
skills
elian
pinellas
sorry
serial
portion
maria
deliver
jesus
chain
gender
injunction
weekly
confident
investigating
sees
insist
russian
alaska
volunteers
fit
classaction
scientists
designated
lax
scheme
stabbing
chest
viewed
tactics
reportedly
contributed
desperate
amended
admit
colorados
processing
contracts
cnn
england
spoken
resistance
nightclub
marco
clips
raleigh
executing
clause
antonio
sam
neighbor
felon
era
trained
responsibilities
brings
longstanding
anyway
silence
knife
camden
barely
sisters
recovered
feelings
encouraged
georgians
cheney
shooters
ray
minute
plenty
confusion
contained
canadian
theft
dinner
responding
seattle
proposing
discretion
commonwealth
castro
fiveday
letting
heston
jurys
thoughts
schwarzenegger
fred
detectives
signature
reverse
contains
reflects
route
donations
gubernatorial
heated
responses
islamic
industries
households
greatest
prosecuted
pete
juveniles
thrown
practical
karen
stem
minds
slaughter
gunfire
hailed
profits
funded
arming
everytown
rjr
pages
reprieve
undercover
spree
crowded
recalled
plead
evil
garden
10th
features
strip
acknowledge
raises
wage
concealedweapons
vietnam
rodriguez
string
inspired
promising
compelling
warner
describe
polling
expects
contest
tired
marched
discriminatory
ten
preserve
guatemala
skilled
workplaces
pope
gregory
understood
intend
hundred
fleeing
games
toll
overseas
acceptance
founding
accepting
choices
involves
addressing
rhode
bridge
horror
adoption
vows
victories
newsom
instate
seconddegree
frustration
jerseys
reputation
procedural
solely
halted
thursdays
upset
backlash
endorse
sentiment
smokeless
exists
roman
southwest
juror
burglary
k
halls
cox
racist
pose
troops
privacy
tool
ship
pressed
mccarthy
forget
ap
airlines
projects
orleans
sounds
aide
screening
jeb
heading
analyst
soviet
unnecessary
lock
goals
ok
stringent
demonstrated
dcalif
inspector
dark
detailed
hed
typical
battles
walls
images
achieve
blunt
roy
publicity
indicate
interviewed
arlington
objections
busy
keeps
hollywood
implications
municipalities
reaching
matthew
blocking
european
abolish
linda
oakland
visited
plastic
causing
windsor
serves
atlantic
removal
crossed
examine
charleston
unlicensed
mixed
rich
parade
jews
metal
democracy
dny
laborers
flawed
journey
pasco
amounts
nice
creates
pounds
necessarily
traditionally
occur
accident
africanamerican
intention
quiet
art
boards
buyer
stations
equivalent
yesterdays
pace
hopeful
totally
harsh
kills
restore
carefully
contribute
matt
mainly
privileges
diverse
shame
newspapers
extraordinary
steady
scientific
malvo
deals
widow
mitchell
israel
denounced
treasury
migrant
antiimmigrant
mount
academy
freed
nebraska
chemicals
interesting
worldwide
attracted
tony
automatically
bias
basically
mcauliffe
quoted
involve
declining
youve
arrive
informed
celebration
tape
denies
routinely
teaching
availability
via
twin
throw
severely
outlawed
logic
lowest
roll
exceptions
rational
experienced
stops
filibuster
privately
postdispatch
mercy
lawrence
escaped
collected
faculty
rock
resolved
mainstream
bright
wound
pentagon
comfortable
vs
chosen
nationals
reduction
interpretation
assaultweapons
11th
principal
cameras
unarmed
consistently
suburbs
hair
items
hidden
pattern
involvement
employed
tiny
surveys
definitely
uncertain
sensitive
somehow
developing
hightech
vending
carries
fingerprints
montana
falling
juan
lengthy
operating
plants
holmes
mans
catch
ford
elizabeth
touch
reads
bigger
accidents
guaranteed
enormous
demonstrators
transgender
abusers
deliberations
memory
pictures
uniform
clayton
newark
writes
silent
patches
assume
justify
bomb
communications
walmart
visiting
lungs
barr
pastors
raping
drafted
fridays
fake
babies
navy
intelligence
performance
greg
accidental
carlos
gap
studying
suicides
presidency
lying
bound
metropolitan
decides
expired
grade
ridge
mouth
civic
germany
combination
wore
ward
sight
evans
missed
kessler
breaks
spitzer
advertisements
category
bloombergs
goods
lgbt
grassroots
tobaccorelated
unfairly
adviser
arriving
stevens
tide
prosecute
handled
russell
strongest
wild
obligation
probation
harvard
signal
ak47
minnesotans
smokes
lie
coleman
springfield
detective
sufficient
demonstrations
pro
traveled
moreover
headline
diaz
relevant
fans
manufacturing
littleton
corporation
crop
daca
misleading
ga
roof
beaten
abujamal
charlotte
mix
german
lift
teach
answered
supportive
examined
extensive
checked
md
essential
gingrich
governing
patrons
certificate
refusal
stark
electronic
motor
abc
gunshow
nypd
warrants
parker
text
gold
library
managed
stewart
humane
jon
attitude
chapel
bernie
technical
blessing
wars
manchin
eighth
awarded
wounds
barry
4th
authors
lifetime
besides
accusing
prayers
hadnt
simon
dignity
drinking
timing
implement
succeed
billboards
household
arrivals
infringed
gum
oppositesex
ranging
prefer
empty
kicked
precedent
explanation
sc
fly
earn
powell
avoided
india
republic
poised
barnes
lott
climate
plain
traveling
prospects
speeches
gerald
abused
adds
fails
engage
expenses
assigned
replaced
zone
nathan
undermine
tie
sun
denial
shifted
disaster
exemption
frustrated
restriction
guests
ceo
gift
enacting
diversity
cessation
featured
rapidly
showdown
senseless
sends
raid
cry
bitter
reasoning
webb
lobbied
title
demonstration
offensive
rating
olson
investors
actor
equipment
identical
antigay
emotion
spotlight
trail
walter
lisa
fallen
jason
editors
admission
capable
lopez
theory
harrisburg
performing
symbolic
verify
stanley
sullivan
lifted
visible
device
posed
renew
holiday
harmful
contractors
awareness
gabrielle
retreat
thousand
agricultural
lighting
enthusiasts
dreamers
noncitizens
recorded
gilmore
reed
crazy
schedule
merits
griffin
competent
convict
weigh
painful
knowingly
destroy
freedoms
tour
regard
ridiculous
taxpayer
tone
studied
color
anymore
tries
feature
sells
location
attract
deadliest
unemployment
minnesotas
establishments
guestworker
realized
accountable
brutal
rely
twoyear
africa
legislator
favorite
dave
junior
dedicated
customer
reference
afghanistan
situations
1960s
ave
byrd
swift
casey
disturbed
tourist
broward
survive
propose
irish
gunsafety
advocating
disturbing
francis
upcoming
wealthy
cooperation
cooper
stuck
gavin
jordan
shocked
participating
jails
permitting
dismiss
substance
hatch
blocks
resulting
jump
perspective
selected
outright
import
gather
cap
quitting
trayvon
carl
phil
anne
hanging
kitchen
models
imprisonment
quinn
arthur
net
accurate
historically
nights
vendors
christians
casino
fundraising
foot
vital
stamps
chewing
plot
northeast
ticket
acceptable
indication
cohen
normally
luther
antonin
weighing
butts
oh
enjoyed
disagreed
bradley
assemblyman
approached
sanctions
threaten
appearing
recipients
influential
funeral
robbed
zones
horrible
upholding
appealing
clinic
conscience
christine
torture
botched
ninth
unrelated
gross
farreaching
merit
loving
intends
christ
headlines
peterson
backs
wright
repeat
instructions
object
duke
bell
outspoken
attached
shifting
classroom
rallied
corporations
turnout
classrooms
wood
charlie
upper
destroyed
concerning
justified
recess
lesser
launch
plays
voiced
ordinary
jesse
costly
inadequate
reluctant
simpson
advisory
dear
doubled
willingness
tested
stuff
context
marion
coffee
pittsburgh
expire
vocal
landscape
distribution
documented
evangelical
overcome
relative
pointing
deferred
famous
southeast
regulatory
bisexual
traced
voterapproved
intervene
woods
flags
ineffective
spirit
careful
tools
deterrent
reserved
lied
french
gunshot
jailed
hunter
19yearold
compliance
voluntary
prime
excuse
extension
legality
design
liable
superintendent
tweeted
influx
newcomers
lorillard
alexander
noon
retirement
heinous
lottery
6yearold
lesson
clothes
winter
random
remarkable
journalists
scholars
boycott
organizing
recognizes
educators
gunfree
tobaccofree
loud
rejecting
laid
bench
youngsters
blasted
affirmed
listening
forever
privilege
array
debt
eve
overturning
pieces
declaration
hole
payment
shortage
content
fierce
commentary
lobbys
generations
ecigarettes
ride
assist
yard
luis
traffickers
todd
patch
somewhere
bucks
dad
excluded
hudson
debating
separately
undergo
washingtons
irresponsible
strength
prompting
nowhere
incumbent
zero
addicted
federation
activism
mexicos
flights
agrees
captured
objected
muslims
pilot
discussing
struggled
nevertheless
ramsey
cbs
starts
unlawful
stadium
doctrine
shape
historical
approximately
panels
somewhat
depend
delta
profit
prescription
stretch
suspicion
clarence
material
reminder
gunmakers
silicon
sexually
determination
briefly
methods
photos
files
implemented
professionals
stress
donors
proven
progressive
faster
minorities
predict
independence
removing
glock
locations
indicates
signaled
depending
discount
addresses
sport
dropping
surveyed
nuptials
succeeded
prosecutions
print
disappeared
staying
adequate
rabbi
1970s
teams
sean
punished
ferguson
corbett
shock
lucky
football
confronted
permanently
unauthorized
comparison
certificates
prop
billboard
subsequent
competition
interracial
tancredo
dissent
differently
familys
16yearold
bed
crash
gordon
foes
northwest
lunch
lane
wind
ralph
universitys
crew
passionate
hearts
absence
backlog
checking
regions
managers
whenever
farmer
wishes
cable
sgt
injections
ordering
aggravating
rogers
suggestion
heritage
acquitted
airline
bag
doubts
exemptions
waste
super
pursuing
covers
affects
portrayed
alike
articles
explaining
disclose
fights
kid
presbyterian
optimistic
celebrated
detain
seize
packing
backgroundcheck
repealed
extent
theodore
accidentally
reveal
determining
notified
approving
festival
coordinator
greatly
agreeing
covering
languages
jimmy
switch
carol
tremendous
educate
gallup
outraged
dominated
honduras
14th
knives
inaction
hotels
deporting
wording
degrees
scope
forth
stripped
wear
15yearold
eat
devastating
kim
wisdom
charging
counted
boyfriend
ineligible
husbands
neighboring
plaza
persuaded
voluntarily
vincent
singer
classified
respondents
breathe
improving
spots
constant
rent
grave
jonathan
bennett
decrease
rage
similarly
weaken
doug
france
controlling
conducting
suburb
nonetheless
substantially
documentation
destruction
ethics
civilians
myers
attacking
praise
catholics
electrocution
rolling
beings
channel
aspects
participated
inevitable
edition
dog
guantanamo
grief
seventh
confrontation
operate
reversal
distinction
rid
missourians
lifelong
interpreted
theyd
elements
chemical
accompanied
phrase
contain
collective
survivor
electionyear
professors
prevents
charlton
heterosexuals
listened
seconds
counting
revised
concert
grove
clearwater
corruption
ore
seemingly
buried
fbis
constitutionally
processed
guidance
japan
considerable
enemy
connected
naturalized
fires
speaks
mere
violators
competing
discriminate
pension
midterm
deliberated
pays
turner
glenn
ocean
absurd
touched
symbol
labeled
fiveyear
trends
neck
sharing
welcomed
disclosed
comfort
taught
saving
investigated
hero
versions
opens
fashion
unfortunate
researcher
prayer
aboard
onethird
surrender
tracks
postal
councils
visits
disclosure
lessons
counterparts
franciscos
profile
uncertainty
perfectly
administrators
roots
passport
marches
gains
lambda
mitigating
throat
bedroom
disability
arrival
storm
surgery
spends
carolinas
frederick
leaf
politician
brooks
topics
pretrial
soft
representation
scenes
evolving
raymond
ignoring
herring
trace
absolute
warn
paterson
commonly
tightening
casinos
investment
boehner
inspectors
insanity
postponed
documentary
carnahan
keith
accomplice
observers
conceded
wins
misconduct
element
attributed
sole
ariz
writers
player
precisely
crist
wanting
invoked
summit
morales
generated
badly
accommodate
worship
theme
tea
nativeborn
fundraiser
labels
delivery
bunch
lady
distributed
landed
lined
resigned
bearing
confused
stick
reminded
shed
mistakes
merchants
nurse
perez
organizer
tackle
odonnell
populations
eligibility
sundays
emails
australia
reasonably
collection
httpwwwnytimescom
transferred
archbishop
hide
explicitly
sandra
patient
soil
strangled
wyoming
raton
grandmother
flew
asia
eliminated
bags
cool
detroit
tickets
consultant
underage
gods
useful
nbc
mounting
auto
negotiators
reflected
fault
subjected
sworn
lawfully
earth
afterward
buck
instances
movements
etc
johns
workforce
massacres
savings
factory
exonerated
smiths
forest
dale
hiding
pursuit
liquor
televised
strange
wrongly
ehrlich
kaine
unexpected
separated
retain
oath
tables
clarify
friendly
grocery
passenger
criticizing
recreation
embassy
insane
extends
hernandez
belong
revolver
finished
backgrounds
dawn
stable
copy
cornyn
guide
museum
consumption
denomination
surveillance
punishable
champion
unknown
generate
alameda
nursing
reinstate
describes
laura
camps
lacked
jacksonville
picking
marilyn
milwaukee
rudolph
vision
salt
belt
oversees
physicians
eating
russia
alongside
plaintiff
nosmoking
hometown
clothing
bloody
conclude
improperly
confession
strikes
freeman
establishment
advised
fisher
difficulty
cells
gaining
manslaughter
arts
mario
ben
unsuccessful
wondered
prejudice
chase
