said
state
gun
would
law
year
new
court
one
people
marriage
death
bill
right
u
say
federal
last
immigration
two
president
could
immigrant
also
time
city
gay
case
mr
house
issue
american
tobacco
change
country
ban
group
national
samesex
week
many
united
county
day
climate
republican
first
weapon
percent
school
public
control
make
official
senate
judge
even
illegal
government
legal
like
may
attorney
penalty
month
firearm
amendment
million
get
police
smoking
support
child
couple
vote
life
since
nation
measure
company
shooting
way
supreme
global
take
three
want
florida
congress
decision
cigarette
legislation
washington
california
member
health
york
warming
crime
including
family
whether
appeal
policy
check
emission
made
show
rifle
dont
woman
today
come
district
murder
work
gas
justice
plan
man
tuesday
administration
need
part
report
much
number
general
department
home
violence
association
bush
program
second
democrat
political
found
campaign
monday
use
industry
debate
without
wednesday
another
action
go
criminal
according
lawyer
office
thursday
effort
study
back
union
think
background
center
world
leader
next
still
high
among
handgun
ruling
used
obama
told
execution
going
service
student
sale
gov
act
nra
system
friday
ago
put
citizen
problem
white
called
long
carbon
question
know
university
proposal
worker
yesterday
well
help
clinton
trial
already
local
former
news
passed
business
must
tax
place
every
effect
committee
assault
four
community
benefit
america
recent
call
permit
lawmaker
civil
agency
several
border
power
convicted
sentence
advocate
john
enforcement
area
carry
jury
energy
greenhouse
prison
five
record
killed
good
officer
owner
see
voter
keep
set
trump
least
governor
defense
might
san
sen
virginia
allow
money
others
killing
church
came
become
thing
legislature
prosecutor
job
security
rule
le
thats
st
asked
cost
end
give
smoker
across
authority
face
georgia
increase
smoke
director
hearing
license
charge
never
level
lawsuit
executive
past
order
around
far
point
scientist
saying
stop
believe
likely
mayor
