immigration
said
immigrant
state
illegal
would
year
u
new
law
united
people
country
federal
one
border
american
official
worker
bill
president
many
say
service
last
legal
two
house
government
million
mr
work
also
group
child
city
could
program
court
republican
time
week
family
undocumented
day
month
policy
job
security
make
deportation
number
case
visa
county
congress
citizen
enforcement
department
issue
right
school
get
first
percent
mexican
mexico
national
trump
york
status
citizenship
alien
senate
administration
like
even
center
home
come
washington
nation
reform
want
police
since
naturalization
may
office
illegally
community
way
three
back
america
agent
public
judge
take
agency
refugee
in
student
bush
plan
political
member
part
authority
help
resident
without
system
according
hispanic
made
attorney
need
including
today
report
legislation
life
local
obama
foreign
dont
california
go
among
came
support
business
criminal
problem
population
woman
crime
become
tuesday
leader
thousand
order
white
told
action
card
debate
effort
florida
district
act
whether
measure
justice
lawyer
thursday
called
arizona
found
asylum
employer
director
monday
ago
san
five
company
area
wednesday
long
change
executive
labor
general
yesterday
charge
recent
still
another
much
going
democrat
vote
several
latino
news
pay
know
next
across
english
arrested
high
already
homeland
friday
must
benefit
officer
decision
money
think
former
document
well
four
patrol
others
call
world
study
place
parent
social
campaign
proposal
georgia
custom
give
living
least
nearly
face
care
application
show
passed
held
men
detention
health
man
license
appeal
trying
deported
end
working
international
question
cuban
university
good
hearing
sen
see
put
party
every
record
college
past
find
advocate
texas
clinton
john
use
committee
set
permanent
left
thing
along
education
released
little
language
fear
terrorist
cost
south
used
organization
driver
haitian
force
jail
allow
civil
rule
young
far
around
amnesty
process
might
rep
increase
six
arrest
legally
attack
economic
stay
never
took
sept
temporary
green
saying
voter
provision
asked
away
point
le
election
live
spokesman
better
st
announced
march
economy
whose
charged
information
provide
often
seeking
employee
prison
later
return
hundred
war
human
ice
migrant
keep
tax
line
move
apply
hope
miami
hour
ruling
decade
lawmaker
food
central
gov
taken
though
senator
known
atlanta
believe
estimated
claim
conservative
coming
mother
name
street
presidential
brought
night
thats
began
let
likely
yet
los
statement
north
large
story
board
side
union
governor
father
making
church
early
control
however
stop
conference
reason
mean
deal
sent
enough
result
island
got
expected
beach
look
person
run
taking
allowed
recently
major
effect
native
el
leave
democratic
investigation
guard
chinese
open
operation
detained
instead
june
meeting
didnt
candidate
fact
angeles
sign
grant
relative
based
deport
small
lot
interview
current
almost
path
mayor
born
cuba
gang
filed
billion
drug
letter
idea
colorado
concern
im
step
majority
toward
clear
enter
different
half
cant
issued
near
death
growing
theyre
seven
supreme
getting
paper
dream
rate
obamas
residency
black
hold
history
opportunity
given
hard
went
free
aid
hire
check
similar
granted
comprehensive
continue
building
include
special
applicant
arrived
town
using
cannot
eligible
remain
medical
gop
wage
approved
bring
wife
congressional
foreigner
jose
within
important
seek
welfare
something
received
proposed
supporter
convicted
secretary
second
virginia
victim
chief
outside
old
friend
offer
condition
census
july
talk
request
military
custody
agreement
industry
son
sunday
although
term
wall
airport
start
individual
big
dozen
permit
amendment
earlier
sheriff
council
worked
future
failed
able
park
anyone
smuggling
accused
form
pas
boy
matter
chance
morning
mile
m
representative
april
became
violation
post
power
nothing
top
lawsuit
head
signed
protection
west
southern
bureau
done
activist
possible
raid
largest
address
really
view
cut
begin
class
great
eight
word
door
boat
saturday
hiring
employment
lead
queen
position
review
wanted
bipartisan
try
lived
turn
release
soon
hand
led
turned
smuggler
he
serious
francisco
reported
coast
send
behind
real
car
project
donald
evidence
rather
denied
threat
fee
suspect
ordered
denver
speak
association
late
wrote
restaurant
meet
there
foreignborn
comment
helped
detainee
interest
access
tuition
certain
level
died
secure
despite
require
doesnt
front
create
palm
crossing
jersey
visit
entry
entered
paid
fall
budget
tried
challenge
demand
risk
forced
ban
protest
asian
key
best
fbi
kind
brother
suspected
trade
sanctuary
fight
fine
travel
spokeswoman
chairman
longer
moved
farm
feel
field
rally
session
gave
figure
added
looking
critic
increased
guilty
east
approach
ever
subject
lost
resource
jan
estimate
h1b
george
list
violence
land
commission
tell
required
message
response
thought
needed
enforce
agreed
commissioner
waiting
road
husband
sure
site
editor
prosecutor
politics
region
hospital
nationwide
arrival
created
fox
speaker
someone
spanish
overhaul
seen
mostly
always
legislative
practice
ground
salvador
wait
society
close
summer
research
difficult
tough
coalition
spent
sought
maryland
period
full
usa
data
latin
example
terrorism
age
either
room
construction
ask
promise
protect
focus
safety
michael
started
bar
pending
facility
private
neighborhood
attempt
migration
liberty
strong
killed
drive
especially
event
opponent
article
brooklyn
requirement
middle
higher
together
false
calling
third
sense
guest
fraud
decided
couple
growth
poll
manhattan
deputy
learn
receive
returned
available
expert
november
judiciary
involved
haiti
fund
situation
wont
read
sponsor
final
stand
romney
dollar
sometimes
scheduled
fence
ruled
minnesota
gonzalez
allows
valley
committed
met
consider
mark
lack
facing
potential
china
race
understand
capitol
press
mass
leaving
argument
allowing
senior
latest
identification
heard
flight
reach
voted
wilson
relief
priority
answer
de
muslim
housing
offered
running
compromise
attention
catholic
role
considered
controversial
course
favor
probably
driving
william
cause
freedom
solution
requires
included
louis
test
la
daughter
illegals
speech
store
camp
caught
deny
kid
significant
giving
limit
january
book
defense
entering
target
poor
emergency
build
particularly
assistance
id
visitor
ad
teacher
lower
push
laborer
passenger
total
nine
avoid
persecution
penalty
experience
cross
bank
serve
series
reached
r
minor
ethnic
promised
bay
immediately
chicago
contract
impact
wave
assistant
elian
financial
finding
common
j
true
staff
isnt
battle
ship
applied
quickly
income
designed
simply
complaint
paul
goal
base
philadelphia
activity
raised
actually
movement
diego
identity
initiative
everyone
panel
truck
moving
politician
spring
provided
includes
pressure
willing
wrong
count
adult
water
conviction
stopped
version
crackdown
play
noncitizen
institute
anything
seems
flow
culture
file
ten
trial
share
due
reporter
bad
block
prove
felony
taxpayer
showed
training
present
oct
standard
trip
david
degree
beyond
technology
firm
hired
tom
passport
inside
plant
w
treatment
legislature
sister
northern
market
investigator
fled
abuse
annual
search
birth
joined
organizer
guatemala
largely
carolina
team
welcome
responsibility
spending
win
station
deadline
changed
forward
refused
finally
source
obtain
desert
background
speaking
ceremony
supported
pleaded
opposition
fill
antiimmigrant
aimed
determine
gain
continued
weve
iraq
air
stamp
apartment
heart
fiscal
passage
providing
average
served
asking
vehicle
elected
barack
instate
army
short
saw
crowd
expect
advocacy
believed
james
owner
leading
hill
dangerous
canada
primary
perhaps
broken
offense
addition
following
skilled
opinion
safe
raise
qualify
professor
client
declined
contractor
editorial
everything
radio
helping
computer
track
alone
rubio
king
proceeding
break
prevent
kept
opposed
robert
salvadoran
alleged
hear
body
detail
daca
lose
additional
account
september
belief
becoming
minority
domestic
introduced
insurance
spoke
development
value
van
concerned
main
join
brown
medium
proposition
argued
delay
identified
cruz
floor
increasingly
bus
voice
planned
neighbor
beginning
dreamer
gone
appear
increasing
manager
inspector
survey
remains
pew
century
pm
rest
dead
phone
fair
rejected
network
decide
approval
baby
procedure
huge
eventually
tie
holding
difference
unless
richard
ended
kennedy
otherwise
dec
shot
section
previous
crisis
crack
easier
hit
guestworker
circuit
accept
seem
restriction
jury
intended
august
happen
receiving
skill
limited
learned
throughout
paying
talking
nov
failure
married
arent
email
girl
date
light
constitutional
reality
petition
agree
traffic
placed
hall
suit
add
constitution
sentence
marriage
basic
farmer
newcomer
highly
applying
minute
discussion
dropped
carry
charles
fellow
critical
funding
ensure
thomas
admitted
soviet
fleeing
described
fire
foot
appeared
indian
choice
santa
followed
ability
attend
flag
yes
credit
daily
graduate
ran
broad
picked
processing
discrimination
low
ordinance
bond
strategy
bringing
knew
shift
october
afternoon
opened
hotel
tourist
basis
compared
volunteer
reagan
greater
violent
sponsored
hightech
whole
eye
price
metro
prince
caused
nonprofit
elli
provides
youre
sea
cultural
considering
religious
relation
india
smith
amount
page
legalization
upon
adopted
sentenced
reduce
racial
illinois
necessary
else
previously
database
newspaper
buy
existing
sending
edward
pick
easy
murder
rise
aug
responsible
generation
temporarily
offering
voting
science
presence
announcement
chamber
aide
jurisdiction
threatened
currently
december
liberal
biggest
poverty
cash
arriving
secret
pennsylvania
love
single
advantage
fix
allegedly
mission
backlog
focused
witness
jr
carrying
starting
personal
improve
incident
fewer
written
deporting
entire
professional
regulation
politically
spend
castro
notice
dc
influx
discus
progress
february
proof
sweeping
appears
shortage
separate
expressed
moment
various
weekend
meanwhile
mccain
janet
subcommittee
leadership
adding
television
task
enforcing
admission
deferred
mind
club
eastern
organized
jewish
residence
affect
noted
urged
represent
phoenix
vice
killing
complex
l
plane
foundation
prospect
determined
per
particular
identify
behalf
amid
happened
fighting
requiring
removal
hurt
watch
acting
protester
feb
ready
nativeborn
note
passing
complete
follow
immediate
elsewhere
grew
garcia
faced
filled
violated
apparently
none
criticism
armed
verify
valid
trouble
analysis
blocked
wasnt
irish
space
honduras
inmate
purpose
keeping
paperwork
success
legislator
doctor
german
abroad
division
supposed
maria
closed
barred
journey
indictment
warrant
youth
drop
detain
reno
specific
agenda
qualified
opening
permission
writer
scheme
unauthorized
grown
naturalized
generally
juan
engineer
bob
arrive
twice
exchange
sound
antiimmigration
larger
grand
unusual
ive
burden
african
declared
unable
package
worried
whats
associated
conspiracy
failing
repeatedly
save
seemed
hoping
felt
wouldnt
piece
neither
simple
affair
shelter
train
overall
involving
couldnt
effective
settled
range
draw
shadow
arm
e
surge
fingerprint
tampa
europe
establish
trend
harsh
launched
worst
clearly
montgomery
employed
port
putting
steve
ahead
canadian
houston
tancredo
worse
certificate
associate
warning
downtown
red
boston
category
principle
granting
continues
regardless
lottery
popular
supervisor
ill
worry
proper
allegation
fake
percentage
picture
educational
worth
relationship
danger
shooting
dominican
trafficking
suggested
supply
property
1990s
resolution
acknowledged
fired
returning
host
victory
agricultural
defendant
remark
dealing
desperate
usmexico
published
avenue
pushing
maybe
career
criticized
creating
carlos
shore
pathway
crossed
bail
meant
unemployment
route
standing
stem
c
headed
assembly
afraid
medicaid
plea
giuliani
usually
argue
regarding
nominee
represents
encourage
disease
column
exactly
massive
rev
sort
theyve
socalled
calif
conducted
handle
reasonable
troop
telling
positive
expand
related
assault
workforce
option
household
grower
alabama
treated
spouse
highest
begun
lake
built
tougher
gathered
guatemalan
roughly
cap
broke
planning
southwest
serving
stood
pushed
gun
showing
obtained
republic
produce
statistic
respect
warned
peace
hijacker
unconstitutional
scott
unaccompanied
documentation
consequence
european
heavily
enacted
game
commerce
supporting
season
golden
ashcroft
except
trust
questioned
setting
flood
joseph
forum
massachusetts
participate
older
art
height
shop
vast
hot
extended
affected
author
easily
telephone
williams
johnson
jim
rhetoric
decline
minuteman
mountain
schumer
teenager
losing
overseas
peter
brief
spot
feeling
strike
mitt
employ
awaiting
ally
younger
targeting
korean
seat
diversity
soldier
reporting
administrative
drew
perry
guantanamo
register
israel
mistake
arab
suspicion
turning
named
consideration
cited
fell
asia
strongly
deep
russian
confirmed
split
luis
loan
certainly
western
profiling
unit
draft
sex
changing
management
cover
agriculture
veto
jew
somali
silicon
immigrated
convention
inc
truth
prompted
broader
reelection
highway
scene
happy
vulnerable
root
type
workplace
contribution
completed
evening
capital
struggle
window
tech
vowed
registration
commit
nicaraguan
afford
nomination
caribbean
ring
escape
marco
negotiation
indeed
knowingly
oppose
germany
doubt
consulate
extreme
commercial
protected
fast
connection
targeted
origin
struck
online
guarantee
childhood
drawn
humane
demonstration
humanitarian
wish
internal
attended
institution
walked
film
powerful
suburb
refuse
missouri
stance
pakistani
cry
double
jeff
remained
onto
weapon
discovered
crew
intent
earned
controversy
typically
regional
ending
sentiment
africa
gwinnett
library
commitment
newly
gathering
extend
urban
martin
representing
miller
loss
carried
nationality
federation
table
dispute
walk
suggest
contribute
authorized
correct
factor
crop
topic
conduct
traveling
village
holder
folk
publicly
customer
looked
longtime
barrier
rose
antonio
corner
die
bombing
iowa
heat
earn
payment
diverse
respond
fully
playing
harder
photo
branch
image
vietnam
web
authorization
filing
recommendation
frank
fort
gingrich
widely
seeker
ballot
blame
gutierrez
rodriguez
lopez
sweep
disaster
minimum
virtually
joe
familiar
assist
crucial
meissner
pulled
prepared
rio
paso
remember
unfair
driven
iraqi
entitled
ii
racist
emotional
sanction
specifically
al
hernandez
bloomberg
occurred
jailed
circumstance
airline
testimony
cheap
gay
model
backed
location
headquarters
angry
sexual
honor
hardworking
league
legalize
relatively
river
closely
counsel
vessel
aboard
pete
investigating
played
havana
nurse
veteran
shes
chavez
established
shouldnt
investigate
deeply
fate
pledge
traditional
ease
boehner
pose
pattern
surprise
pretty
shortly
duty
accident
embassy
corp
learning
damage
aggressive
resulted
quarter
interpreter
original
apart
complained
graham
pilot
breaking
congressman
independent
