death
said
court
penalty
state
case
execution
murder
year
would
judge
attorney
sentence
two
trial
jury
life
mr
one
convicted
prison
prosecutor
appeal
supreme
county
capital
punishment
new
lawyer
killing
federal
row
last
time
inmate
man
justice
could
u
people
law
crime
three
sentenced
also
defense
executed
police
say
day
found
first
decision
week
since
evidence
florida
whether
juror
woman
injection
district
guilty
killed
charge
victim
lethal
may
hearing
without
die
monday
killer
yesterday
tuesday
told
scheduled
month
family
defendant
drug
today
put
right
four
gov
parole
thursday
wednesday
conviction
shot
texas
officer
men
ruling
office
charged
another
legal
circuit
bill
home
former
make
seek
witness
even
asked
face
made
public
hour
shooting
friday
system
governor
official
issue
john
get
child
set
later
chair
city
ago
criminal
united
house
firstdegree
member
stay
general
slaying
st
murderer
way
five
take
virginia
robert
mother
want
including
accused
black
person
georgia
body
like
robbery
electric
many
missouri
sentencing
california
question
testimony
back
department
prisoner
white
argument
used
james
took
never
kill
government
still
ruled
plea
condemned
according
american
authority
use
statement
several
washington
innocent
william
head
center
jr
called
vote
filed
wife
think
son
whose
go
next
second
high
night
mentally
louis
request
know
michael
review
dont
verdict
six
long
part
country
must
process
york
died
pleaded
rejected
might
senate
oklahoma
came
order
unusual
illinois
left
george
davis
tried
father
earlier
reason
rape
smith
brother
friend
school
prosecution
dead
claim
wrote
dna
going
support
san
car
june
nearly
much
clemency
chamber
come
daughter
argued
refused
cruel
bush
deathpenalty
saying
least
march
already
committed
nation
murdering
suspect
count
number
end
attack
mental
given
decide
david
im
assistant
didnt
fact
held
call
group
ordered
decided
early
lee
williams
give
began
others
show
news
north
young
seven
girl
date
change
board
national
record
problem
panel
maryland
richard
minute
seeking
courtroom
arrested
work
university
president
near
wanted
superior
thomas
percent
republican
outside
consider
april
report
final
defender
allowed
believe
phase
help
correction
testified
denied
pm
hear
see
le
johnson
harris
jail
study
money
hill
went
act
retarded
j
trying
among
information
july
recent
agreed
away
find
muhammad
chief
store
stand
term
decade
place
morning
warrant
action
opponent
philadelphia
bar
though
well
kidnapping
sent
innocence
enough
ryan
got
area
expected
rule
thing
little
opinion
charles
plan
bombing
investigator
effort
sept
third
eight
yet
expert
every
possibility
legislature
deathrow
someone
released
letter
comment
nine
challenge
husband
good
carolina
delay
spokesman
world
side
paul
nichols
client
likely
taken
instead
carried
boy
allen
mcveigh
past
however
method
failed
petition
execute
gun
stop
debate
overturned
led
moratorium
received
guard
far
allow
jan
become
almost
showed
point
majority
need
granted
sister
beach
jones
heard
signed
upheld
possible
chance
factor
old
became
gave
announced
standard
student
begin
ill
fire
street
impose
sought
although
mean
mark
read
late
circumstance
spent
million
amendment
procedure
stabbed
wrong
international
ask
motion
hand
human
constitutional
around
imposed
murdered
done
brown
unconstitutional
voted
behind
turned
dec
relative
hope
apartment
result
r
thats
measure
across
he
south
cost
committee
clear
martin
let
involved
test
oct
based
supporter
gas
deputy
story
admitted
doubt
anyone
serving
within
cell
keep
political
making
l
jersey
cause
taking
present
legislation
declined
matter
pennsylvania
hall
rest
passed
recently
ever
name
racial
atlanta
issued
known
leader
girlfriend
arrest
using
carry
role
recommended
try
concern
wilson
moussaoui
society
team
history
church
counsel
cannot
director
look
confessed
fair
medical
move
campaign
word
constitution
along
m
timothy
special
recommendation
january
room
e
rather
eligible
nov
thought
pending
despite
sign
line
investigation
couple
colorado
lot
raped
executing
worked
often
pain
potential
deal
view
twice
doesnt
described
attempt
lead
age
feel
block
bank
convict
full
scott
interview
attempted
feb
joseph
document
something
service
facing
saturday
serious
west
grant
considered
book
spared
brought
effect
guilt
pay
commit
professor
force
administration
race
assault
felony
receive
lawmaker
hold
step
similar
building
mind
beating
detective
conference
democrat
spare
alleged
approved
deliberation
fatal
anthony
weapon
statute
either
reinstated
stabbing
met
correctional
malvo
policy
judicial
key
park
aug
fatally
returned
violent
favor
asking
noted
military
press
saw
stephen
appeared
dozen
juvenile
attention
worker
live
ban
grand
november
tell
parent
ohio
practice
belief
cant
offer
power
nothing
finding
bring
reporter
moved
enforcement
job
different
allegedly
edward
abujamal
october
determine
free
ground
argue
homicide
fbi
sat
sheriff
testing
anything
conspiracy
probably
knew
proceeding
gary
believed
clerk
heart
opposed
gang
commission
violence
offered
separate
longer
scene
lost
changed
there
eye
return
raping
ended
served
inside
accomplice
civil
avoid
prove
tampa
arizona
agreement
sexual
error
road
serve
added
required
palm
teenager
war
king
important
sure
planned
afternoon
raised
station
selection
east
sniper
brooklyn
spend
prince
file
testify
save
provide
congress
w
needed
daniel
pope
fired
soon
provision
reported
local
front
taylor
america
reprieve
bob
better
confession
v
current
security
individual
college
open
awaiting
fate
hospital
release
community
toward
sunday
highest
behalf
simply
armed
wasnt
sen
blood
seen
september
session
kind
detail
series
appropriate
presented
electrocution
wood
executive
continue
wont
cop
suffered
remains
source
turn
moral
catholic
thompson
talk
agency
written
terry
rate
calling
february
clinton
program
applied
always
resident
private
h
mercy
mile
december
half
indictment
great
ultimate
cut
plead
b
option
opposition
urged
appointed
really
unanimous
c
included
getting
competent
jackson
doctor
felt
apparently
brief
walker
occurred
citizen
offense
claimed
happened
indicted
abuse
violated
involving
pursue
fight
arguing
pardon
lawsuit
company
candidate
violation
watch
evening
common
pronounced
declared
f
larry
anderson
delayed
p
helped
appealed
aggravating
stopped
fall
joined
offender
hit
immediately
due
represent
represented
closing
cited
tom
louisiana
run
fourth
wayne
position
botched
understand
subject
agree
association
august
marshall
chicago
medium
god
close
lake
recommend
halt
clark
worst
terrorist
latest
fulton
tape
griffin
business
poor
single
real
burglary
faced
alabama
andrew
illness
strong
assembly
health
courthouse
democratic
neighbor
actually
bomb
fort
forced
repeatedly
fellow
perry
none
opportunity
mary
ive
exonerated
identified
van
mitigating
byrd
start
following
arkansas
party
certain
especially
reached
air
include
gone
meeting
graham
working
custody
green
available
considering
television
best
seconddegree
isnt
small
baby
lived
kept
serial
heinous
deserves
deliberated
care
bad
condition
ray
deciding
newspaper
moment
example
putting
hunt
able
send
henry
knife
agent
lower
meet
truck
cobb
struck
proposal
strangled
army
paper
union
bail
los
threejudge
love
voter
form
lastminute
account
conservative
poll
continued
codefendant
major
retired
answer
wounded
jose
arm
short
widow
finally
interest
sex
ashcroft
prevent
commuted
battle
employee
richmond
connection
kennedy
looking
concluded
spokeswoman
soldier
difficult
exchange
leaving
adam
shortly
moore
eighth
beyond
emotion
slain
franklin
jefferson
campbell
caused
hard
necessary
carrying
control
post
raise
perhaps
gilmore
howard
senator
seems
experience
halted
note
previously
dropped
previous
limit
ross
voice
stood
forward
robinson
intended
suspected
paid
iq
kansa
camden
associated
avenue
martinez
imprisonment
unanimously
duty
door
provided
leading
alone
town
started
spoke
risk
ronald
va
morgan
future
responsible
roof
nationwide
fairfax
page
unless
jim
prepared
frank
top
allowing
teacher
level
dr
require
living
hair
significant
named
houston
couldnt
light
commute
restaurant
beaten
chemical
walked
spring
address
freed
filing
angeles
prosecuted
movie
editor
adult
willing
expressed
setting
quentin
additional
growing
sense
advocate
entered
aside
course
brutal
council
bond
seemed
dismissed
play
brain
suggested
mike
giving
message
sexually
response
win
insurance
alive
organization
aggravated
kaczynski
speak
mcveighs
driver
religious
francisco
project
tonight
indicated
proposed
montgomery
upon
drew
writing
leave
staff
lack
bias
determined
escape
event
else
abolish
personal
g
allows
santa
double
followed
appellate
certainly
courtappointed
resume
hampton
drove
idea
reach
concerned
yes
multiple
brian
threw
reasonable
running
morale
neither
suit
application
accepted
looked
jurisdiction
rep
accept
quickly
executioner
minority
editorial
diaz
oppose
unit
hanging
fund
damage
steven
9th
fear
bullet
legislator
potosi
opening
abortion
walter
alternative
thousand
mexico
gray
choice
beat
secret
terrorism
hundred
threat
total
dennis
central
dean
follow
protect
summer
floor
pulled
deterrent
lewis
list
throughout
broke
deserve
ran
period
rampage
bishop
injury
suffering
fairness
torture
liberal
everything
driving
robbed
questioned
tear
protest
remain
appear
reform
election
difference
theyre
childhood
maintained
protection
fifth
mexican
amount
watched
constitutionality
owner
bruce
physical
southern
search
conduct
article
convenience
visit
island
nixon
peter
dispute
sometimes
waiting
coleman
elderly
disabled
revenge
social
wright
administered
kenneth
ability
cocaine
christopher
mistake
baker
reversed
complex
holding
manager
contended
apply
guy
plot
coming
holmes
emotional
resolution
buck
wish
stevens
large
insanity
legislative
suicide
average
wound
manhattan
miami
breyer
clearly
defend
denver
ensure
jack
unable
walking
nelson
discovered
senior
particularly
sitting
mayor
tucker
broken
drive
notice
film
original
eventually
instruction
caught
youre
peterson
gerald
failure
incident
spree
rodriguez
reconsider
resource
veteran
judgment
fred
deserved
donald
kelly
iii
cash
budget
radio
wouldnt
morrow
amnesty
representing
prompted
access
numerous
consideration
psychiatrist
true
firing
allegation
coalition
severe
sorry
judiciary
effective
bound
joe
injured
loved
largely
supported
rick
questioning
teenage
miller
pataki
strangling
played
premeditated
situation
missing
citing
chairman
rare
cuomo
kidnapped
pressure
figure
presidential
overturn
conducted
politician
raleigh
escaped
protocol
version
window
wait
appears
big
firearm
gurney
teen
reno
misconduct
tokars
ring
persuade
ii
usually
requires
expect
delaware
bus
basis
chest
scalia
taxpayer
mumia
choose
faulkner
younger
17yearold
river
mo
acting
survived
phone
robbing
safety
closed
highprofile
ballot
bid
showing
join
pregnant
nearby
relief
flawed
link
reduced
maximum
remember
acted
pool
powell
bronx
lawrence
writer
imposing
tortured
impact
european
increase
adopted
ready
owen
politics
cry
carnahan
matthew
pretrial
honor
discus
firm
together
seat
arrived
placed
relationship
evans
eric
foot
stayed
ryans
thrown
shown
kevin
boston
chose
entire
career
break
drop
contend
traffic
affect
bundy
warden
behavior
happy
proceed
learned
focus
dollar
mass
facility
critic
removed
video
handle
walton
opposes
sound
addition
abujamals
kentucky
habeas
handed
analysis
picked
sell
faith
requested
durham
veto
nebraska
originally
jay
kid
older
midnight
throat
incompetent
prospective
arbitrary
orange
stanley
per
telephone
wall
douglas
intent
water
chandler
related
lesser
value
carjacking
parking
shotgun
11th
jerry
reaction
8th
wrongful
dealer
rose
porter
attacked
representative
harry
strapped
abducted
boyfriend
clara
corpus
troy
omalley
fee
cold
complaint
deadline
acknowledged
crack
seem
bin
truth
telling
repeal
minister
france
formally
talking
opened
everyone
resumed
false
simple
handling
gwinnett
speed
adding
humane
columbia
alexandria
population
cook
field
simpson
walk
club
secretary
parker
currently
land
fighting
commonwealth
bay
deliberating
generally
beginning
gunman
committing
partner
tennessee
jesse
pointed
representation
manner
century
alfred
challenging
rifle
published
nature
alexander
victory
reading
hillsborough
attended
peace
mandatory
pas
turner
conflict
speaking
moving
penitentiary
table
connecticut
wrongly
foreign
disability
morris
carter
picture
rob
respect
intervene
exactly
angry
sierra
disappeared
flame
psychologist
susan
prostitute
unlikely
convinced
abused
gathered
directly
round
pasco
insisted
garcia
hired
associate
voting
height
linda
dc
indeed
includes
trigger
type
possession
dying
remained
permit
northern
retrial
warner
share
fla
buy
vehicle
cooper
moussaouis
reviewed
stage
youth
trade
ann
base
warren
racist
fell
baltimore
alcohol
prepare
operation
oconnor
contact
elected
medina
burn
properly
needle
publicity
15yearold
queen
spending
maybe
site
otherwise
star
suffer
watching
represents
indian
berry
highway
cleared
fled
bargain
criticism
survivor
entitled
prosecuting
limited
worth
identify
higher
squad
troubled
barred
socalled
postponed
threatened
proof
supposed
author
iraq
shaw
hate
training
reduce
responsibility
illegal
feeling
obviously
keith
purpose
cast
challenged
tax
involvement
class
critical
n
becoming
midazolam
testifying
surprised
highly
speech
possibly
temporary
merit
bridge
rural
division
prior
except
handgun
push
proved
hoped
guideline
abolished
trouble
11yearold
ultimately
mississippi
dangerous
rock
clayton
commutation
pair
lie
pharmacy
ineffective
sgt
mitchell
pace
buried
meal
defended
happen
lengthy
ad
contract
bench
shoot
bureau
alan
easy
wearing
bobby
colleague
ginsburg
prosecute
promised
remorse
outcome
extradition
initially
helping
meaning
dekalb
unrelated
conclusion
aide
boyd
activist
camera
box
lying
sacramento
calif
unfair
angel
journalist
reviewing
fewer
grandmother
ferguson
injustice
whole
criticized
fairly
piece
degree
clair
stolen
seriously
continuing
hasnt
examine
demand
goal
gregory
samuel
pleading
embassy
patrick
billion
introduced
lifted
bomber
simon
promise
albert
brinkema
attend
weekend
consequence
memory
tv
blocked
freedom
la
exhausted
starke
retardation
violates
coldblooded
enter
immigrant
created
autopsy
arnold
treated
tim
dissent
property
deadly
bed
id
red
estranged
saved
sandra
withheld
check
confirmed
rehnquist
quietly
largest
janet
lied
blow
playing
zacarias
barnett
shes
various
prosecutorial
section
native
utah
disparity
neighborhood
affidavit
miss
statewide
tied
research
cousin
meant
specific
statistic
theft
lt
treatment
thinking
ordering
announcement
affirmed
guarantee
interstate
leg
effectively
charlotte
closer
dog
remove
loss
transcript
leonard
buenoano
arthur
wuornos
standing
dumped
manslaughter
terre
apparent
movement
christian
regarding
particular
foster
belleville
bailey
huntsville
improperly
rarely
