said
gun
state
would
law
year
new
marriage
people
one
bill
right
court
u
immigration
say
president
immigrant
federal
last
gay
city
could
tobacco
house
samesex
also
issue
ban
american
change
two
country
national
group
time
climate
many
united
republican
weapon
percent
control
week
school
mr
public
day
make
first
illegal
official
senate
smoking
government
firearm
county
even
amendment
million
like
legal
couple
support
case
get
company
global
measure
may
nation
vote
month
child
cigarette
congress
warming
shooting
health
legislation
way
take
want
police
washington
york
since
california
emission
member
check
policy
rifle
including
show
florida
gas
come
dont
decision
administration
plan
work
program
association
need
family
three
made
report
violence
industry
judge
democrat
part
political
campaign
much
today
number
bush
background
debate
whether
action
attorney
union
handgun
study
second
department
effort
leader
general
go
world
use
obama
supreme
life
according
crime
tuesday
sale
woman
district
nra
think
among
home
service
back
center
carbon
high
student
criminal
next
citizen
another
wednesday
still
act
proposal
clinton
office
going
used
worker
monday
thursday
without
well
local
business
problem
tax
university
help
passed
permit
benefit
long
border
know
america
called
ruling
committee
assault
greenhouse
effect
place
news
already
community
energy
found
lawmaker
agency
white
advocate
every
justice
man
system
civil
power
told
ago
trump
enforcement
must
question
gov
call
recent
owner
voter
friday
carry
area
sen
put
record
appeal
good
keep
several
former
see
allow
smoker
security
smoke
job
yesterday
death
least
church
money
license
san
become
thing
increase
others
legislature
level
might
scientist
cost
thats
five
four
le
lawsuit
rule
john
across
director
came
mayor
executive
research
end
give
safety
virginia
billion
past
council
governor
around
far
democratic
set
point
environmental
likely
stop
major
believe
lawyer
authority
resident
officer
senator
conservative
mass
constitutional
never
little
rep
march
order
saying
proposed
st
nearly
majority
party
force
colorado
election
organization
fact
georgia
human
concealed
protection
killed
yet
asked
away
step
reduce
conference
guncontrol
side
regulation
took
meeting
expected
face
dioxide
constitution
trying
approved
purchase
pas
six
enough
similar
mean
decade
cause
sign
left
move
supporter
period
statement
domestic
though
pay
partner
making
rate
result
chief
plant
candidate
limit
person
voted
hand
care
important
restriction
however
something
cut
social
stand
lesbian
street
im
let
reason
individual
thousand
find
arm
buy
employee
temperature
big
married
men
look
line
dealer
texas
protect
air
hearing
opponent
drug
deal
allowed
attack
status
letter
young
clear
board
later
lead
released
shot
announced
fight
north
argument
claim
whose
poll
mexico
doesnt
bar
product
idea
legally
require
hope
better
undocumented
got
reform
international
taking
charge
car
defense
challenge
held
risk
agreement
position
event
spokesman
history
june
filed
building
maryland
parent
night
view
matter
talk
future
lot
almost
agent
began
along
nothing
didnt
ad
cancer
hour
able
within
current
presidential
brady
earlier
often
science
jersey
recently
waiting
instead
store
cant
deportation
visa
based
south
restaurant
fuel
taken
prevent
legislative
activist
college
early
known
process
wrote
concern
private
anyone
include
fear
using
lobby
working
really
victim
open
society
threat
sunday
document
there
panel
black
real
toward
top
economic
mexican
bear
illegally
ground
outside
address
half
continue
response
live
kind
massachusetts
getting
small
provide
provision
word
economy
data
although
hold
given
done
run
population
evidence
signed
age
park
water
large
different
minnesota
list
representative
information
issued
impact
earth
citizenship
largest
atlanta
head
marry
ordinance
free
name
west
missouri
start
alien
seeking
hundred
war
post
session
led
term
ever
opinion
required
best
favor
cannot
michael
standard
theyre
food
mother
coming
despite
interest
target
ice
interview
francisco
attempt
price
fire
press
george
went
suit
congressional
beach
try
proposition
fund
expert
settlement
comment
turn
dozen
r
market
ballot
rather
foreign
added
great
friend
growing
july
initiative
david
someone
story
disease
louis
strong
reported
consider
begin
message
offer
november
saturday
ruled
source
feel
education
failed
possible
wont
adult
allowing
kid
became
secretary
full
late
brought
example
sense
goal
banning
legislator
arizona
town
mark
hard
needed
medical
certain
april
average
sell
chairman
fall
close
agreed
opposed
terrorist
rise
special
key
bring
latest
gop
naturalization
sent
massacre
higher
chance
obamas
project
meet
soon
tell
battle
access
final
refugee
researcher
card
sea
magazine
seven
politician
together
degree
thought
semiautomatic
charged
wanted
isnt
always
seek
serious
capitol
politics
philip
push
increased
living
review
opposition
commission
per
seen
decided
sheriff
sure
bureau
common
killing
movement
application
wrong
form
longer
dc
leading
received
speech
kill
in
significant
vice
demand
oil
morris
lost
arrested
he
editor
ownership
nicotine
buyer
technology
hispanic
military
natural
institute
morning
relationship
old
amount
behind
potential
freedom
coal
article
answer
brown
circuit
annual
dangerous
spent
james
religious
lung
environment
subject
read
summer
raise
robert
employer
near
century
budget
course
especially
stay
mental
murder
return
finding
lower
manufacturer
language
father
bad
prison
supported
paper
maker
atmosphere
son
anything
m
front
belief
approach
coalition
trial
island
paul
survey
probably
role
either
ask
eight
campus
simply
heart
armed
seems
died
attention
focus
carrying
race
opportunity
convicted
heat
sold
grant
professor
clean
estimated
wife
pennsylvania
equality
safe
share
carolina
calling
los
light
room
create
pollution
denver
assembly
gave
illinois
rally
nationwide
leave
available
request
apply
responsible
medium
rising
vehicle
turned
speaker
agree
requires
weather
yes
decide
love
solution
actually
considered
ammunition
china
violent
commissioner
central
tried
damage
recognize
personal
green
argued
committed
wedding
dead
short
included
teacher
difficult
bloomberg
particularly
victory
spring
third
approval
scientific
allows
investigation
hospital
requirement
floor
sept
requiring
dollar
chicago
started
labor
caused
banned
j
joined
angeles
passage
treaty
advertising
pack
ceremony
everyone
site
gore
figure
activity
helped
buying
editorial
protest
showed
danger
driver
trade
scheduled
resource
liberal
mile
scott
pressure
fbi
denied
release
powerful
heard
quickly
looking
rejected
smith
following
ill
firm
land
remain
hear
antismoking
designed
introduced
insurance
class
hall
jan
true
unconstitutional
newtown
region
block
reduction
elected
involved
sponsor
pistol
connecticut
arrest
perhaps
jail
la
includes
changed
accused
weve
difference
jr
quit
choice
agenda
reducing
created
richard
running
single
win
offered
property
book
cigar
hill
version
tough
aimed
worked
staff
nine
drive
senior
minor
discussion
kyoto
bay
convention
warning
existing
dr
boy
possession
reach
southern
series
door
airport
reached
oppose
equal
ocean
total
beyond
understand
parkland
miami
development
moment
lawabiding
usa
palm
critic
fee
concerned
condition
fine
penalty
asylum
published
philadelphia
road
giving
practice
prosecutor
fossil
w
model
shop
english
produce
sought
range
test
raised
donald
tragedy
patrol
january
latino
responsibility
spokeswoman
field
value
deadly
teenager
due
jury
bipartisan
homeland
spending
biggest
december
play
compromise
alcohol
customer
regulate
commitment
author
farmer
greater
operation
refused
happen
team
struck
forward
william
controversial
immediately
thomas
trend
husband
licensed
youre
type
martin
planet
columbia
increasing
break
tom
bullet
save
easy
fla
mostly
voting
comprehensive
estimate
asking
join
necessary
seem
declined
youth
selling
partnership
rest
affect
reporter
effective
guard
moved
sandy
violation
intended
felon
epa
stock
institution
growth
prevention
wake
purpose
wait
mind
primary
paid
stricter
consequence
expect
additional
granted
add
discrimination
voice
loophole
account
shift
custom
ability
sponsored
body
happened
stopped
heterosexual
forced
else
east
joe
bob
illness
promise
financial
leadership
crowd
watch
arent
judiciary
club
considering
associated
alone
tougher
met
analysis
chamber
machine
defend
written
spoke
lack
present
feb
compared
appears
ordered
journal
minute
permanent
talking
reasonable
noted
middle
training
charles
strategy
catholic
hit
statewide
foot
socalled
largely
holding
ive
wall
urged
page
avoid
resolution
weekend
inside
temporary
elementary
speak
douglas
jose
saw
visit
applicant
previous
aid
veto
vermont
specific
traditional
appeared
round
follow
beginning
remains
barack
send
doubt
declared
daughter
moving
dec
huge
conn
package
jim
unless
changing
curb
popular
guy
main
wasnt
secondhand
coast
homosexual
video
el
continued
announcement
facility
foundation
forest
relative
oct
wouldnt
poor
broad
liberty
television
selfdefense
gunman
teen
argue
writer
whats
hook
suspect
cuban
manager
cover
followed
space
highest
credit
gone
consumer
enforce
everything
v
minister
pending
recognition
build
pushing
tampa
generation
priority
clearly
advocacy
detention
homicide
addition
neighborhood
extreme
adopted
enacted
inc
certainly
email
experience
receive
fighting
separate
repeal
situation
daily
nov
facing
reality
column
funding
treatment
sex
finally
speaking
developing
limited
loss
spend
starting
fellow
deported
deputy
l
provided
reagan
piece
expand
gang
movie
opened
online
drought
plaintiff
willing
simple
file
deny
throughout
note
suggested
focused
lobbyist
easier
path
proponent
accept
culture
wave
sometimes
supporting
low
whole
appear
incident
increasingly
showing
doctor
petition
reynolds
vega
al
passing
clerk
minority
guilty
co
factor
planned
february
obtain
santa
pm
e
progress
sound
driving
legalize
die
recognized
hunting
manhattan
ahead
truck
electricity
apparently
christian
bought
historic
count
prove
standing
ready
european
harm
lobbying
raising
cuomo
felony
adding
capital
brother
wind
enter
related
statistic
shooter
truth
basic
brooklyn
king
promised
currently
brand
burning
revenue
lose
fewer
station
computer
ended
track
worth
northern
dropped
prohibit
keeping
detail
wisconsin
otherwise
kept
spouse
bank
colleague
maybe
backed
mom
critical
overall
sued
calif
canada
believed
native
negotiation
leaving
game
cap
born
respect
seemed
discus
caught
kennedy
rev
seat
delay
august
knew
chinese
conviction
becoming
entire
defeat
conducted
fired
farm
previously
described
valley
hurt
success
determine
nature
meanwhile
produced
elsewhere
eye
section
sexual
basis
particular
sentence
neither
atmospheric
decline
habit
amnesty
travel
endorsed
gain
tv
alternative
ten
god
failure
mike
approve
marketing
serve
shotgun
haitian
hurricane
base
influence
antigun
threatened
columbine
production
assistant
expressed
storm
contract
hillary
task
romney
newspaper
radio
cited
strict
terrorism
felt
restrict
tree
eligible
prohibited
complaint
sport
putting
statute
mandatory
september
worry
lock
drop
organizer
named
politically
season
aug
warned
boston
crisis
suicide
option
arrived
represents
suggest
ohio
offering
october
ensure
generally
date
holder
potentially
definition
suspected
abuse
upon
smokefree
eventually
impose
safer
militia
contribution
none
landmark
conclusion
behalf
brief
learn
housing
delegate
afternoon
exactly
pushed
sort
image
table
twice
dream
shouldnt
emergency
gathered
welfare
worst
utility
supply
device
criticism
jurisdiction
highly
lived
progun
nuclear
renewable
arctic
aide
b
chris
continues
de
various
host
easily
income
fair
openly
orlando
mentally
provides
providing
ally
utah
hotel
migrant
enact
regarding
flood
sweeping
id
immediate
c
andrew
served
concluded
iowa
cruz
trigger
winter
virtually
queen
worse
stage
johnson
phone
fully
opposes
remark
f
couldnt
shoot
wounded
stoneman
smoked
planning
suggests
cold
hawaii
blame
except
involving
walk
strongly
division
indeed
network
pattern
protecting
helping
picture
trip
specifically
veteran
un
japan
commercial
longterm
oregon
drew
fox
rick
flight
registration
pretty
western
signature
wilson
red
wed
gunrights
taxpayer
conduct
carried
hire
extend
false
referendum
patient
straight
abortion
predicted
moral
davis
arguing
returned
meant
rose
tie
quite
guarantee
choose
stronger
neighbor
criticized
unlikely
sander
affair
larger
creating
ton
solar
turning
exchange
advance
upheld
girl
stance
independent
opening
leaf
workplace
census
summit
urging
here
percentage
behavior
consensus
methane
secure
bishop
complete
improve
vowed
draw
ran
represent
stood
determined
telling
marjory
strike
learned
opposing
joseph
entered
promote
wage
concealedcarry
amid
flow
bringing
nonprofit
nonsmoker
aim
limiting
conversation
emotional
miller
india
instance
testimony
applied
combat
guest
welcome
search
web
retired
rural
cent
maine
setting
urban
injury
survivor
original
respond
steve
lake
organized
photo
thinking
linked
spot
supposed
link
coverage
wish
cutting
reaction
acknowledged
directly
environmentalist
divided
roughly
minimum
analyst
visitor
reelection
performed
hot
topic
effectively
prospect
dispute
affected
defendant
cuba
draft
shown
occurred
commit
happens
fraud
cross
violated
ultimately
challenged
feeling
deep
investigator
custody
vast
publicly
fell
army
sue
prohibits
michigan
witness
placed
repeatedly
europe
developed
bond
seriously
bus
employment
schumer
mountain
faced
edward
complex
hasnt
registered
detained
pastor
whatever
losing
successful
happening
protocol
mention
database
judicial
christie
industrial
register
regardless
direct
obtained
worried
transportation
alaska
household
relation
licensing
heavily
owned
fda
fundamental
reading
unit
stephen
adopt
rubio
nominee
regional
baby
reduced
montgomery
folk
loaded
encourage
usually
slow
unusual
issuing
automatic
lapierre
commerce
faith
paying
construction
refuse
acting
principle
prominent
killer
pledge
passenger
forum
widely
bit
barred
peter
supervisor
possibility
surprise
harder
instant
thus
intent
internet
agriculture
frank
deport
meaning
challenging
corporation
identification
residency
paris
worldwide
gathering
sister
downtown
universal
walker
claimed
specie
protected
albany
expanded
blue
pointed
severe
williams
aggressive
theyve
league
protester
valid
dramatic
significantly
explain
older
consideration
mccain
looked
dealing
closed
launched
prepared
prompted
seller
smuggling
massive
ought
anywhere
proof
scene
presented
aside
mandate
investment
efficiency
crop
retailer
broader
attend
relatively
treated
shall
headed
pick
volunteer
causing
contribute
spread
quality
hoping
representing
attitude
thanks
innocent
adviser
fix
obvious
exception
adam
cash
wayne
filing
prohibition
develop
pledged
endorsement
blocked
atf
possibly
writing
becomes
metro
profit
remove
established
