climate
change
global
warming
said
emission
gas
state
year
carbon
would
greenhouse
new
energy
scientist
world
u
united
environmental
dioxide
percent
president
could
one
say
nation
country
temperature
power
plant
report
last
level
administration
also
study
fuel
time
national
bush
issue
earth
plan
science
reduce
many
much
even
group
effect
like
research
american
people
two
week
may
california
first
make
air
policy
coal
way
agency
water
government
obama
action
oil
house
cut
company
sea
atmosphere
public
university
human
pollution
industry
problem
bill
natural
effort
take
weather
part
increase
million
since
degree
ice
next
washington
treaty
city
day
kyoto
need
rise
cost
according
use
including
international
official
federal
scientific
economy
come
mr
environment
record
fossil
leader
agreement
today
major
heat
impact
decade
clean
month
republican
rising
set
planet
future
ocean
economic
technology
source
work
limit
already
le
century
car
well
reduction
standard
china
congress
average
made
rule
billion
get
program
area
epa
center
cause
conference
protection
data
system
past
help
recent
still
white
senate
goal
drought
business
question
researcher
whether
panel
among
debate
show
talk
around
electricity
far
political
gore
act
meeting
long
reducing
three
forest
likely
lead
atmospheric
want
think
step
might
support
released
america
clinton
colorado
called
target
threat
back
expert
point
see
result
must
health
project
high
amount
important
vehicle
dont
burning
news
going
go
address
another
arctic
measure
regulation
every
mean
monday
york
renewable
produce
end
thing
without
put
developing
ago
risk
found
evidence
right
proposal
home
yet
big
call
least
court
real
resource
price
utility
thats
good
director
tuesday
methane
solar
department
know
event
number
fact
hurricane
several
believe
legislation
region
tax
institute
european
little
become
summer
ton
wind
place
model
life
move
expected
community
environmentalist
activity
increased
higher
enough
campaign
challenge
decision
committee
storm
case
deal
law
half
nuclear
per
current
extreme
used
job
meet
tree
nearly
john
protocol
concern
growth
across
un
thursday
making
proposed
former
told
finding
land
cap
general
control
caused
wednesday
rate
specie
growing
warmer
face
largest
building
top
winter
north
taking
look
japan
significant
large
however
member
trend
something
clear
along
idea
development
others
better
serious
industrial
summit
four
using
production
heattrapping
published
efficiency
analysis
leading
executive
council
toward
based
announced
there
known
chief
continue
recently
author
office
sen
approach
electric
statement
democrat
small
force
example
money
solution
friday
union
though
changing
local
nature
coming
paris
consequence
five
start
mile
yesterday
secretary
population
gov
commitment
away
role
require
journal
green
great
fight
almost
process
instead
pollutant
greenhousegas
florida
key
increasing
release
india
paper
period
market
include
saying
sign
head
earlier
light
generation
west
melting
warm
negotiation
six
glacier
best
al
presidential
lot
agree
doesnt
hope
term
ever
governor
view
find
done
flood
early
produced
fund
turn
working
service
taken
biggest
shift
benefit
san
curb
position
obamas
south
give
pattern
professor
june
potential
really
worldwide
organization
keep
school
led
credit
second
polar
rather
surface
reason
vice
vote
europe
truck
coast
rain
bear
trying
within
initiative
came
raise
nasa
cold
run
county
food
possible
chairman
affect
manmade
consensus
coalfired
began
information
coastal
dr
wave
space
foot
accord
seen
although
begin
fahrenheit
article
longterm
matter
account
reported
isnt
annual
island
post
flooding
response
longer
alternative
needed
never
causing
hard
story
bay
different
claim
getting
final
cutting
consumer
strong
lower
letter
security
speech
often
industrialized
probably
demand
later
texas
stop
climatechange
snow
took
late
given
park
greater
march
kind
pay
create
line
responsible
especially
capandtrade
history
agreed
focus
co2
estimate
strategy
senator
fall
interest
similar
thousand
slow
supply
together
alaska
wrote
nothing
team
regulate
build
im
july
cant
course
satellite
progress
developed
oceanic
investment
signed
editor
argument
fire
intergovernmental
attention
contribute
despite
december
conservative
ground
party
northern
david
negotiator
candidate
protect
behind
damage
george
dollar
provide
defense
conservation
soon
severe
actually
transportation
particularly
leadership
existing
short
trade
ozone
specific
combat
season
due
doubt
interview
consumption
reach
near
aimed
save
pacific
board
concerned
seems
document
warmest
virginia
central
left
latest
condition
opportunity
live
western
academy
loss
michael
huge
happening
computer
main
required
factor
southern
politician
hundred
issued
got
side
wont
minister
form
ambitious
email
answer
disease
animal
society
commission
poor
mandatory
disaster
child
order
activist
range
allow
delegate
canada
linked
open
lawmaker
hot
conclusion
let
road
binding
asked
push
foreign
warning
consider
senior
gasoline
whose
skeptic
reality
regional
bring
predicted
concluded
james
discussion
pipeline
spring
majority
rest
added
low
compared
try
cooling
drive
sun
producer
able
series
review
simply
authority
weve
site
pressure
buy
agenda
difficult
offer
cleaner
worse
wildlife
mountain
perhaps
reached
chance
quality
press
democratic
cannot
pact
hour
el
dozen
sector
prediction
passed
representative
waste
budget
close
previous
add
ahead
family
thought
product
anything
theyre
tropical
supreme
suggests
draft
true
boulder
link
permit
read
sure
total
always
politics
overall
noaa
sunday
beyond
congressional
promise
theory
third
quickly
crisis
certain
danger
voter
brown
requires
comment
eight
administrator
subject
largely
common
beginning
tell
bad
word
election
valley
economist
copenhagen
assessment
either
east
available
saturday
truth
globe
fear
hearing
wildfire
care
significantly
single
powerful
offset
cloud
sense
coalition
appears
understand
difference
increasingly
present
robert
incentive
mostly
critical
noted
hold
st
efficient
front
message
climatic
attack
trap
alone
association
individual
attorney
field
predict
normal
reduced
figure
emitter
district
includes
pope
created
prevent
private
hottest
seven
death
advocate
atlantic
polluter
forecast
british
dangerous
agriculture
estimated
sell
pledge
seem
survey
hit
poll
warned
adviser
mexico
editorial
war
barack
wrong
pas
spokesman
student
medium
age
resident
forward
cover
river
night
free
w
auto
cycle
emit
decline
list
starting
continues
full
faster
firm
vast
suggest
old
jersey
massive
announcement
play
socalled
influence
hotter
stand
happen
calling
note
related
georgia
opposition
potentially
catastrophic
expect
complex
seek
whats
moving
lake
crop
planning
opinion
associated
vulnerable
legal
whole
choice
included
worst
domestic
russia
join
drilling
comprehensive
dramatic
denver
blamed
held
driving
addressing
heating
contribution
april
man
here
voluntary
belief
foundation
movement
soil
celsius
develop
climatologist
seeking
achieve
ruling
didnt
continued
projected
ban
uncertainty
started
share
critic
middle
francisco
globalwarming
maryland
detail
chemical
automobile
ecosystem
brought
prime
sound
harm
contributing
focused
writer
attempt
sheet
kerry
piece
mayor
sierra
book
avoid
unless
sustainable
rapidly
facility
broad
minnesota
rapid
scenario
rejected
approved
requiring
independent
financial
citizen
outside
advance
colleague
columbia
designed
everyone
scale
option
mark
looking
favor
larger
raising
melt
track
failed
landmark
session
sent
mass
showing
worry
talking
entire
hand
certainly
inch
habitat
joined
adopted
setting
management
task
facing
social
deep
january
generate
responsibility
he
additional
roughly
lost
battle
helped
schwarzenegger
remain
argued
rich
living
metric
aggressive
farm
concentration
opponent
expensive
scheduled
jan
creating
relatively
indeed
showed
version
trump
factory
necessary
projection
lack
intense
changed
rep
emitted
yes
massachusetts
priority
november
went
bird
station
blame
arent
page
fighting
limiting
adding
clearly
substantial
reading
gallon
measurement
seriously
involved
pledged
antarctica
inconvenient
encourage
special
primary
remains
urged
laboratory
scott
funding
automaker
club
feel
buildup
ability
nino
richard
suggested
particular
capture
cool
mandate
street
liberal
urgent
historic
saving
occurred
institution
pushing
de
co
germany
output
trip
tom
wanted
dec
effective
staff
eastern
represents
aim
intended
sandy
considered
mind
convention
reporter
running
argue
meanwhile
paul
discus
gulf
mine
farmer
chinese
immediate
name
smaller
accept
nonprofit
everything
town
los
committed
africa
heavy
operation
built
follow
justice
met
regulator
leak
gone
intensity
sand
nine
burn
commerce
otherwise
various
smith
ipcc
exxon
rainfall
moral
became
pretty
following
drop
spent
value
restriction
ad
brazil
requirement
test
recorded
college
corporation
investor
hansen
body
nobel
allowed
phenomenon
opposed
worth
spend
widely
greatest
acre
quite
grow
capital
francis
gop
visit
delay
improve
ethanol
signal
britain
william
helping
bit
rio
l
implication
respond
highest
missouri
path
layer
youre
seeing
widespread
petroleum
experience
pose
corporate
block
eventually
e
dependence
affected
sought
direct
spread
happened
fracking
r
putting
occur
criticism
fast
gathering
fossilfuel
ready
understanding
heart
type
hill
construction
customer
dramatically
moment
prospect
online
adopt
prominent
fish
resolution
becoming
dc
allowance
spoke
carolina
instance
australia
decided
generated
believed
beach
provided
contributor
unlikely
flow
gave
provides
unprecedented
spending
map
basic
failure
speaking
commit
greenland
bulb
anyone
modest
coral
tough
simple
f
footprint
harmful
lawsuit
written
addition
bank
leave
costly
appear
occurring
extent
curbing
size
motor
compromise
appeal
bigger
ive
legislature
return
mention
giant
commercial
mainly
refused
reef
marine
agricultural
urban
promote
devastating
usa
tornado
forum
dry
framework
young
travel
inhofe
described
store
throughout
capacity
insurance
host
meteorologist
ally
sealevel
prepared
equivalent
received
mann
twice
hear
turning
cited
approval
core
pennsylvania
sort
web
sharp
person
military
prize
morning
unit
highly
pace
topic
followed
angeles
j
appeared
producing
stage
double
gathered
trading
hurt
oxide
presented
ten
refinery
stay
adapt
miami
deforestation
declared
established
extinction
network
infrastructure
capitol
crucial
energyefficient
separate
break
environmentally
sometimes
ratified
saw
regulatory
willing
threatens
sharply
judge
solve
grant
fee
frequent
risen
hybrid
giving
supporter
impose
us
manager
weekend
dispute
request
behavior
ask
ultimately
sky
midwest
revenue
rose
leaving
burned
stronger
providing
thinking
supported
else
combined
tide
success
picture
determine
canadian
arnold
davis
offered
santa
video
1990s
humanity
household
column
gain
woman
leaf
basis
promised
worried
finally
forced
base
tougher
delegation
enormous
fewer
assistant
denier
turned
limited
asking
begun
easy
assembly
raised
protecting
suit
investigation
mccarthy
thomas
announce
material
previously
possibility
voted
race
northeast
denial
continuing
sunlight
police
xcel
amendment
