said
gun
state
would
law
year
new
marriage
people
one
bill
right
court
u
immigration
say
president
immigrant
federal
last
gay
city
could
tobacco
house
samesex
also
issue
ban
american
change
two
country
national
group
time
climate
many
united
republican
weapon
percent
control
week
school
mr
public
day
make
first
illegal
official
senate
smoking
government
firearm
county
even
amendment
million
like
legal
couple
support
case
get
company
global
measure
may
nation
vote
month
child
cigarette
congress
warming
shooting
health
legislation
way
take
want
police
washington
york
since
california
emission
member
check
policy
rifle
including
show
florida
gas
come
dont
decision
administration
plan
work
program
association
need
family
three
made
report
violence
industry
judge
democrat
part
political
campaign
much
today
number
bush
background
debate
whether
action
attorney
union
handgun
study
second
department
effort
leader
general
go
world
use
obama
supreme
life
according
crime
tuesday
sale
woman
district
nra
think
among
home
service
back
center
carbon
high
student
criminal
next
citizen
another
wednesday
still
act
proposal
clinton
office
going
used
worker
monday
thursday
without
well
local
business
problem
tax
university
help
passed
permit
benefit
long
border
know
america
called
ruling
committee
assault
greenhouse
effect
place
news
already
community
energy
found
lawmaker
agency
white
advocate
every
justice
man
system
civil
power
told
ago
trump
enforcement
must
question
gov
call
recent
owner
voter
friday
carry
area
sen
put
record
appeal
good
keep
several
former
see
allow
smoker
security
smoke
job
yesterday
death
least
church
money
license
san
become
thing
increase
others
legislature
level
might
scientist
cost
thats
five
four
le
lawsuit
rule
john
across
director
came
mayor
executive
research
end
give
safety
virginia
billion
past
council
governor
around
far
democratic
set
point
environmental
likely
stop
major
believe
lawyer
authority
resident
officer
senator
conservative
mass
constitutional
never
little
rep
march
order
saying
proposed
st
nearly
majority
party
force
colorado
election
organization
fact
georgia
human
concealed
protection
killed
yet
asked
away
step
reduce
conference
guncontrol
side
regulation
took
meeting
expected
face
dioxide
constitution
trying
approved
purchase
pas
six
enough
similar
mean
decade
cause
sign
left
move
supporter
period
statement
domestic
though
pay
partner
making
rate
result
chief
plant
candidate
limit
person
voted
hand
care
important
restriction
however
something
cut
social
stand
lesbian
street
im
let
reason
individual
thousand
find
arm
buy
employee
temperature
big
married
men
look
line
dealer
texas
protect
air
hearing
opponent
drug
deal
allowed
attack
status
letter
young
clear
board
later
lead
released
shot
announced
fight
north
argument
claim
whose
poll
mexico
doesnt
bar
product
idea
legally
require
hope
better
undocumented
got
reform
international
taking
charge
car
defense
challenge
held
risk
agreement
position
event
spokesman
history
june
filed
building
maryland
parent
night
view
matter
talk
future
lot
almost
agent
began
along
nothing
didnt
ad
cancer
hour
able
within
current
presidential
brady
earlier
often
science
jersey
recently
waiting
instead
store
cant
deportation
visa
based
south
restaurant
fuel
taken
prevent
legislative
activist
college
early
known
process
wrote
concern
private
anyone
include
fear
using
lobby
working
really
victim
open
society
threat
sunday
document
there
panel
black
real
toward
top
economic
mexican
bear
illegally
ground
outside
address
half
continue
response
live
kind
massachusetts
getting
small
provide
provision
word
economy
data
although
hold
given
done
run
population
evidence
signed
age
park
water
large
different
minnesota
list
representative
information
issued
impact
earth
citizenship
largest
atlanta
head
marry
ordinance
free
name
west
missouri
start
alien
seeking
hundred
war
post
session
led
term
ever
opinion
required
best
favor
cannot
michael
standard
theyre
food
mother
coming
despite
interest
target
ice
interview
francisco
attempt
price
fire
press
george
went
suit
congressional
beach
try
proposition
fund
expert
settlement
comment
turn
dozen
r
market
ballot
rather
foreign
added
great
friend
growing
july
initiative
david
someone
story
disease
louis
strong
reported
consider
begin
message
offer
november
saturday
ruled
source
feel
education
failed
possible
wont
adult
allowing
kid
became
secretary
full
late
brought
example
sense
goal
banning
legislator
arizona
town
mark
hard
needed
medical
certain
april
average
sell
chairman
fall
close
agreed
opposed
terrorist
rise
special
key
bring
latest
gop
naturalization
sent
massacre
higher
chance
obamas
project
meet
soon
tell
battle
access
final
refugee
researcher
card
sea
magazine
seven
politician
together
degree
thought
semiautomatic
charged
wanted
isnt
always
seek
serious
capitol
politics
philip
push
increased
living
review
opposition
commission
per
seen
decided
sheriff
sure
bureau
common
killing
movement
application
wrong
form
longer
dc
leading
received
speech
kill
in
significant
vice
demand
oil
morris
lost
arrested
he
editor
ownership
nicotine
buyer
technology
hispanic
military
natural
institute
morning
relationship
old
amount
behind
potential
freedom
coal
article
answer
brown
circuit
annual
dangerous
spent
james
religious
lung
environment
subject
read
summer
raise
robert
employer
near
century
budget
course
especially
stay
mental
murder
return
finding
lower
manufacturer
language
father
bad
prison
supported
paper
maker
atmosphere
son
anything
m
front
belief
approach
coalition
trial
island
paul
survey
probably
role
either
ask
eight
campus
simply
heart
armed
seems
died
attention
focus
carrying
race
opportunity
convicted
heat
sold
grant
professor
clean
estimated
wife
pennsylvania
equality
safe
share
carolina
calling
los
light
room
create
pollution
denver
assembly
gave
illinois
rally
nationwide
leave
available
request
apply
responsible
medium
rising
vehicle
turned
speaker
agree
requires
weather
yes
decide
love
solution
actually
considered
ammunition
china
violent
commissioner
central
tried
damage
recognize
personal
green
argued
committed
wedding
dead
short
included
teacher
difficult
bloomberg
particularly
victory
spring
third
approval
scientific
allows
investigation
hospital
requirement
floor
sept
requiring
dollar
chicago
started
labor
caused
banned
j
joined
angeles
passage
treaty
advertising
pack
ceremony
everyone
site
gore
figure
activity
helped
buying
editorial
protest
showed
danger
driver
trade
scheduled
resource
liberal
mile
scott
pressure
fbi
denied
release
powerful
heard
quickly
looking
rejected
smith
following
ill
firm
land
remain
hear
antismoking
designed
introduced
insurance
class
hall
jan
true
unconstitutional
newtown
region
block
reduction
elected
involved
sponsor
pistol
connecticut
arrest
perhaps
jail
la
includes
changed
accused
weve
difference
jr
quit
choice
agenda
reducing
created
richard
running
single
win
offered
property
book
cigar
hill
version
tough
aimed
worked
staff
nine
drive
senior
minor
discussion
kyoto
bay
convention
warning
existing
dr
boy
possession
reach
southern
series
door
airport
reached
oppose
equal
ocean
total
beyond
understand
parkland
miami
development
moment
lawabiding
usa
palm
critic
fee
concerned
condition
fine
penalty
asylum
published
philadelphia
road
giving
practice
prosecutor
fossil
w
model
shop
english
produce
sought
range
test
raised
donald
tragedy
patrol
january
latino
responsibility
spokeswoman
field
value
deadly
teenager
due
jury
bipartisan
homeland
spending
biggest
december
play
compromise
alcohol
customer
regulate
commitment
author
farmer
greater
operation
refused
happen
team
struck
forward
william
controversial
immediately
thomas
trend
husband
licensed
youre
type
martin
planet
columbia
increasing
break
tom
bullet
save
easy
fla
mostly
voting
comprehensive
estimate
asking
join
necessary
seem
declined
youth
selling
partnership
rest
affect
reporter
effective
guard
moved
sandy
violation
intended
felon
epa
stock
institution
growth
prevention
wake
purpose
wait
mind
primary
paid
stricter
consequence
expect
additional
granted
add
discrimination
voice
loophole
account
shift
custom
ability
sponsored
body
happened
stopped
heterosexual
forced
else
east
joe
bob
illness
promise
financial
leadership
crowd
watch
arent
judiciary
club
considering
associated
alone
tougher
met
analysis
chamber
machine
defend
written
spoke
lack
present
feb
compared
appears
ordered
journal
minute
permanent
talking
reasonable
noted
middle
training
charles
strategy
catholic
hit
statewide
foot
socalled
largely
holding
ive
wall
urged
page
avoid
resolution
weekend
inside
temporary
elementary
speak
douglas
jose
saw
visit
applicant
previous
aid
veto
vermont
specific
traditional
appeared
round
follow
beginning
remains
barack
send
doubt
declared
daughter
moving
dec
huge
conn
package
jim
unless
changing
curb
popular
guy
main
wasnt
secondhand
coast
homosexual
video
el
continued
announcement
facility
foundation
forest
relative
oct
wouldnt
poor
broad
liberty
television
selfdefense
gunman
teen
argue
writer
whats
hook
suspect
cuban
manager
cover
followed
space
highest
credit
gone
consumer
enforce
everything
v
minister
pending
recognition
build
pushing
tampa
generation
priority
clearly
advocacy
detention
homicide
addition
neighborhood
extreme
adopted
enacted
inc
certainly
email
experience
receive
fighting
separate
repeal
situation
daily
nov
facing
reality
column
funding
treatment
sex
finally
speaking
developing
limited
loss
spend
starting
fellow
deported
deputy
l
provided
reagan
piece
expand
gang
movie
opened
online
drought
plaintiff
willing
simple
file
deny
throughout
note
suggested
focused
lobbyist
easier
path
proponent
accept
culture
wave
sometimes
supporting
low
whole
appear
incident
increasingly
showing
doctor
petition
reynolds
vega
al
passing
clerk
minority
guilty
co
factor
planned
february
obtain
santa
pm
e
progress
sound
driving
legalize
die
recognized
hunting
manhattan
ahead
truck
electricity
apparently
christian
bought
historic
count
prove
standing
ready
european
harm
lobbying
raising
cuomo
felony
adding
capital
brother
wind
enter
related
statistic
shooter
truth
basic
brooklyn
king
promised
currently
brand
burning
revenue
lose
fewer
station
computer
ended
track
worth
northern
dropped
prohibit
keeping
detail
wisconsin
otherwise
kept
spouse
bank
colleague
maybe
backed
mom
critical
overall
sued
calif
canada
believed
native
negotiation
leaving
game
cap
born
respect
seemed
discus
caught
kennedy
rev
seat
delay
august
knew
chinese
conviction
becoming
entire
defeat
conducted
fired
farm
previously
described
valley
hurt
success
determine
nature
meanwhile
produced
elsewhere
eye
section
sexual
basis
particular
sentence
neither
atmospheric
decline
habit
amnesty
travel
endorsed
gain
tv
alternative
ten
god
failure
mike
approve
marketing
serve
shotgun
haitian
hurricane
base
influence
antigun
threatened
columbine
production
assistant
expressed
storm
contract
hillary
task
romney
newspaper
radio
cited
strict
terrorism
felt
restrict
tree
eligible
prohibited
complaint
sport
putting
statute
mandatory
september
worry
lock
drop
organizer
named
politically
season
aug
warned
boston
crisis
suicide
option
arrived
represents
suggest
ohio
offering
october
ensure
generally
date
holder
potentially
definition
suspected
abuse
upon
smokefree
eventually
impose
safer
militia
contribution
none
landmark
conclusion
behalf
brief
learn
housing
delegate
afternoon
exactly
pushed
sort
image
table
twice
dream
shouldnt
emergency
gathered
welfare
worst
utility
supply
device
criticism
jurisdiction
highly
lived
progun
nuclear
renewable
arctic
aide
b
chris
continues
de
various
host
easily
income
fair
openly
orlando
mentally
provides
providing
ally
utah
hotel
migrant
enact
regarding
flood
sweeping
id
immediate
c
andrew
served
concluded
iowa
cruz
trigger
winter
virtually
queen
worse
stage
johnson
phone
fully
opposes
remark
f
couldnt
shoot
wounded
stoneman
smoked
planning
suggests
cold
hawaii
blame
except
involving
walk
strongly
division
indeed
network
pattern
protecting
helping
picture
trip
specifically
veteran
un
japan
commercial
longterm
oregon
drew
fox
rick
flight
registration
pretty
western
signature
wilson
red
wed
gunrights
taxpayer
conduct
carried
hire
extend
false
referendum
patient
straight
abortion
predicted
moral
davis
arguing
returned
meant
rose
tie
quite
guarantee
choose
stronger
neighbor
criticized
unlikely
sander
affair
larger
creating
ton
solar
turning
exchange
advance
upheld
girl
stance
independent
opening
leaf
workplace
census
summit
urging
here
percentage
behavior
consensus
methane
secure
bishop
complete
improve
vowed
draw
ran
represent
stood
determined
telling
marjory
strike
learned
opposing
joseph
entered
promote
wage
concealedcarry
amid
flow
bringing
nonprofit
nonsmoker
aim
limiting
conversation
emotional
miller
india
instance
testimony
applied
combat
guest
welcome
search
web
retired
rural
cent
maine
setting
urban
injury
survivor
original
respond
steve
lake
organized
photo
thinking
linked
spot
supposed
link
coverage
wish
cutting
reaction
acknowledged
directly
environmentalist
divided
roughly
minimum
analyst
visitor
reelection
performed
hot
topic
effectively
prospect
dispute
affected
defendant
cuba
draft
shown
occurred
commit
happens
fraud
cross
violated
ultimately
challenged
feeling
deep
investigator
custody
vast
publicly
fell
army
sue
prohibits
michigan
witness
placed
repeatedly
europe
developed
bond
seriously
bus
employment
schumer
mountain
faced
edward
complex
hasnt
registered
detained
pastor
whatever
losing
successful
happening
protocol
mention
database
judicial
christie
industrial
register
regardless
direct
obtained
worried
transportation
alaska
household
relation
licensing
heavily
owned
fda
fundamental
reading
unit
stephen
adopt
rubio
nominee
regional
baby
reduced
montgomery
folk
loaded
encourage
usually
slow
unusual
issuing
automatic
lapierre
commerce
faith
paying
construction
refuse
acting
principle
prominent
killer
pledge
passenger
forum
widely
bit
barred
peter
supervisor
possibility
surprise
harder
instant
thus
intent
internet
agriculture
frank
deport
meaning
challenging
corporation
identification
residency
paris
worldwide
gathering
sister
downtown
universal
walker
claimed
specie
protected
albany
expanded
blue
pointed
severe
williams
aggressive
theyve
league
protester
valid
dramatic
significantly
explain
older
consideration
mccain
looked
dealing
closed
launched
prepared
prompted
seller
smuggling
massive
ought
anywhere
proof
scene
presented
aside
mandate
investment
efficiency
crop
retailer
broader
attend
relatively
treated
shall
headed
pick
volunteer
causing
contribute
spread
quality
hoping
representing
attitude
thanks
innocent
adviser
fix
obvious
exception
adam
cash
wayne
filing
prohibition
develop
pledged
endorsement
blocked
atf
possibly
writing
becomes
metro
profit
remove
established
playing
joint
traffic
purchased
highcapacity
flag
litigation
warmer
trouble
legitimate
corporate
pew
kelly
bump
broken
identified
tech
river
fast
connection
sensible
theater
registry
star
burden
payment
responded
finance
n
cop
medicaid
corp
heavy
oklahoma
deadline
advantage
award
h
camp
outcome
feature
tool
audience
internal
airline
academy
hiring
defeated
handle
violate
backing
crack
injured
recommendation
lie
patrick
settled
havent
offense
younger
unfortunately
giant
vulnerable
fill
duty
misdemeanor
urge
built
foreigner
british
reporting
angry
plea
management
alliance
hunter
counsel
eliminate
electric
notice
us
subcommittee
religion
grow
remember
juvenile
longtime
administrator
zone
warm
closer
hampshire
played
balance
secret
yorkers
overwhelming
disaster
absolutely
dole
richmond
alleged
boat
diego
peace
mission
moderate
va
onto
van
addictive
identity
cultural
posted
controversy
intense
treat
raid
expensive
pose
dan
box
rare
define
ronald
honor
momentum
seeing
positive
player
fourth
struggle
professional
entry
evening
overturn
iraq
remained
cast
wonder
walked
margin
sending
prevented
wide
facebook
closely
striking
happy
film
familiar
annually
write
heattrapping
mary
questioned
fort
reader
associate
expanding
procedure
character
rj
negotiator
split
normal
grew
handful
overwhelmingly
rain
filled
liability
purchaser
deeply
telephone
establish
reject
client
attended
renewed
unable
overturned
signal
failing
counter
asian
window
surface
therefore
methodist
broke
substantial
citing
direction
eastern
nevada
understanding
accident
relief
denying
pleaded
posse
legalizing
crucial
career
chemical
hoped
begun
animal
regular
enforcing
impossible
baltimore
backer
blood
apartment
unmarried
sun
shortly
trafficking
orientation
militarystyle
smuggler
rhetoric
unlike
1990s
contrast
proceeding
accord
kerry
jerry
explosive
indian
aware
stated
ryan
camel
modern
presence
referring
demonstration
fought
conflict
headline
tim
essentially
rampage
identify
location
smaller
trust
continuing
eric
giffords
modest
grown
sharply
violates
sanctuary
birth
consumption
indicated
twothirds
sharp
fiscal
bid
avenue
commonsense
pulled
widespread
covered
nationally
restricting
melting
twitter
murphy
dismissed
tighter
ar15
theory
double
joining
size
muslim
hired
claiming
newly
settle
lee
active
ending
stolen
civilian
smokingrelated
extended
announce
targeted
removed
correct
train
tradition
feinstein
receiving
founder
producer
addressed
kansa
racial
dick
crossing
suburban
display
usual
owen
admitted
blamed
mississippi
extra
unanimously
barring
overhaul
saving
dramatically
pollutant
multiple
headquarters
g
daniel
patch
assistance
hate
permitted
hardly
appearance
website
ken
congressman
werent
user
tuition
imagine
quarter
preventing
variety
memo
qualify
opposite
african
cdc
entitled
addressing
nomination
grand
shes
barbara
quick
firing
prohibiting
truly
appropriate
offender
privilege
realize
combined
atlantic
divide
mall
verdict
portion
achieve
oped
implication
core
boost
stem
ship
prince
picked
greenhousegas
unprecedented
superior
sarah
motion
talked
mistake
jones
pull
favored
communication
classroom
surprised
maintain
entering
dallas
fail
afraid
merely
recognizing
sick
jeff
village
score
brian
music
jewish
stake
anthony
category
marked
confirmed
accepted
walking
gonzalez
rich
suing
surge
tactic
exemption
addiction
allegedly
surgeon
legalized
rival
participant
ny
certificate
incentive
rank
regulating
plus
plane
cheap
dean
owning
branch
inspector
marlboro
legalization
antitobacco
colo
glacier
investor
comply
defined
billboard
waste
flooding
reid
defending
chapter
nasa
solve
sector
garden
donation
unclear
cry
clip
regulated
importance
foreignborn
snow
capacity
art
numerous
square
treating
aftermath
aurora
detainee
proper
jay
completed
halt
arrival
crackdown
signing
participate
contentious
parking
permission
nc
watched
expansion
shared
demanding
everybody
ted
partisan
howard
recall
typically
lesson
latin
jackson
migration
proud
factory
odds
obligation
pat
suburb
durham
del
ambitious
rapidly
delivered
assessment
establishment
corner
nearby
transfer
material
predict
coastal
economist
greatest
granting
gayrights
gunrelated
schwarzenegger
testified
strengthen
debated
drawn
repeated
circumstance
prosecution
shield
advertisement
doma
californian
embrace
slightly
polar
pacific
childrens
declaring
mitt
sitting
encouraging
winning
closing
meaningful
graduate
tend
applying
pass
ring
spanish
anniversary
fence
perform
founded
replace
highway
clara
voluntary
rapid
primarily
canadian
suffered
temporarily
entirely
locked
constituent
poverty
outlaw
sentenced
expense
kentucky
homosexuality
advanced
satellite
unveiled
conspiracy
pursue
follows
attempted
enjoy
england
fresh
notion
dennis
attacked
restrictive
williamson
industrialized
pound
pressing
driven
medicine
faster
fate
miss
resolve
watching
indoor
grower
minneapolis
please
interested
suggesting
merit
russia
mccarthy
boulder
manmade
denial
susan
knowledge
equally
chain
henry
divisive
exercise
exposed
tallahassee
casino
perry
kevin
cycle
threatening
highlight
motor
element
represented
pride
prayer
binding
obviously
breaking
bottom
serving
everywhere
defining
smart
teenage
vetoed
mainly
baseball
cleared
consistent
seized
purchasing
terror
hole
coalfired
surrounding
tourist
gap
shut
equivalent
afford
amend
applies
h1b
pipeline
deserve
stalled
import
tomorrow
wound
wearing
sporting
auto
germany
rush
hell
membership
intention
match
vow
route
arkansas
completely
wildlife
fahrenheit
tied
extremely
surprising
ignored
pain
imposed
submit
thompson
bigger
promoting
height
prime
male
larry
unique
biden
giuliani
soldier
ashcroft
radical
demonstrate
desert
exposure
concept
defended
fit
protects
violating
clergy
desire
collins
blow
nancy
scheme
alabama
introduce
salvador
immunity
inmate
nelson
explained
allen
swing
tide
noting
directed
scrutiny
grade
discourage
jack
reflect
p
resulted
ethnic
fingerprint
desk
divorce
disagree
pact
aspect
principal
scale
emerged
formed
nobody
fan
houston
targeting
indiana
collect
rating
manufacture
possessing
preliminary
ignore
fatal
root
nj
contrary
gotten
dakota
actual
outrage
attending
abc
appealed
baker
platform
burn
healthy
partly
uncertainty
successfully
russian
apart
lewis
lawful
speed
cloud
agricultural
owns
caucus
ticket
federally
arnold
harmful
unfair
substance
soil
occur
port
negative
item
female
revealed
anger
originally
missing
somebody
wesson
preserve
outdoor
kick
initially
exist
referred
error
deciding
heller
hopeful
enormous
feared
perfect
camera
discussed
weight
override
harry
haiti
theyll
suffer
complained
stamp
judgment
initial
automobile
actor
who
golden
beat
epidemic
assassination
climatechange
eager
prediction
insisted
enforced
9th
discovered
complicated
chose
chuck
conservation
tear
earned
funded
allegation
code
alan
ongoing
narrow
janet
gaymarriage
reverse
roll
qualified
dcalif
disappointed
municipality
retail
net
forcing
weak
remaining
praised
q
manner
suddenly
pope
courage
healthcare
preparing
sentiment
councilman
estate
australia
acknowledge
pair
harvard
engineer
1980s
invited
officially
stopping
capandtrade
generate
announcing
cite
sparked
knowing
sanction
bag
nixon
reno
gasoline
gift
co2
advice
plain
attempting
mentioned
scenario
courtroom
recover
survived
outofstate
nonsmoking
anybody
color
madison
era
teach
broadcast
personnel
residence
tiny
austin
regulatory
adoption
learning
appropriation
hb
warrant
louisiana
surely
listen
refusing
label
defines
authorized
bernardino
africa
wood
mainstream
baptist
bridge
drawing
terry
strip
tennessee
seattle
shortage
educational
mine
contributed
method
marco
ease
fairfax
petersburg
gained
focusing
deliver
celebration
cool
highprofile
suspended
teaching
lethal
loved
proposing
globe
tighten
studying
oceanic
straw
hammer
reflects
controlled
rarely
carnage
sb
robbery
implement
express
saved
practical
screen
manufacturing
sight
ii
declare
nightclub
marrying
persecution
resistance
recommended
contest
intergovernmental
contact
punishment
fifth
omalley
gary
municipal
frequently
formal
experienced
offset
threeday
guideline
routine
regularly
anderson
soviet
projected
detailed
recorded
terrible
rock
difficulty
interstate
plenty
ceo
francis
exists
cheney
celebrate
silver
stepped
liggett
ozone
pace
rio
steady
prepare
design
maximum
embraced
suggestion
mail
properly
fled
graham
toll
extending
knife
gray
memorial
ed
extent
longstanding
ford
escape
obtaining
promising
cnn
skill
contractor
punitive
clause
shore
administrative
consultant
decrease
performance
journalist
denomination
objection
thank
threaten
steven
dianne
illegals
cooling
weekly
southwest
responding
treasury
moore
considers
tour
viewed
exempt
shopping
toughest
creates
endorse
donor
barrier
touch
handed
sevenday
lay
essential
generated
imposing
tucson
fed
uncertain
landscape
convinced
library
sat
parade
constitutionality
bible
barely
presidency
duke
britain
costly
physician
personally
overseas
encouraged
apparent
hailed
indictment
reference
submitted
cleaner
shape
pleased
dying
mix
christopher
brings
suffering
contains
designated
packed
anyway
chair
fatally
republicancontrolled
laborer
efficient
gather
processing
shifted
fly
persuade
tragic
admission
congregation
struggling
ron
northeast
contributing
insist
cell
argues
guess
devastating
contend
text
lowest
sit
interpretation
dog
requested
abroad
foster
murdered
perspective
warmest
skeptic
brain
german
zimmerman
stringent
dinner
hunt
yard
prior
floridian
indicate
map
involves
inspired
tackle
appointed
declining
heated
bronx
gender
honest
islamic
wouldbe
injunction
assaultstyle
toomey
passport
copy
oakland
equipment
improvement
restricted
shifting
inch
narrowly
rely
mount
tonight
craig
delayed
basically
theme
hollywood
tank
discount
quota
acted
letting
courthouse
fairness
elian
urgent
writes
asks
confident
tony
falling
operating
channel
sad
frustration
pa
horrific
silicon
delegation
loan
marine
threatens
timing
lifetime
sensitive
enemy
declaration
dekalb
pool
pilot
necessarily
describe
episcopal
jumped
paperwork
georgian
israel
sacramento
wild
survive
acre
moreover
idaho
engaged
rhode
holiday
christmas
physical
propose
acceptance
polling
blessing
lax
retreat
jennifer
stayed
resulting
interesting
trail
troop
listed
diverse
deemed
demanded
journey
assertion
confusion
harris
twin
desperate
wildfire
screening
plastic
alive
vital
regard
appellate
proved
memory
trained
prospective
classaction
stark
sheet
reaching
expects
trap
posed
undermine
busy
awareness
cook
gulf
formally
heading
ok
spoken
serf
guatemala
noncitizen
newsom
chile
accepting
fiveday
diversity
commonwealth
marched
windsor
abuser
heston
skilled
comparison
uphold
arming
everytown
rjr
string
typical
collected
curbing
fairly
founding
guide
abandoned
butt
backlash
orange
fulton
concealedweapons
content
nice
convince
metal
arrive
privately
zero
object
montana
detective
youve
carter
metropolitan
motivated
phoenix
sam
restraining
jew
anticrime
intelligence
launch
controlling
mixed
contained
regulator
pressed
defender
iii
democracy
tired
clinic
tropical
sierra
silence
explanation
context
shell
reviewing
mouth
forecast
slaughter
filibuster
horror
enthusiast
marijuana
removal
smokeless
instate
catch
hillsborough
france
evangelical
resort
throw
investigate
stick
stadium
patron
pocket
evil
elli
destroy
arriving
sand
denounced
investigating
extensive
traditionally
pentagon
strongest
resolved
fallen
warren
amended
shame
lawenforcement
gunfire
destruction
logic
winner
bird
faculty
inaction
phase
grassroots
berkeley
via
upset
somehow
theft
rabbi
uniform
trading
master
hottest
belt
depending
stretch
accurate
dave
substantially
ranging
urgency
phrase
reputation
compelling
demonstrated
tone
crowded
admit
pete
boycott
castro
gum
punish
availability
doubled
k
waited
scholar
sixth
concentration
incumbent
recalled
buck
dny
influential
hazard
managed
drafted
warner
gate
assume
delta
harsh
10th
lt
privacy
lifestyle
dry
reversed
asia
refusal
depend
returning
vendor
recipient
lighting
somewhat
misleading
monitoring
technical
copenhagen
competition
ward
capture
examine
tip
stream
reportedly
ridge
blocking
unnecessary
involve
engage
reviewed
md
jefferson
handling
maria
mcauliffe
demonstrator
hightech
comfortable
deter
antiimmigrant
upper
shadow
tweet
compliance
combination
justify
array
tex
excuse
contends
indication
carefully
consistently
transaction
martinez
unlicensed
spirit
heating
function
greg
walmart
blunt
museum
studied
frequent
reminder
farreaching
gubernatorial
orleans
component
conventional
circle
favorite
understood
contributor
independence
bloombergs
totally
cooperation
inevitable
succeed
restore
arrangement
missed
definitely
jump
unanimous
oral
minnesotan
enacting
nurse
fleeing
title
vision
unemployment
questioning
warn
publication
absence
morgan
noaa
foe
attract
replaced
counterpart
denies
progressive
resume
emotion
crossed
quietly
garcia
vending
assaultweapons
committing
participating
historical
onethird
pension
matt
festival
forget
catastrophic
jeffrey
projection
greatly
improving
precedent
flawed
educator
southeast
spitzer
traveled
newcomer
severely
threw
cox
awaiting
prize
laboratory
poised
quiet
optimistic
crew
risen
pro
routinely
lisa
concert
jesus
scalia
dreamer
scope
pipe
awarded
matthew
republic
stress
electronic
monitor
proceed
edition
wealthy
delaware
bernie
accidental
hed
silent
rob
solely
crazy
pinellas
taylor
vietnam
gunned
transgender
tobaccorelated
producing
revolution
bound
testing
commentary
strength
competitive
examined
hidden
ride
midnight
threejudge
hero
employed
grove
fake
karen
barr
lgbt
kessler
advisory
nowhere
1970s
northwest
civic
stuck
signaled
apple
dedicated
lift
extension
setback
symbolic
roman
arena
spotlight
undercover
salvadoran
daca
permitting
stuff
advocating
gross
empty
remarkable
profile
guaranteed
attributed
federation
besides
carlos
recovered
anymore
dad
dark
offensive
littleton
manchin
discretion
gavin
adopting
fierce
collection
creation
negotiated
unarmed
appearing
troubled
row
debating
academic
governing
relevant
fails
gingrich
artist
sportsman
schedule
prefer
dependent
rational
traveling
passion
bruce
structure
charleston
trace
feed
rape
praise
distribution
employ
earn
ann
hurdle
outlawed
confrontation
shelter
expired
verify
lady
infringed
gunshow
discriminatory
oppositesex
jon
visited
experiment
indicates
observer
supportive
sufficient
gold
drove
pittsburgh
drinking
concerning
vocal
visiting
intend
showdown
herring
arlington
extremist
superintendent
elderly
checked
alexandria
ak47
disabled
symbol
approximately
climatic
brazil
band
featured
quoted
discussing
careful
informed
rejection
underscore
attracted
repeat
interviewed
coordinator
olson
midwest
phil
documented
engineering
slowly
ap
emitter
obstacle
breathe
20th
robinson
normally
tweeted
disclosure
lobbied
outright
juror
borough
performing
cessation
phenomenon
hotter
capable
polluter
17yearold
influx
singer
emerging
inquiry
print
mcconnell
antonio
bombing
backlog
africanamerican
cobb
contain
chosen
reef
alter
depends
fundraising
solid
crist
suspicion
pointing
ordinary
upcoming
beating
quitting
corbett
gunshot
antigay
considerable
implemented
prop
recognizes
nebraska
documentary
london
dear
charlie
turnout
twoyear
laid
kenneth
merchant
switch
staffer
historically
bed
procedural
enjoyed
organizing
fundraiser
origin
midterm
renew
gabrielle
chapel
guestworker
negotiating
emit
lawrence
reserve
fish
prescription
frustrated
collective
visible
sends
reconsider
bail
premium
newark
harrisburg
lott
bisexual
alderman
gwinnett
burned
retirement
storage
extraordinary
cabinet
crash
oh
irresponsible
afghanistan
refuge
willingness
irish
accountable
photograph
funeral
trayvon
webb
gunsafety
educate
sustainable
update
venture
respondent
gregory
evolution
debt
tension
heritage
overcome
outspoken
paterson
navy
champion
ridiculous
accusing
fugitive
chewing
intensity
eat
achieved
appointment
affecting
blog
humanity
reliable
distributed
useful
friendly
deficit
activism
disagreement
stable
revolver
strategist
hadnt
ultimate
surveyed
attached
acceptable
voluntarily
fortune
roy
concludes
mo
nevertheless
elizabeth
jeb
traced
stone
ave
coffee
finger
chest
drilling
famous
economics
avoided
ratified
aggressively
nonetheless
jason
asthma
1960s
edge
somewhere
volume
sidewalk
operate
bright
wear
confront
premise
improved
deserves
welcomed
doctrine
dismiss
assemblyman
junior
childhood
jordan
presbyterian
negotiate
sky
rejecting
framework
constant
coauthor
occurring
gallup
implementation
intends
weigh
reluctant
measured
reasoning
compare
pregnant
raleigh
springfield
stranger
knowingly
voterapproved
toxic
alarm
automatically
proven
weaken
anticipated
updated
observed
carl
simon
permanently
profound
kicked
competing
realized
identical
forever
liable
postdispatch
blasted
deferred
disturbed
racist
deadliest
recess
rallied
trafficker
youngster
lorillard
participation
detroit
wyoming
legacy
rent
swift
skeptical
transport
covering
promotion
alike
exhibit
dominated
packing
addicted
classmate
gunfree
nypd
tobaccofree
automaker
destroyed
stanford
craft
underground
accounting
celsius
bitter
answered
timothy
wisdom
super
tremendous
removing
marshall
disturbing
succeeded
enterprise
pelosi
bold
residential
describes
delivery
ross
warehouse
ecigarettes
mechanism
reed
fraction
rail
melt
rocky
toy
bomb
inspection
charging
reservation
dependence
operator
celebrity
barrel
fault
violator
stewart
costa
bell
mitchell
shoulder
prisoner
climatologist
reversal
dropping
thrown
listening
21st
explaining
yield
accusation
taught
differently
occasion
territory
plaza
approving
kitchen
sc
lopez
juan
wore
christ
charity
walkout
dignity
senseless
gunmakers
sniper
columnist
financing
buildup
ecosystem
taste
fred
unknown
airplane
sharing
globalwarming
smell
sample
perfectly
paint
peak
spike
conscience
tea
sorry
slogan
scare
loving
nuptials
coloradan
attacking
commonly
existence
metric
devoted
habitat
objective
steadily
perception
counting
prompt
cartoon
expire
ignoring
involvement
oak
wing
seize
missourian
ore
loud
disagreed
revised
assist
unauthorized
forth
boehner
unfairly
tancredo
dirty
inconvenient
establishing
circulation
likelihood
contended
instrument
accompanied
potent
reflected
conclude
clothes
voiced
ben
distance
distinction
neighboring
grocery
agrees
cbs
legality
probation
interracial
dire
passionate
similarly
counted
hide
concession
maintained
length
theyd
mounting
sullivan
roof
etc
encounter
subsequent
documentation
weighing
cable
shock
invitation
sweep
christine
casey
backgroundcheck
premature
gallon
technique
mere
fashion
episode
russell
chart
cheer
safeguard
hatch
celebrated
campbell
ethic
determination
horse
peer
stripped
luther
lucky
poster
pataki
deporting
glock
export
nobel
rolling
jet
assumption
lottery
affordable
interior
safely
concrete
agreeing
zoo
eve
breakthrough
lane
preference
infrastructure
joke
youll
renewal
drink
discriminate
extends
quote
unlawful
approached
prevents
convenience
football
ga
assigned
recruit
honduras
being
monthly
alarming
whenever
clark
alert
chip
mandated
lunch
modified
publicity
challenger
shortterm
pursuing
bradley
fiveyear
disclose
instruction
staying
charter
broward
entrance
detain
seemingly
franciscos
compound
ass
precisely
french
salt
tar
lifelong
1950s
inadequate
speaks
tightening
recreation
lengthy
hosted
justified
14th
cohen
rice
unfortunate
ninth
caribbean
linda
shocked
criticizing
undergo
checking
aggravated
barnes
todd
grip
titled
glass
featuring
gene
fruit
contender
sudden
reasonably
alongside
jonathan
reserved
portland
outraged
style
nathan
rid
korean
slaying
mormon
cocaine
lambda
summary
layer
barry
contributes
segment
waiver
korea
comfort
mill
recommend
dialogue
curtail
hudson
empire
highlighted
hair
postal
aboard
handled
ramsey
electionyear
unexpected
mercury
briefing
transition
manage
explicitly
boxer
disclosed
luis
harbor
leak
stating
dealt
notably
departure
rolled
disability
tracking
shed
emphasized
distributor
grandmother
oversight
quinn
painful
statehouse
separately
graphic
collector
parker
dominican
beer
coral
measurement
labeled
ball
sooner
alto
skepticism
intervention
condemned
spurred
chronic
guidance
expectation
arab
jimmy
prompting
accomplish
sin
conducting
tested
oversees
ear
pathway
workforce
wording
marion
mirror
revision
diocese
processed
slain
naturalized
strange
accommodate
spends
ranking
emitted
heel
clarify
proportion
wash
traveler
mitch
absolute
slavery
selected
cousin
song
random
classified
decides
appealing
surrender
cooper
indicted
nativeborn
subsidy
complain
output
reveal
placing
surprisingly
eating
revive
anonymity
invite
hike
gaining
belong
ensuring
nightmare
vessel
aisle
touched
pasco
prejudice
parole
odonnell
worship
charlton
spree
lastminute
whitman
ideal
flower
stressed
posting
outlined
participated
confidence
logical
literally
lined
wanting
franklin
operated
outlet
charlotte
strictest
puff
repealed
coach
underage
stroke
spur
innovation
description
brook
allowance
carrier
excerpt
nino
collapse
cooperate
compiled
unusually
ranked
realistic
exxon
connected
reminded
deeper
picking
expression
accidentally
duck
knight
ariz
objected
badly
cheered
leg
upholding
overturning
palestinian
exit
clayton
usmexico
nosmoking
ethanol
organize
skin
gut
damaging
invoked
captured
kim
rage
pac
resist
recovery
antarctica
donated
nbc
quest
located
antonin
ralph
pickup
frontpage
laura
broadly
invasion
lautenberg
levy
confronted
briefly
ehrlich
wondered
flew
pursuit
adequate
myers
lawfully
cornyn
antiimmigration
altria
boom
ray
asserted
invest
effectiveness
transit
asset
doug
achievement
tale
cheaper
billionaire
hansen
proliferation
lab
shareholder
bearing
imminent
landed
enable
correction
directive
lying
11th
gordon
clearwater
fined
walter
evans
defensive
burglary
6yearold
endangered
beautiful
cooperative
chicken
misguided
valuable
lawn
biological
sole
specialist
hostile
flying
void
dmass
reception
tribe
banner
nonpartisan
promoted
anne
televised
interpreted
sentencing
4th
outline
auction
isolated
amazing
seventh
rightwing
rogers
sounded
absurd
anxiety
lincoln
everyday
mann
norm
httpwwwnytimescom
milwaukee
firmly
congresswoman
crusade
tape
brave
jailed
swiftly
lounge
noon
eligibility
silencer
reward
crafted
clash
implementing
exact
blanket
bolster
determining
oath
frame
grave
prof
authorization
demographic
eliminated
hang
marcher
educated
notified
notable
campaigning
limitation
republicanled
powell
hogan
morton
prosecute
archbishop
rodriguez
applause
lately
observation
remote
disruption
threshold
destructive
ideological
advocated
advised
confused
echoed
10year
analyzed
calculation
finished
vigorously
struggled
proceeds
retain
preferred
excluded
classic
fe
chase
worthy
eliminating
campaigned
surgery
bias
marilyn
forbid
separated
entertainment
constituency
simpson
marshal
synagogue
smuggled
carol
petroleum
fueled
japanese
virus
recession
latter
arthur
humanitarian
instructor
troubling
embracing
forefront
rodham
releasing
remind
intact
portrayed
tolerance
favoring
filling
jean
highpowered
valentine
constitutionally
computerized
ineligible
largecapacity
homeowner
pump
pronounced
provider
proposes
stevens
pawlenty
substitute
stanley
persuaded
stupid
emphasis
regime
discovery
insists
audit
chairwoman
compensation
communist
noticed
lifted
criterion
investigated
tower
annapolis
talent
liquor
exile
holmes
frederick
hijacker
ruger
confiscated
profiling
rainfall
odd
iran
fracking
triggered
survival
remedy
underlying
flaw
nut
lieberman
flooded
describing
ipcc
maintaining
evolving
unwilling
vacation
volatile
probe
accountability
locality
punished
horrible
specter
ala
lacked
escaped
clout
resigned
birthday
hernandez
ab
uncle
policymakers
philippine
wonderful
workshop
holy
karl
consulting
meat
sophisticated
perceived
twoday
novel
rushed
riot
integrity
paso
pitch
recording
emphysema
dana
castle
altered
loose
myth
outcry
perez
deranged
bench
unlimited
perdue
graduated
carcinogen
adolescent
murderer
addict
minuteman
radiation
accomplished
bulb
aircraft
inhofe
milestone
iron
infection
shelf
fun
ritter
carolyn
tornado
compete
sting
testify
dating
conceal
confirm
infant
governmental
refers
arsenal
scared
nazi
solicitor
expecting
replacement
manufactured
counseling
girlfriend
guantanamo
tight
buried
naturally
timetable
palo
harvest
diplomat
footprint
blair
homeless
slight
frankly
uncomfortable
wolf
corn
impression
royal
meantime
corruption
welcoming
sponsoring
gallery
winston
hopkins
victor
cleveland
priest
brick
hometown
checkpoint
uzi
raton
guatemalan
ashtray
protective
continent
breath
adapt
tag
formerly
tourism
motorist
glad
endorsing
explore
readily
marc
flash
altogether
exploit
prevail
investigative
columbus
cardinal
terminal
staged
hardworking
protesting
teeth
interfere
subjected
countless
chavez
temple
musgrave
absorb
imposes
19th
abandon
soul
marietta
strengthening
bottle
assumed
fossilfuel
affirmed
influenced
catastrophe
promotes
variation
grandchild
plot
attribute
decent
disorder
