said
gun
state
would
law
year
court
marriage
new
people
one
death
right
bill
immigration
federal
u
immigrant
last
say
two
gay
case
city
tobacco
president
samesex
ban
time
mr
also
could
house
issue
county
american
weapon
group
week
school
national
day
republican
control
many
country
first
public
illegal
judge
make
legal
penalty
attorney
official
united
firearm
senate
smoking
amendment
police
couple
child
percent
government
shooting
vote
support
get
even
month
life
supreme
may
like
million
measure
cigarette
florida
since
decision
want
crime
member
three
legislation
company
take
congress
family
health
york
check
rifle
appeal
way
woman
washington
murder
district
justice
man
whether
california
including
dont
show
violence
made
nation
association
tuesday
criminal
lawyer
today
come
general
second
background
democrat
policy
handgun
number
work
home
department
wednesday
campaign
found
office
execution
without
monday
program
political
go
another
thursday
ruling
union
need
nra
sale
debate
part
student
back
think
service
used
told
high
citizen
gov
worker
use
according
trial
center
among
still
industry
plan
going
friday
leader
assault
yesterday
action
effort
much
passed
act
change
ago
put
next
convicted
know
local
border
sentence
enforcement
proposal
civil
jury
system
former
called
permit
prison
administration
lawmaker
bush
clinton
long
killed
carry
place
advocate
white
four
owner
report
news
committee
benefit
question
officer
well
help
tax
trump
must
voter
call
every
community
business
killing
obama
prosecutor
five
several
already
america
allow
john
defense
governor
virginia
church
legislature
keep
study
sen
problem
san
smoker
recent
smoke
came
license
good
money
university
security
st
asked
others
authority
area
least
charge
see
lawsuit
hearing
georgia
drug
give
capital
men
never
might
become
job
mayor
constitutional
thing
safety
victim
order
shot
record
face
thats
across
march
stop
person
end
executive
took
democratic
set
texas
saying
director
resident
majority
agency
effect
rep
mass
believe
nearly
constitution
council
le
conservative
rule
senator
left
concealed
six
later
side
party
statement
little
point
punishment
away
hour
supporter
far
around
likely
evidence
trying
election
approved
past
guncontrol
force
fact
cost
voted
purchase
organization
stand
hand
argument
filed
im
reason
young
street
allowed
proposed
similar
attack
yet
whose
pas
though
expected
opponent
inmate
partner
black
bar
chief
row
pay
night
sign
enough
world
let
colorado
billion
arm
domestic
increase
employee
board
lesbian
find
care
married
held
candidate
claim
individual
social
restriction
dealer
charged
maryland
however
didnt
mother
period
letter
making
mean
move
step
line
status
got
spokesman
june
missouri
something
store
buy
thousand
parent
circuit
major
rate
reform
agent
began
north
earlier
protect
undocumented
wrote
seek
poll
result
look
meeting
legally
regulation
mexico
process
announced
conference
clear
jersey
ruled
hope
history
anyone
protection
sentenced
doesnt
restaurant
outside
scheduled
matter
cause
brady
early
waiting
deal
louis
cancer
important
guilty
almost
fight
college
ad
within
nothing
product
decade
friend
deportation
visa
view
able
lot
challenge
taking
often
michael
legislative
taken
instead
given
stay
head
position
mexican
seeking
require
cant
south
released
better
prevent
private
provision
society
kill
human
along
big
atlanta
recently
george
power
building
lobby
went
idea
illegally
document
based
opinion
word
sunday
name
fear
robert
age
open
someone
signed
hold
research
known
information
die
lead
activist
beach
presidential
although
live
son
ground
issued
car
using
david
limit
r
done
citizenship
marry
comment
father
free
consider
james
really
provide
executed
current
massachusetts
favor
arrested
include
kind
concern
review
wife
mental
attempt
working
april
ordinance
session
park
term
cannot
alien
failed
war
event
died
risk
list
decided
july
became
medical
getting
wanted
fire
led
different
there
accused
seven
minnesota
response
try
sent
ballot
despite
suit
feel
toward
run
press
interview
request
representative
mark
required
november
illinois
continue
conviction
settlement
ever
proposition
francisco
adult
dozen
west
arizona
bear
terrorist
morning
juror
saturday
killer
special
hundred
agreed
small
allowing
panel
level
full
brought
theyre
sheriff
received
tried
begin
talk
defendant
added
story
top
final
legislator
chance
offer
kid
opposed
post
possible
dead
banning
decide
interest
late
education
half
rather
jr
population
massacre
message
town
access
wrong
spent
best
start
he
naturalization
argued
wont
lethal
committed
congressional
thought
real
near
tell
semiautomatic
old
reported
foreign
card
bring
large
paul
turn
application
international
sense
battle
m
strong
certain
military
refugee
ask
morris
carolina
food
close
body
magazine
injection
philip
rejected
smith
bureau
brown
fund
read
denied
coming
great
armed
sell
disease
jail
gop
lost
opposition
eight
soon
gave
sept
living
needed
religious
latest
always
j
largest
return
address
capitol
fall
in
turned
hispanic
pennsylvania
threat
sure
room
behind
commission
william
ownership
race
nicotine
buyer
witness
relationship
common
freedom
grant
cut
agreement
hard
dc
initiative
expert
key
carrying
future
hear
employer
heart
unconstitutional
violent
lung
politician
belief
politics
richard
market
movement
form
arrest
boy
heard
chairman
third
longer
example
subject
growing
ill
seen
isnt
together
supported
investigation
hill
either
push
considered
fbi
language
refused
hospital
front
assembly
manufacturer
anything
hall
philadelphia
love
secretary
potential
nationwide
showed
maker
apply
answer
bad
teacher
serious
los
daughter
equality
dangerous
editor
husband
calling
jan
nine
leave
chamber
campus
chicago
simply
thomas
rally
budget
safe
sold
ammunition
personal
allows
attention
ordered
especially
involved
commissioner
coalition
suspect
medium
reduce
probably
scott
course
banned
speech
wedding
victory
price
obamas
yes
demand
minute
available
guard
lower
block
speaker
denver
opportunity
floor
worked
role
article
raise
included
survey
share
protest
seems
angeles
parole
standard
professor
palm
meet
joined
sought
recognize
labor
ceremony
granted
air
brother
offered
driver
teenager
mentally
helped
leading
passage
pack
test
martin
approval
annual
pistol
vice
advertising
started
target
bloomberg
estimated
changed
requires
data
following
book
actually
class
island
charles
testimony
difficult
practice
paper
win
focus
possession
requirement
insurance
responsible
significant
antismoking
sponsor
count
door
liberal
newtown
declined
elected
connecticut
higher
spring
looking
central
finding
short
quit
january
introduced
everyone
la
damage
minor
raised
buying
oppose
requiring
cigar
editorial
figure
remain
economic
per
patrol
running
spokeswoman
violation
pm
create
property
light
agree
particularly
moment
relative
innocent
struck
alcohol
shop
staff
bullet
moved
asking
tragedy
chair
lawabiding
single
parkland
quickly
firm
english
site
plea
miami
choice
increased
giving
immediately
asylum
dollar
version
petition
airport
project
bob
illness
tough
designed
perhaps
pressure
feb
oct
latino
w
donald
difference
pending
fee
powerful
assistant
deadly
equal
fla
approach
stopped
green
mind
reporter
true
understand
series
inside
homicide
youth
includes
homeland
danger
dec
voting
fine
judiciary
licensed
davis
catholic
summer
paid
rest
trade
road
receive
reached
voice
created
girl
felon
date
robbery
watch
tom
met
deputy
beyond
discrimination
impact
present
team
gang
saw
forced
convention
defend
critic
usa
release
value
drive
happened
appeared
nov
spending
senior
total
bipartisan
considering
youre
v
controversial
weve
tampa
felony
written
clerk
break
unusual
file
mile
custom
wait
necessary
l
pleaded
responsibility
play
oklahoma
reasonable
compromise
else
easy
condition
douglas
operation
type
slaying
forward
intended
television
selling
purpose
jose
joe
training
southern
reach
veto
teen
heterosexual
send
speak
wasnt
sex
discussion
wake
prevention
agenda
goal
loophole
source
crowd
delay
temporary
gunman
statewide
verdict
institute
ive
solution
effective
concerned
jim
due
noted
guy
stock
spoke
declared
doctor
east
machine
field
economy
avoid
urged
johnson
additional
murderer
holding
brooklyn
argue
amount
december
save
eligible
stricter
columbia
aimed
sponsored
customer
separate
ability
remains
williams
liberty
elementary
partnership
happen
carried
warning
permanent
dr
wall
doubt
firstdegree
farmer
repeal
homosexual
king
e
facing
join
applicant
selfdefense
highest
lack
caused
sexual
conn
upheld
institution
statute
bay
page
resolution
associated
planned
fellow
round
detention
hit
primary
knew
seem
spend
club
investigator
incident
expect
range
secondhand
neighborhood
existing
visit
cuban
fired
prove
popular
alone
prisoner
weekend
follow
vermont
wouldnt
gone
hook
impose
tougher
researcher
aid
followed
treatment
sentencing
average
finally
bank
manager
arent
february
video
wilson
prosecution
factor
minority
talking
situation
ended
sandy
unless
mostly
movie
traditional
described
recognition
experience
comprehensive
package
apparently
continued
enforce
financial
enacted
kennedy
serve
deported
eye
everything
provided
ohio
opened
willing
manhattan
appears
fair
abuse
kept
obtain
cuomo
addition
determine
believed
middle
plaintiff
culture
promise
amnesty
socalled
add
lee
easier
god
previous
sister
behalf
aug
clearly
throughout
vega
limited
largely
reynolds
greater
certainly
proponent
sometimes
deny
facility
afternoon
dropped
santa
supporting
station
writer
newspaper
expand
speaking
moving
august
statistic
inc
condemned
electric
shotgun
daily
appear
suggested
account
reagan
seat
prohibit
shooter
advocacy
legalize
caught
suspected
accept
enter
twice
adopted
october
poor
christian
ryan
simple
fighting
recognized
felt
september
possibility
joseph
passing
served
brief
land
beginning
suicide
column
returned
rev
seemed
leaving
standing
client
superior
wounded
broad
note
terrorism
mom
mike
pushing
announcement
vehicle
previously
regulate
born
activity
spouse
lived
detail
whats
compared
funding
lobbyist
affect
bought
overturned
hunting
respect
b
named
involving
wisconsin
judicial
estimate
currently
brand
cited
complaint
expressed
cover
radio
jurisdiction
foundation
ready
c
testified
contract
showing
neither
maybe
online
native
backed
piece
promised
sued
biggest
fewer
keeping
conducted
published
path
lobbying
arrived
leadership
edward
rape
procedure
prohibited
holder
priority
barack
tv
none
calif
lose
resource
driving
courtroom
haitian
development
apartment
neighbor
basis
specific
antigun
focused
putting
definition
counsel
violated
columbine
applied
sound
adding
andrew
orlando
ice
couldnt
custody
main
worth
section
defeat
marketing
boston
veteran
approve
whole
shoot
otherwise
conduct
queen
upon
author
starting
strategy
minister
discus
bishop
abortion
failure
foot
basic
el
phone
lock
ensure
option
becoming
threatened
base
arguing
habit
huge
game
militia
stood
increasing
commitment
emotional
smokefree
shift
organizer
id
f
elsewhere
hurt
co
stephen
scene
entered
juvenile
related
shouldnt
injury
safer
endorsed
hotel
exchange
table
restrict
commit
generally
sport
increasingly
entire
army
strict
dream
utah
revenue
represent
water
housing
hire
opposes
romney
alleged
racial
colleague
walker
drew
historic
openly
pushed
progun
jones
region
miller
taxpayer
admitted
motion
walk
trigger
raising
success
offering
loss
warrant
division
moral
reality
except
eventually
gain
harris
consequence
patient
drop
exactly
recommendation
cop
particular
ten
chris
track
migrant
ran
truth
wish
emergency
baby
low
defender
retired
survivor
meanwhile
harm
politically
wayne
build
smoked
repeatedly
travel
false
stoneman
aide
faced
trend
device
rick
image
worst
offense
bond
montgomery
referendum
registration
circumstance
choose
easily
regarding
learn
search
remark
hillary
allen
farm
critical
guarantee
tie
gathered
century
learned
opening
email
determined
ahead
represents
chinese
sander
gunrights
straight
strongly
welfare
extend
highly
fox
adam
iowa
claimed
strike
providing
sort
criticism
frank
telling
cruz
red
stage
wed
fully
placed
signature
virtually
meant
enact
picture
sweeping
income
census
plant
workplace
task
performed
analysis
serving
influence
hawaii
rise
original
imposed
barred
marjory
cruel
filing
secure
technology
flight
space
provides
concealedcarry
rose
journal
blood
identified
specifically
feeling
nonsmoker
urging
complete
various
oregon
occurred
steve
truck
wage
decline
coast
criticized
cuba
prohibits
worry
host
h
vowed
sue
challenged
behavior
photo
opposing
evening
rural
cash
automatic
supposed
minimum
shown
amid
grand
helping
phase
allegedly
prompted
visitor
usually
de
consumer
presented
injured
fell
model
peter
northern
unlikely
closed
intent
richmond
warned
divided
bus
conversation
credit
ronald
pastor
kelly
dispute
acknowledged
anthony
affair
stance
murdered
duty
detained
guest
walked
computer
obtained
ally
valley
indeed
van
prince
reaction
publicly
effectively
curb
bombing
proceeding
cross
potentially
network
schumer
method
leaf
correction
reelection
bringing
overall
aside
consideration
attempted
younger
secret
cent
register
mary
directly
trip
landmark
dna
protecting
organized
fraud
immediate
fourth
lake
suggest
va
progress
draw
older
concluded
welcome
turning
albany
canada
coverage
percentage
treated
successful
principle
supervisor
loaded
shall
acting
setting
faith
database
blame
pain
licensing
fda
employment
shortly
daniel
unit
prohibition
violate
pretty
registered
changing
proof
crack
quite
owned
lapierre
hasnt
identification
writing
overturn
connection
analyst
commercial
thinking
offender
looked
fort
appropriate
challenging
broken
angry
meaning
mandatory
pointed
maine
n
regardless
issuing
nominee
ultimately
downtown
rampage
wave
ought
clemency
refuse
michigan
protester
gore
representing
theater
instant
deport
continues
conspiracy
fatal
valid
fundamental
happens
residency
avenue
smuggling
alternative
notice
contribution
spot
instance
prepared
seller
recommended
volunteer
litigation
blue
attend
blocked
protected
murdering
whatever
traffic
pick
handle
christie
trouble
remember
science
internet
honor
identity
box
folk
stronger
patrick
dismissed
unable
unanimously
degree
exception
planning
conclusion
generation
universal
relation
hoping
web
anywhere
flag
deathpenalty
paying
metro
broke
improve
star
remove
religion
crisis
theyve
produce
al
respond
retailer
independent
losing
atf
cell
affected
prospect
registry
questioned
highcapacity
harder
deadline
happy
hiring
misdemeanor
payment
character
expanded
legitimate
thus
surprise
rare
camp
flow
suffered
gas
career
owen
promote
purchased
advance
possibly
heavily
medicaid
bump
responded
relief
firing
violates
creating
defeated
prevented
closing
playing
indicated
headed
passenger
topic
growth
endorsement
filled
league
seriously
explain
larger
professional
urban
foreigner
