said
gun
state
would
law
year
court
marriage
new
one
death
people
right
bill
gay
say
last
two
tobacco
u
samesex
could
federal
ban
president
time
also
change
case
city
climate
issue
weapon
mr
national
house
control
week
group
county
first
public
day
percent
school
firearm
smoking
american
republican
penalty
make
many
amendment
couple
judge
shooting
even
global
senate
attorney
may
cigarette
support
like
supreme
vote
warming
country
life
measure
company
police
get
month
emission
decision
since
nation
government
rifle
florida
health
united
take
way
gas
legal
check
official
california
legislation
three
murder
want
million
member
crime
appeal
child
whether
show
washington
including
association
violence
congress
man
york
woman
second
district
made
handgun
dont
industry
justice
background
today
execution
tuesday
much
use
nra
general
sale
campaign
union
come
democrat
report
carbon
study
need
plan
found
wednesday
another
monday
part
think
action
ruling
debate
world
lawyer
family
policy
used
thursday
go
gov
criminal
effort
bush
high
next
administration
without
political
trial
leader
still
according
assault
home
greenhouse
told
going
among
put
energy
sentence
office
clinton
jury
carry
university
back
act
well
permit
friday
question
proposal
effect
obama
department
ago
power
owner
tax
killed
know
convicted
number
yesterday
long
passed
committee
called
lawmaker
former
already
place
center
defense
problem
every
white
killing
news
must
student
system
smoker
civil
call
smoke
legislature
work
four
prison
virginia
governor
prosecutor
advocate
john
voter
record
program
benefit
business
keep
local
recent
several
scientist
help
capital
good
see
might
allow
sen
set
area
church
level
five
least
thats
officer
lawsuit
le
thing
asked
constitutional
st
shot
others
money
rule
cost
environmental
safety
research
san
never
evidence
mayor
drug
end
increase
citizen
america
council
believe
likely
stop
give
agency
victim
billion
community
hearing
face
concealed
around
mass
far
point
past
march
democratic
license
fact
saying
majority
constitution
become
took
guncontrol
georgia
across
person
punishment
major
came
dioxide
colorado
purchase
reduce
statement
little
proposed
texas
cause
argument
men
yet
nearly
regulation
director
conservative
charge
senator
expected
six
executive
partner
stand
protection
away
human
step
later
voted
side
chief
enough
row
approved
force
supporter
domestic
lesbian
rep
conference
hand
im
period
mean
similar
decade
left
hour
arm
opponent
reason
inmate
limit
order
dealer
meeting
sign
though
temperature
plant
restriction
pas
election
party
buy
trying
car
missouri
trump
result
organization
authority
something
enforcement
however
making
bar
married
air
rate
move
important
cut
filed
maryland
allowed
candidate
individual
street
whose
challenge
letter
let
black
product
board
protect
claim
earlier
night
lead
store
june
north
attack
circuit
doesnt
wrote
clear
look
poll
fight
big
panel
brady
cancer
find
young
deal
didnt
got
line
matter
require
began
fuel
jersey
event
view
risk
scheduled
sentenced
history
michael
almost
service
head
position
taking
seek
illegal
science
announced
agreement
employee
kill
within
prevent
ruled
released
ad
nothing
building
lobby
hope
louis
early
talk
bear
lot
process
pay
mother
spokesman
society
instead
robert
idea
george
outside
opinion
resident
care
future
private
anyone
able
held
charged
waiting
given
david
based
recently
legislative
die
fire
restaurant
current
james
massachusetts
ground
using
cant
guilty
concern
standard
security
earth
better
taken
marry
there
age
signed
social
executed
done
international
although
consider
really
job
word
expert
mental
kind
activist
real
friend
often
known
sunday
threat
term
response
led
include
r
water
ever
along
favor
someone
top
comment
impact
legally
address
park
presidential
attempt
south
toward
killer
press
ballot
review
continue
went
hold
settlement
open
final
west
despite
ordinance
juror
suit
data
list
issued
minnesota
half
required
session
july
illinois
agreed
price
decided
getting
information
try
mark
different
seeking
source
banning
april
best
cannot
disease
begin
parent
massacre
rather
sell
small
november
free
legislator
lethal
failed
possible
target
opposed
feel
late
representative
added
magazine
interest
thousand
wanted
fund
start
post
proposition
full
semiautomatic
run
became
largest
defendant
jr
strong
stay
name
dead
wont
wrong
atlanta
live
adult
beach
argued
son
died
decide
college
turn
injection
francisco
morris
saturday
dozen
market
interview
philip
brown
seven
initiative
conviction
reported
provide
researcher
great
allowing
average
rejected
provision
smith
message
chance
fear
thought
needed
kid
rise
example
wife
accused
key
latest
offer
battle
sense
large
goal
opposition
body
tell
nicotine
paul
request
per
close
coal
read
natural
tried
committed
theyre
ownership
carolina
isnt
buyer
story
manufacturer
pennsylvania
lung
medical
spent
oil
fall
morning
sea
working
certain
common
sent
politician
potential
war
relationship
dc
leading
special
degree
always
serious
soon
commission
amount
economic
document
religious
he
belief
growing
seen
atmosphere
armed
chairman
sure
behind
received
higher
near
environment
meet
finding
maker
congressional
father
longer
bring
role
together
vice
ask
j
raise
professor
push
hear
richard
significant
project
anything
lost
hundred
witness
assembly
william
heart
coming
economy
old
eight
access
movement
ill
capitol
carrying
answer
violent
secretary
politics
unconstitutional
equality
town
century
pollution
sold
bad
dangerous
brought
third
speech
sheriff
lower
campus
probably
hard
gave
race
ammunition
attention
hill
simply
scott
clean
damage
technology
editor
weather
food
course
either
room
especially
responsible
annual
subject
showed
refused
light
love
supported
article
heat
increased
agree
scientific
medium
freedom
seems
military
considered
institute
banned
wedding
chamber
summer
m
form
hall
survey
rising
yes
thomas
personal
turned
front
denied
demand
treaty
recognize
heard
ice
calling
gop
actually
victory
advertising
nine
bureau
pack
caused
budget
short
safe
philadelphia
pistol
available
share
mentally
coalition
worker
gore
vehicle
connecticut
martin
bloomberg
buying
electric
included
joined
antismoking
parole
minute
newtown
testimony
floor
block
involved
obamas
focus
jan
chicago
requiring
dr
nationwide
spring
liberal
teacher
requires
powerful
approach
cigar
single
approval
reduction
changed
following
hospital
daughter
quit
kyoto
editorial
danger
particularly
teenager
book
reducing
charles
difficult
allows
oppose
grant
possession
parkland
chair
insurance
passage
bullet
denver
alcohol
terrorist
perhaps
paper
solution
test
started
choice
china
property
everyone
moment
fbi
fossil
offered
difference
ocean
illness
rally
dollar
team
doubt
opportunity
sought
education
rest
speaker
equal
create
pressure
quickly
declined
struck
january
deadly
ceremony
husband
activity
save
introduced
innocent
commissioner
december
win
firm
davis
tragedy
boy
agenda
mind
elected
lawabiding
columbia
series
published
convention
true
helped
ordered
requirement
w
warning
homicide
feb
licensed
return
raised
shop
planet
model
discussion
release
includes
beyond
reached
figure
staff
count
weve
concerned
regulate
factor
looking
site
pm
designed
running
investigation
version
asking
bob
produce
dec
author
noted
range
plea
fla
arrested
resource
type
protest
suspect
sandy
present
understand
defend
oklahoma
prevention
existing
happened
mile
la
epa
due
practice
aimed
island
sept
commitment
necessary
reporter
watch
worked
total
heterosexual
development
trade
senior
v
robbery
bay
joe
reach
l
slaying
youre
petition
trend
customer
written
road
effective
felon
argue
brother
leave
stock
gunman
sponsor
minor
selling
land
douglas
wake
los
giving
forward
value
tom
associated
drive
palm
immediately
appeared
institution
unusual
population
oct
date
urged
affect
ive
youth
greater
intended
considering
impose
murderer
journal
clerk
verdict
consequence
reasonable
play
biggest
voting
johnson
partnership
assistant
loophole
happen
declared
guy
else
wasnt
machine
stricter
responsibility
easy
selfdefense
statewide
highest
tampa
region
created
nov
teen
saw
purpose
account
e
voice
vermont
spending
jim
firstdegree
ability
homosexual
seem
hit
break
tough
conn
additional
join
resolution
round
secondhand
delay
stopped
separate
analysis
met
inside
video
club
veto
remains
appears
agent
page
elementary
hook
farmer
socalled
class
movie
jail
angeles
spoke
alone
television
follow
moved
spend
sex
spokeswoman
increasing
forest
add
door
avoid
girl
repeal
expect
sponsored
shift
minister
tougher
critic
certainly
carried
discrimination
previous
remain
living
upheld
williams
wouldnt
apply
foot
cuomo
leadership
curb
holding
talking
granted
weekend
ohio
arent
catholic
specific
compromise
unless
primary
recognition
application
deputy
southern
traditional
estimated
electricity
changing
clearly
central
east
writer
reform
doctor
usa
sentencing
controversial
statute
popular
consumer
compared
fee
sexual
cover
pending
gone
drought
field
strategy
followed
reynolds
continued
suggested
developing
february
donald
condition
fellow
shooter
note
whats
largely
facing
guard
loss
burning
language
apparently
arizona
fine
green
described
crowd
possibility
extreme
lobbyist
prisoner
beginning
announcement
fired
shotgun
planned
receive
package
lack
manager
fighting
prosecution
pushing
adopted
god
proponent
forced
training
lee
showing
poor
alternative
file
pleaded
knew
enacted
wait
everything
paid
simple
arrest
financial
space
hunting
condemned
judiciary
ended
foundation
broad
co
al
christian
piece
felony
twice
recognized
superior
finally
column
airport
main
inc
online
brand
eye
wounded
plaintiff
incident
mike
king
violation
cited
throughout
vega
mostly
bought
nature
bank
status
european
aug
huge
accept
opened
truth
moving
b
expand
addition
believed
sound
supporting
colleague
ryan
prove
lobbying
santa
suicide
experience
credit
promise
station
limited
related
felt
detail
option
seemed
mom
prohibit
atmospheric
funding
raising
starting
historic
overturned
focused
wisconsin
provided
appear
andrew
daily
sued
habit
seat
antigun
ready
brief
determine
harm
columbine
october
wind
standing
fair
estimate
generation
statistic
dropped
minority
revenue
whole
ahead
august
willing
backed
conducted
mandatory
stephen
marketing
worth
putting
respect
joseph
maybe
reality
tv
growth
moral
f
testified
lock
named
adding
speaking
passing
middle
previously
investigator
low
neither
barack
calif
bipartisan
kept
behalf
legalize
shoot
storm
defeat
trigger
influence
judicial
concluded
approve
produced
easier
prohibited
kennedy
currently
email
treatment
arguing
newspaper
reagan
afternoon
smokefree
c
advocacy
truck
production
discus
worst
expressed
definition
commit
fewer
orlando
militia
none
send
negotiation
speak
courtroom
facility
keeping
rev
strict
visit
sport
rape
relative
hurricane
conclusion
tree
increasingly
progress
september
entire
build
landmark
progun
situation
restrict
brooklyn
delegate
utility
arctic
game
involving
cold
serve
opposes
endorsed
bishop
decline
critical
safer
renewable
basis
liberty
openly
potentially
boston
abortion
otherwise
cap
utah
spouse
smoked
jones
choose
stoneman
particular
table
harris
protocol
nuclear
hurt
drop
device
driver
represents
sometimes
basic
mexico
driving
failure
warned
overall
hillary
obtain
rick
counsel
motion
walker
holder
upon
stage
recommendation
allen
retired
neighborhood
oregon
veteran
threatened
occurred
drew
suggest
deny
defender
behavior
meanwhile
couldnt
juvenile
gunrights
chris
exactly
generally
served
wayne
winter
elsewhere
shouldnt
conduct
image
sander
abuse
consensus
wilson
referendum
gathered
success
hawaii
northern
phase
worry
walk
sister
lose
becoming
culture
jurisdiction
leaving
foreign
jose
ensure
pushed
solar
track
computer
priority
ton
section
wave
japan
task
lake
methane
indeed
fully
injury
radio
stood
exchange
manhattan
wed
suggests
represent
operation
sort
marjory
un
unlikely
presented
straight
edward
enact
concealedcarry
miami
rose
supply
cop
patient
scene
promised
leaf
emotional
nonsmoker
wall
blame
except
criticism
link
contribution
season
regarding
eventually
caught
quite
claimed
adam
cent
setting
original
continues
reaction
canada
strongly
picture
violated
virtually
politically
easily
enforce
performed
client
comprehensive
pretty
opening
miller
longterm
specifically
predicted
pattern
shown
remark
guarantee
signature
blood
environmentalist
opposing
conversation
host
maine
h
imposed
urging
independent
wish
method
dispute
repeatedly
western
aide
richmond
linked
planning
various
protecting
division
advance
circumstance
neighbor
iowa
rural
card
determined
survivor
directly
ally
offering
faced
summit
red
procedure
instance
reduced
stronger
telling
dna
coast
highly
worse
criticized
meant
cruel
thinking
murdered
frank
limiting
base
aside
chemical
effectively
challenged
turning
provides
here
commercial
faith
prohibits
hasnt
ultimately
extend
fda
severe
gain
returned
reading
complaint
lapierre
coverage
immediate
flood
unit
combat
phone
gang
prepared
writing
seriously
challenging
contract
divided
anthony
owned
fourth
sue
strike
christie
alaska
prohibition
analyst
warrant
photo
ran
registration
industrial
vowed
loaded
stance
developed
paris
acknowledged
hotel
respond
ten
albany
litigation
promote
mary
worldwide
fell
daniel
cutting
ronald
montgomery
minimum
automatic
licensing
crisis
feeling
filing
instant
clemency
specie
looked
michigan
fundamental
affair
web
pain
rampage
peter
sweeping
successful
overturn
seller
connection
terrorism
correction
internet
publicly
pointed
apartment
aim
attempted
murdering
thus
direct
creating
admitted
racial
pastor
complete
adopt
whatever
duty
applied
bond
efficiency
affected
complex
supposed
exception
prominent
happens
intent
deathpenalty
providing
usually
evening
meaning
fatal
theater
eligible
larger
blue
aid
va
happening
steve
highcapacity
slow
universal
organizer
serving
workplace
atf
draw
explain
star
n
injured
causing
learned
helping
fort
prompted
kelly
warmer
mention
deep
spot
consideration
transportation
bump
topic
valley
appropriate
representing
cruz
shall
unanimously
urban
baby
surprise
registered
amid
mountain
outcome
bit
reelection
patrick
kansa
army
significantly
percentage
recommended
anywhere
refuse
issuing
lie
obtained
europe
purchased
ought
river
dramatic
taxpayer
retailer
roughly
alleged
heavy
regional
suspected
older
draft
network
possibly
acting
cell
endorsement
hot
improve
mandate
tie
remove
responded
widely
prospect
shortly
losing
offender
walked
placed
registry
quality
hunter
addictive
illegally
organized
principle
heavily
grand
bombing
applicant
bringing
trip
search
played
hampshire
fatally
defeated
id
us
becomes
emergency
brian
rare
remember
playing
audience
thompson
dismissed
closing
nominee
barred
established
pledge
closer
obvious
urge
prevented
folk
vast
regardless
closed
harder
kerry
