said
gun
would
state
new
marriage
court
states
one
people
death
law
bill
guns
years
last
gay
two
tobacco
us
samesex
could
federal
year
also
climate
president
ban
national
mr
house
change
control
first
laws
percent
public
time
weapons
smoking
rights
many
city
case
issue
right
penalty
county
even
global
say
amendment
may
senate
supreme
like
school
warming
week
police
couples
make
firearms
support
since
health
united
emissions
legal
judge
get
legislation
three
whether
vote
group
decision
including
says
washington
violence
florida
congress
take
attorney
shooting
day
man
made
dont
way
second
government
murder
background
officials
york
million
association
much
california
republican
use
life
american
rifle
carbon
tuesday
found
another
district
children
general
today
used
industry
country
monday
gov
wednesday
members
next
high
measure
campaign
without
political
want
debate
still
thursday
according
think
nra
nations
greenhouse
assault
ruling
told
going
among
companies
trial
crime
energy
part
obama
checks
ago
killed
report
month
back
well
convicted
bush
long
cigarette
carry
passed
called
justice
former
friday
administration
put
already
americans
every
groups
action
must
news
execution
defense
need
yesterday
days
republicans
cigarettes
office
appeals
civil
act
study
four
gas
university
lawmakers
power
white
go
committee
courts
clinton
policy
home
jury
world
democrats
department
recent
smoke
local
several
sales
john
know
might
allow
prison
capital
marriages
keep
voters
system
least
five
thats
virginia
good
help
show
cases
see
asked
constitutional
come
st
smokers
sen
others
less
plan
money
environmental
safety
research
legislature
family
san
number
sentence
center
never
owners
evidence
advocates
killing
set
benefits
work
believe
likely
scientists
leaders
handgun
lawyers
issues
woman
shot
concealed
around
far
past
democratic
effect
tax
mass
saying
council
become
months
times
took
guncontrol
across
stop
came
proposal
dioxide
end
major
prosecutors
unions
march
students
punishment
reduce
proposed
governor
little
majority
measures
gases
shows
yet
nearly
texas
criminal
company
business
six
expected
men
away
later
voted
place
question
director
enough
approved
constitution
weeks
citizens
billion
church
domestic
row
shootings
im
similar
left
georgia
handguns
increase
though
colorado
mayor
hearing
pass
conference
rep
trying
problem
nation
something
efforts
however
person
enforcement
making
attorneys
married
air
important
filed
give
buy
check
chief
allowed
appeal
women
executive
america
whose
program
restrictions
call
point
protect
earlier
effort
union
supporters
victims
fact
june
face
doesnt
wrote
period
human
north
stand
statement
big
drug
clear
lives
permit
circuit
young
didnt
meeting
countries
community
missouri
got
record
brady
protection
bills
order
firearm
night
move
require
began
board
weapon
lawsuit
cancer
scheduled
sentenced
almost
cause
taking
fight
maryland
illegal
announced
opponents
within
prevent
ruled
released
trump
nothing
force
arms
michael
hours
louis
early
history
permits
criminals
deal
instead
outside
changes
lead
dealers
private
anyone
able
held
charged
waiting
future
black
given
panel
spokesman
based
david
recently
legislative
agency
crimes
care
die
conservative
process
levels
james
using
cant
agreement
guilty
massachusetts
jersey
taken
marry
better
theres
look
rules
area
comes
signed
pay
cities
current
executed
social
find
cut
done
international
security
consider
although
kill
really
election
lawyer
mental
schools
real
plans
makes
often
society
charges
known
letter
include
led
judges
ever
science
r
along
lesbian
george
wants
reason
lobby
legally
officers
presidential
bear
party
matter
thing
south
toward
robert
hands
went
continue
top
press
despite
lot
data
final
rifles
issued
someone
required
west
half
july
agreed
plants
illinois
votes
decided
sign
getting
step
seek
sunday
information
cost
position
different
opinion
seeking
sale
employees
banning
age
best
fire
cannot
head
april
settlement
licenses
rather
review
deaths
small
regulations
officer
residents
idea
areas
inmates
address
free
lethal
let
things
failed
possible
opposed
late
result
ballot
added
member
wanted
costs
full
bans
open
water
largest
became
executions
means
strong
products
dead
families
wont
proposition
november
live
justices
decades
argued
response
leader
decide
died
francisco
wrong
senator
challenge
level
seven
philip
organization
reported
records
semiautomatic
questions
purchases
provide
calls
kind
allowing
jr
great
temperatures
try
rejected
minnesota
morris
favor
risk
problems
needed
democrat
massacre
side
jurors
latest
accused
list
rate
sense
large
partners
opposition
average
hope
per
arguments
session
saturday
tried
natural
committed
atlanta
hold
theyre
ownership
stay
mother
nicotine
brown
isnt
legislators
coal
sell
attack
medical
spent
beach
paul
limit
governments
experts
thousands
line
key
certain
oil
sent
potential
close
start
morning
common
working
leading
ground
couple
always
serious
mark
soon
dc
impact
economic
religious
hes
injection
growing
rise
seen
armed
sure
behind
received
higher
store
near
rule
chairman
congressional
bring
longer
atmosphere
together
ask
vice
j
authorities
feel
poll
kids
richard
hear
significant
anything
smith
lost
license
example
parents
street
william
wife
post
coming
college
programs
argument
eight
access
car
threat
old
carrying
purchase
environment
suit
violent
politics
activists
unconstitutional
bad
sold
pollution
dangerous
equality
brought
proposals
push
probably
hard
gave
special
third
ammunition
pennsylvania
places
attention
simply
interview
ill
candidates
lower
carolina
secretary
assembly
commission
disease
capitol
run
politicians
clean
role
either
responsible
especially
annual
weather
showed
attempt
refused
supported
read
increased
battle
agree
thought
begin
citys
scientific
ordinance
individual
seems
son
tell
message
considered
researchers
banned
ms
turn
war
meet
market
partner
rising
yes
lawsuits
bars
personal
buyers
lung
media
turned
service
denied
heat
worlds
earth
thomas
park
recognize
sea
professor
heard
ice
calling
standards
sides
senators
bar
effects
movement
talk
californias
actually
nine
advertising
course
military
manufacturers
building
chance
food
economy
institute
caused
love
scott
claim
needs
heart
killer
available
fear
mentally
front
friends
gays
short
body
buying
view
bloomberg
child
included
joined
taxes
antismoking
safe
electric
regulation
subject
newtown
ways
sentences
request
hundreds
obamas
involved
jan
testimony
treaty
gop
policies
bureau
cars
limits
restaurants
requiring
dr
nationwide
century
light
claims
requires
powerful
offer
fuels
studies
story
speech
fall
coalition
initiative
changed
official
philadelphia
event
raise
words
father
budget
article
ads
following
martin
individuals
quit
particularly
editor
summer
answer
kyoto
connecticut
freedom
approval
difficult
single
reducing
job
charles
parole
allows
floor
oppose
authority
insurance
candidate
parkland
alcohol
possession
perhaps
started
chicago
adults
floridas
everyone
goes
name
interest
student
town
offered
editorial
price
term
fossil
sought
race
create
quickly
survey
education
passage
declined
hill
struck
hall
steps
decisions
gore
deadly
amount
events
focus
decade
introduced
concerns
makers
january
comment
temperature
fuel
fund
elected
lawabiding
mean
millions
series
published
conviction
goal
actions
streets
helped
ones
true
magazines
ordered
equal
murders
w
feb
licensed
block
rest
raised
reports
room
davis
save
victory
beyond
includes
reached
concerned
december
weve
regulate
property
looking
approach
pm
running
designed
denver
asking
documents
takes
pressure
views
agenda
dec
chair
noted
sources
ad
fla
arrested
degrees
staff
bob
inmate
sandy
understand
defend
columbia
owner
innocent
happened
existing
charge
convention
dozen
governors
aimed
share
rates
project
sept
target
demand
counties
businesses
necessary
form
worked
drugs
joe
china
prevention
due
youre
dollars
representatives
written
effective
organizations
argue
l
leave
workers
minutes
fbi
selling
los
trade
giving
forward
wake
associated
stores
appeared
unusual
immediately
husband
oct
oklahoma
bay
urged
defendants
total
watch
ive
greater
impose
intended
considering
palm
reasonable
pack
biggest
voting
douglas
team
happen
numbers
else
declared
wasnt
stricter
easy
selfdefense
highest
technology
statewide
polls
created
nov
tom
concern
win
saw
assistant
spending
jim
firstdegree
prosecutor
campus
amendments
seem
services
supports
conn
results
hand
tough
additional
release
buildings
signs
secondhand
stopped
met
provision
doubt
e
ability
inside
agencies
remains
appears
conservatives
present
controls
separate
elementary
plant
journal
socalled
rally
tampa
senior
spoke
alone
angeles
follow
moved
spend
liberal
planet
attacks
hook
increasing
avoid
sponsored
expect
spokeswoman
chamber
robbery
lesbians
television
tougher
version
miles
reach
certainly
grant
carried
previous
discrimination
talks
moment
sheriffs
remain
homes
living
relationship
upheld
repeal
communities
apply
opportunity
speaker
wouldnt
vermont
daughter
killings
cuomo
sex
reasons
talking
granted
arent
veto
johnson
gunman
analysis
unless
southern
drive
traditional
choice
estimated
recognition
leadership
teenagers
changing
east
clearly
electricity
sentencing
central
consequences
believes
controversial
williams
epa
challenges
date
population
investigation
popular
island
compared
range
development
sexual
pending
gone
restaurant
jail
followed
centers
resources
land
continued
suggested
hospital
heterosexual
hit
developing
donald
reynolds
produce
february
presidents
mind
americas
whats
facing
largely
verdict
road
fellow
apparently
tragedy
described
burning
compromise
fired
planned
terms
jobs
ohio
resolution
return
receive
test
fighting
beginning
join
customers
faces
language
pushing
product
video
critics
adopted
wedding
forced
usa
teachers
commitment
green
training
play
pleaded
knew
pistol
enacted
paid
everything
victim
parts
financial
showing
condemned
simple
hunting
ended
broad
comments
primary
word
weekend
twice
finding
recognized
finally
poor
lee
judiciary
al
affect
superior
online
wounded
causes
main
lines
wait
cited
specific
ocean
throughout
lets
v
gets
mostly
bought
possibility
witnesses
huge
aug
status
spring
vegas
accept
opened
arizona
moving
expand
mike
believed
ryan
supporting
prove
todays
lobbying
inc
districts
works
farmers
difference
nras
trend
limited
seemed
prohibit
related
atmospheric
funding
felons
site
starting
damage
raising
historic
overturned
santa
focused
addition
announcement
felt
petition
appear
provided
daily
sued
holding
nature
antigun
determine
discussion
standard
ready
crowd
curb
source
facts
column
dropped
standing
whole
las
columbine
administrations
ahead
b
practice
willing
youth
backed
earths
mandatory
october
truth
conducted
worth
representative
august
putting
maybe
reporters
marketing
testified
speaking
previously
shift
adding
points
passing
named
barack
targets
firm
middle
fair
neither
defendant
kept
bipartisan
responsibility
calif
growth
gives
behalf
legalize
paper
delay
plea
package
catholic
judicial
feet
produced
easier
extreme
joseph
concluded
approve
prohibited
f
institution
elections
vehicles
currently
moral
arguing
smokefree
advocacy
bushs
lack
provisions
worst
break
expressed
fewer
commit
warning
c
foundation
class
speak
send
none
friend
felony
cigar
findings
keeping
sponsor
strict
tv
afternoon
writer
proponents
space
increasingly
mayors
rev
production
bullets
author
loophole
entire
prices
king
progun
low
september
co
restrict
orlando
slaying
progress
involving
manager
serve
european
trigger
wisconsin
cover
opposes
witness
brother
cold
defeat
protest
file
endorsed
critical
safer
renewable
basis
openly
influence
potentially
page
discuss
add
stephen
illness
prosecution
brooklyn
landmark
otherwise
legislatures
club
smoked
choose
arctic
minors
stoneman
voice
nuclear
experience
commissioner
reduction
reality
represents
sometimes
warned
reform
driving
treatment
particular
risks
harm
negotiations
obtain
purpose
statistics
colleagues
hillary
upon
jones
relationships
retired
dozens
kennedy
overall
churches
occurred
threatened
suggest
deny
rick
couldnt
meanwhile
boston
harris
plaintiffs
gunrights
drew
generally
exactly
served
chris
machine
shouldnt
door
elsewhere
magazine
wayne
shoot
damages
deputy
respect
god
consensus
movie
increases
solution
definition
gathered
courtroom
northern
build
basic
advocate
strategy
penalties
terrorist
funds
lose
becoming
loss
suspect
leaving
account
foreign
pushed
jose
ensure
rape
forces
solar
brief
clintons
countrys
knows
agents
shop
statements
methane
counsel
arrest
phase
wind
danger
indeed
fully
stood
smoker
suggests
oregon
hopes
represent
marjory
activity
alternative
unlikely
presented
counts
ceremony
wed
enact
concealedcarry
region
airport
investigators
homosexual
fine
allen
christian
piece
promised
manhattan
emotional
dealer
radio
except
andrew
conduct
field
eventually
regarding
caught
failure
quite
claimed
abuse
protocol
delegates
culture
straight
mexico
revenue
sanders
hurt
original
mothers
strongly
task
details
figure
continues
minority
violated
cuts
miami
politically
easily
reagan
enforce
virtually
performed
protections
benefit
pretty
comprehensive
books
killers
murderer
longterm
specifically
interests
predicted
shown
behavior
h
imposed
opposing
opening
japan
drop
urging
utah
repeatedly
un
decline
campaigns
cents
linked
various
planning
partnership
protecting
blood
girl
scientist
visit
habit
western
book
abortion
determined
rural
referendum
letters
directly
rose
hour
doctors
statute
faced
success
convictions
richmond
parks
factors
stronger
reduced
walk
requirements
shooter
dna
telling
meant
worse
highly
criticized
cruel
thinking
red
murdered
limiting
blame
arm
effectively
aside
names
stage
dangers
models
turning
challenged
summit
provides
prohibits
guy
heres
hearings
hasnt
parties
ultimately
extend
severe
iowa
departments
returned
wilson
lapierre
setting
hawaii
immediate
vehicle
criticism
coverage
combat
associations
homicides
prepared
miller
militia
seriously
maine
computer
challenging
stocks
divided
offering
walker
activist
owned
fourth
tons
ran
industrial
vowed
adult
loaded
developed
acknowledged
boy
paris
respond
exchange
reductions
promote
anthony
litigation
suicide
opponent
weddings
worldwide
cutting
fell
ronald
licensing
rulings
canada
minimum
grounds
clerk
instant
species
looked
clemency
teens
table
sue
web
environmentalists
successful
prisoners
terrorism
internet
type
sweeping
automatic
sheriff
montgomery
frank
publicly
pointed
attempted
murdering
creating
thus
direct
admitted
fundamental
guard
racial
albany
adopt
whatever
situation
complete
citizen
applied
homicide
sound
terrorists
prominent
happens
supposed
affected
deathpenalty
usually
generation
providing
eligible
fatal
larger
newspaper
faith
relatives
steve
remarks
note
registration
highcapacity
slow
serving
goals
va
solutions
universal
nonsmokers
motion
explain
circumstances
seat
overturn
injured
sort
helping
threats
coast
causing
intent
types
learned
prompted
warmer
deep
happening
transportation
requirement
persons
values
n
base
lake
representing
cruz
worry
attempts
appropriate
shall
registered
meaning
systems
amid
unanimously
phone
fort
urban
michigan
cigars
winter
complex
season
model
kansas
mrs
fda
efficiency
anywhere
drought
significantly
recommended
evening
blue
issuing
alaska
peoples
obtained
minister
sports
reaction
mary
ought
houses
reelection
host
purchased
bump
heads
dramatic
offices
station
ceremonies
roughly
writing
activities
rampage
alleged
crisis
regional
older
heavy
suspected
countys
pain
ordinances
consumers
stands
degree
locks
acting
possibly
improve
hot
rounds
patients
credit
bit
applications
percentage
independent
widely
losing
shortly
responded
factor
walked
section
placed
daniel
stance
addictive
illegally
organized
value
heavily
valley
division
patrick
grand
pistols
reading
conditions
kelly
bringing
played
fatally
defeated
becomes
brian
humans
playing
promise
barred
surprise
email
dismissed
remember
rare
obvious
campuses
closer
established
prevented
apartment
estimates
regardless
vast
trees
kerry
expanded
closed
harder
violate
uses
employee
link
angry
dan
bullet
aggressive
heattrapping
draft
younger
housing
boys
overwhelming
sensible
expensive
citing
closing
europe
warm
bank
initiatives
figures
illnesses
rj
document
connection
positions
treated
indicated
define
devices
allies
consideration
intense
christie
id
atf
corporate
eliminate
romney
forests
mention
relatively
schumer
modern
lobbyist
springs
develop
army
scene
gary
track
chambers
neighborhood
mom
advance
game
seeks
identified
acts
striking
brands
violates
eyes
larry
cap
quality
orders
protected
cash
firing
sister
projects
eric
unfortunately
round
hampshire
fee
violation
militarystyle
thanks
worried
tim
headed
forest
suffered
backing
stock
virginias
register
questioned
prohibition
corrections
howard
encourage
g
legitimate
arkansas
stolen
incident
emergency
absolutely
commissioners
jay
count
wall
conversation
downtown
momentum
jackson
filing
shops
unmarried
lived
billions
conclusion
unit
trumps
allegedly
sellers
havent
folks
spread
happy
remove
commerce
longtime
expert
pulled
cast
remained
nonprofit
broader
hoped
multiple
giffords
orientation
seeing
represented
proof
liability
hoping
theyve
learn
leaves
murphy
wish
clerks
shotguns
broke
therefore
papers
watched
halt
matters
peace
stated
duty
survivors
pledged
pursue
facilities
write
dispute
blocked
theater
british
accepted
technologies
timothy
affairs
mississippi
deciding
terry
bond
ar15
audience
industrys
generals
joint
massive
henry
attended
consumption
walking
fate
dean
jerry
instance
baltimore
dennis
normal
suits
smokingrelated
dealing
facebook
registry
retarded
teen
grow
impossible
sat
supply
fast
academy
yorks
companys
methodist
endorsement
false
p
removed
commercial
appealed
hotel
telephone
teacher
closely
peter
outcome
unable
agriculture
renewed
thompson
contribute
prohibiting
league
posted
handful
denying
possess
legalizing
substantial
onto
overwhelmingly
sitting
built
prince
innocence
juvenile
fees
continuing
strike
religion
understanding
method
commonsense
fought
surface
industries
powers
utilities
blamed
ideas
internal
essentially
attend
traffic
puts
hate
kidnapping
wide
looks
deeply
restricting
colo
launched
tallahassee
permitted
defending
referring
claiming
aware
surprised
honor
williamson
suspects
greenhousegas
amounts
expanding
resident
protesters
conspiracy
9th
familiar
sets
finance
option
louisiana
draw
unlike
guys
valid
retailers
begins
paying
river
numerous
gang
blacks
india
image
organizers
forum
van
ministers
favored
quick
nevada
teenage
melting
atlantic
picture
executives
notice
twothirds
gathering
suing
plus
network
spouses
marlboro
juries
priority
double
crucial
appointed
antitobacco
gain
active
twitter
reporting
contributions
yorkers
shotgun
preventing
travel
susan
split
broken
kentucky
nichols
vulnerable
modest
offers
trip
covered
maker
barring
meetings
accord
de
impacts
sarah
pat
kevin
regular
search
warrant
owens
offenders
application
sick
settled
collins
tech
fulton
partnerships
income
addiction
storms
announce
welcome
mccain
unprecedented
controversy
moratorium
balance
bid
wonder
deserve
owning
deathrow
relations
entitled
thinks
diseases
alliance
nominee
widespread
testing
bombing
rain
direction
backers
regulating
entered
handle
murderers
applicants
trucks
edward
regulated
moderate
secret
avenue
unanimous
management
refuse
warnings
addressed
talked
hardly
metro
finds
nearby
photo
firms
attacked
aides
nationally
camel
gunrelated
shes
ken
barbara
lobbyists
truly
suburban
georgias
aurora
bishop
addressing
parking
reject
differences
jack
theory
contract
annually
neighbors
durham
recognizing
execute
flooding
smaller
marked
begun
polar
enter
obviously
immigration
opposite
filled
medicaid
legalized
sharply
wave
trouble
usual
recommendations
consumer
extra
box
award
anderson
gayrights
holders
mcveigh
coastal
nc
pope
combined
opinions
defender
constitutionality
joining
tighter
newly
condition
omalley
mountain
ending
stabbed
belief
ted
protests
treating
baker
watching
sharp
grew
waste
defined
clara
card
homosexuality
schwarzenegger
treat
options
star
drivers
cleared
urge
moore
vetoed
pick
misdemeanor
doma
industrialized
establish
indoor
contrast
burden
fears
sending
oceans
taxpayers
fail
database
werent
music
lewis
maintain
career
purchasers
authors
counter
emission
oped
pledge
merely
realize
survived
positive
identify
nixon
perry
surgeon
aftermath
veterans
hurricane
ny
failing
predict
steven
liberty
fairfax
ashcroft
cops
droughts
occur
binding
supporter
correct
falls
chose
hospitals
manmade
path
signing
film
delayed
imagine
giant
appellate
fox
dole
dallas
stories
colorados
biden
marylands
adam
loved
jefferson
hurricanes
hell
confirmed
margin
trafficking
coalfired
arnold
imposing
topic
capacity
repeated
trials
sporting
spot
fahrenheit
tied
regions
tuesdays
periods
farm
unclear
rubio
requests
temporary
highprofile
wearing
feinstein
override
storm
dramatically
importance
signatures
incidents
muhammad
girlfriend
achieve
suggesting
1990s
chances
nelson
turns
christopher
clergy
jurisdiction
struggle
rapidly
markets
fifth
eye
odds
kinds
winning
suffer
ultimate
headquarters
defended
dying
purchasing
consistent
advantage
perform
hunt
aim
locked
tests
brand
beat
gray
saved
delivered
actual
lots
leads
square
del
shared
declaring
violations
explosives
constitutions
pacific
corp
eastern
rhetoric
defining
prime
weight
please
mandate
proud
settle
subcommittee
truck
noting
arrived
missing
comply
solve
fix
harry
anniversary
operations
iii
forms
equally
judgment
meaningful
disagree
bodies
preliminary
wesson
cell
homosexuals
sons
sniper
gasoline
minor
variety
persuade
sciences
runs
applies
guarantee
brain
crack
entirely
amend
threejudge
enjoy
snow
boulder
negotiators
passes
rich
targeted
alive
cdc
everybody
reid
disappointed
convinced
madison
manufacture
injuries
pressing
completed
ambitious
grown
flow
baby
wildlife
pull
greatest
notes
surrounding
exercise
exposed
committees
rooms
alabama
packs
immunity
reverse
size
follows
strengthen
extended
medicine
encouraging
discussions
implications
liberals
jeff
users
accounts
african
cross
visitors
dakota
demanding
taylor
interested
slayings
liberties
heller
slightly
pollutants
harmful
californians
readers
exposure
rush
suffering
nomination
teenager
girls
faster
climatechange
machines
england
explained
unique
protects
employers
indiana
el
recorded
childrens
iraq
assessment
outlaw
voluntary
display
fresh
prepare
debated
proceedings
initially
missouris
procedures
outdoor
daughters
chiefs
gaymarriage
banks
patterns
everywhere
appearance
bernardino
smart
mall
maximum
baseball
pastor
restrictive
possessing
emerged
completely
threatening
seized
ignored
feeling
divorce
parent
promoting
originally
reversed
drawn
equivalent
revealed
contend
somebody
manner
pact
extremely
analysts
gotten
chemicals
typically
born
scalia
hunters
beating
guards
clients
introduce
recall
capandtrade
conservation
knowledge
demands
boost
flood
pleas
mission
surprising
pride
error
perfect
cultural
moms
carnage
prospective
courage
contrary
core
hammer
picked
insisted
discovered
fires
petersburg
fraud
character
properly
brothers
houston
bottom
prospect
submit
exist
morgan
deadline
graham
driver
conflict
trust
mentioned
website
tennessee
threw
nonsmoking
co2
advanced
panels
demonstrate
glaciers
moves
bishops
replace
cheap
divisive
expansion
fairness
courthouse
participate
notion
contentious
proper
chapter
bus
personally
narrow
deserves
successfully
testify
purposes
reflect
tonight
scrutiny
sites
exception
tens
discussed
refusing
veteran
outrage
radical
injury
initial
mccarthy
nobody
formal
breaking
referred
animals
acted
associate
federally
prior
complaint
robinson
prisons
formed
researcher
oceanic
physical
recommend
speed
bears
defines
healthy
surely
handed
jurisdictions
enforcing
retail
bible
confessed
sponsors
generate
announcing
thank
rarely
desk
border
prisoner
regulatory
nj
bigger
tragic
cool
spare
operation
violating
owns
agent
nancy
selection
chuck
fathers
minneapolis
liggett
ignore
intergovernmental
presence
resolve
roberts
ends
afraid
formally
ties
tend
whos
driven
unfair
towns
payments
assassination
sevenday
apparent
voter
auto
terror
blow
concept
directed
la
promises
hillsborough
straw
holder
tears
pace
administrator
partly
favors
divide
desire
alan
requested
recommendation
delaware
receiving
client
moussaoui
marrying
nasa
shut
ed
preparing
memo
primarily
anybody
beliefs
choices
holds
practices
recover
ongoing
defenders
marshall
races
listen
hills
awaiting
secure
horrific
custody
slain
argues
sacramento
senates
mainly
knowing
participants
interstate
workplace
doctor
lies
epidemic
reporter
guilt
raises
resulted
cheney
portion
broadcast
aid
proved
pronounced
voices
churchs
rapid
ozone
village
embrace
wednesdays
constituents
lawmaker
shots
suddenly
forcing
construction
pattern
complicated
partisan
agencys
marks
flawed
threeday
healthcare
frequently
founded
statutes
raped
credits
detailed
adviser
ford
cooling
craig
debates
tomorrow
pipeline
window
ron
exists
messages
worker
bronx
17yearold
zimmerman
tiny
sens
sun
pew
interviews
loopholes
declare
compelling
bruce
pair
native
sit
anger
theyll
granting
membership
jewish
baptist
spouse
female
reinstated
contributed
remaining
confident
efficient
ii
exempt
estimate
players
investors
spared
pounds
acknowledge
universities
afford
negative
midnight
episcopal
correctional
warmest
examine
investment
kenneth
attitudes
dick
grants
manufacturer
movies
unveiled
permission
floridians
drawing
fairly
lastminute
narrowly
tragedies
assaultstyle
convince
jennifer
flight
weak
labor
harvard
gunned
anticrime
feared
ross
praised
posts
profits
ranks
municipal
swing
quarter
stayed
feels
institutions
cleaner
facility
considers
francis
queens
endorse
convenience
reviewing
clark
shooters
sparked
proceed
tony
pleased
sierra
fill
stations
resulting
guarantees
crop
rob
guess
invited
hollywood
officially
reconsider
warner
martinez
tradition
dekalb
cobb
1980s
utility
miss
attempting
practical
rhode
stalled
costly
collect
extending
memorial
terrible
clips
era
escape
evil
minds
ages
toll
preserve
complaints
procedure
toughest
lt
cop
republicancontrolled
enormous
responses
attending
complained
manufacturing
garden
jeffrey
anyway
lowest
hired
lay
suspended
jerseys
orange
identification
executing
waves
gained
apart
signal
kick
partys
indicate
viewed
deliver
resume
serial
oral
commonwealth
hb
adams
nightclub
heston
toomey
mistake
corporations
chemical
platform
relief
conclusions
rock
contends
string
fiveday
controlled
shopping
regularly
sixth
personnel
minute
doors
sessions
enforced
celebrate
thoughts
uphold
honest
jurys
stabbing
everytown
arming
rjr
generated
lawrence
questioning
founder
guidelines
answers
listed
dcalif
recovered
tool
returns
sees
raleigh
clubs
shares
outofstate
moments
offense
warren
slaughter
concealedweapons
contributing
projected
globe
congressman
idaho
pool
signature
montana
diego
extent
mondays
australia
cook
sad
pinellas
sorry
petitions
committing
operating
stringent
seattle
features
engaged
disaster
shifting
contended
stake
necessarily
creates
asks
extensive
helps
campbell
punitive
cnn
kills
male
experienced
cycle
floods
denial
funded
train
resistance
drinking
fred
pages
branch
ray
basically
councilman
submitted
christmas
mo
smokeless
disabled
threaten
northeast
russia
scale
promising
interesting
highway
contains
opportunities
responding
shifted
images
mitt
mcauliffe
reviewed
motivated
franklin
discourage
camden
juror
knife
spree
weekly
incentives
sounds
rely
collected
devastating
screen
wild
mix
oakland
silence
embraced
text
roll
principle
learning
charleston
speakers
dinner
gender
chiles
lawful
gunfire
felon
hailed
ten
barely
falling
equipment
inspired
describe
packed
fields
indian
polling
objections
uncertain
rival
lock
restraining
maintained
vows
stark
trends
germany
studying
mount
orleans
treasury
emails
reflects
threatens
ann
plenty
awareness
carter
deter
tells
justify
contained
principal
lists
civilian
acceptance
stopping
estate
heights
amended
indicted
eager
mainstream
chinese
curbing
match
fit
uncertainty
declining
proposing
lisa
foster
handling
youths
troubled
juveniles
pataki
soldiers
chest
edwards
welfare
tropical
ceo
adoption
airlines
express
analyst
letting
somewhat
georgians
mail
karen
unnecessary
georges
cox
buyer
lax
newsom
canadian
headline
seats
pa
donations
contact
designated
timing
victories
households
zone
professional
duke
flag
lifetime
clause
indictment
understood
controlling
seas
aids
universitys
hottest
advice
producers
transfer
priorities
obligation
earned
implement
strongest
destruction
temporarily
responsibilities
tactics
satellite
ok
authorized
focusing
detectives
procedural
q
logic
code
dianne
thrown
reaching
battles
brings
refusal
somehow
longstanding
nebraska
principles
blunt
games
drove
deemed
stevens
vs
keeps
silver
sb
breaks
stepped
restricted
malvo
studied
copenhagen
misleading
encouraged
combination
parade
lighting
destroy
gregory
plastic
corner
colleges
evangelical
availability
roy
lungs
relevant
horror
bridge
steady
adds
greg
acres
demanded
municipalities
moreover
carries
postdispatch
10th
windsor
workplaces
lawenforcement
assaultweapons
poised
faculty
essential
posed
nice
insist
shape
fallen
retreat
demonstrated
bernie
abolish
appropriations
tucson
womens
shield
evans
caucus
obtaining
classaction
md
abandoned
urgent
heating
1970s
chain
documentary
undermine
allegations
writes
strip
involves
design
austin
bloombergs
tree
feelings
identity
patches
unarmed
patrol
regulators
gulf
consistently
roof
qualify
survive
pose
crist
examined
totally
dave
matthew
accidental
zones
via
halls
ring
alexandria
reno
coleman
cocaine
generations
inevitable
africa
waters
explanation
inaction
decrease
propose
jumped
quietly
mexican
mitchell
holmes
suicides
whites
aggravated
burned
golden
expects
filibuster
technical
routine
marine
cards
involve
thursdays
urgency
exceptions
content
supervisors
stanley
outlawed
matt
marijuana
prosecuted
seconddegree
lgbt
tobaccorelated
offset
vending
tackle
caps
struggling
substance
fiscal
intention
hopeful
replaced
substantially
hundred
capable
pasco
definitely
teaching
forget
publicity
intend
goods
bias
unlicensed
barr
smokes
tide
fines
motor
plead
reportedly
trading
janet
context
dark
deliberations
quoted
involvement
elderly
reputation
spoken
mercy
kessler
catastrophic
hidden
surveys
tired
contribution
halted
typical
metal
severely
lie
tighten
throw
supervisor
giuliani
abujamal
ak47
predictions
managed
frequent
pressed
rational
communications
surge
jason
linda
ap
featured
gunshow
climatic
conventional
sight
remarkable
advertisements
strategies
blocking
declaration
delta
feature
permanent
targeting
shame
chosen
neighbor
drafted
pastors
africanamerican
burglary
widow
legalization
reads
britain
gap
contest
serves
identical
accurate
aide
gum
restore
items
boards
permitting
abc
rallies
gubernatorial
manchin
transgender
oppositesex
skeptics
avoided
depending
commitments
delays
upper
stuff
classes
gather
soil
heated
youve
woods
wood
extraordinary
informed
performance
ranging
russian
admit
fans
enacting
eighth
ward
accidents
mouth
tape
uniform
cessation
traditionally
produces
vital
influential
heading
clayton
charlie
landscape
founding
busy
poverty
household
bound
camp
accepting
jonathan
waited
tex
chapel
bail
raping
discriminatory
abusers
infringed
berkeley
sector
historical
engage
saving
port
carefully
grassroots
ease
k
zero
deals
patrons
savings
regard
indicates
upset
silent
crazy
symbolic
volunteer
scores
fridays
punish
deputies
exemption
growers
enthusiasts
minnesotans
jon
presidency
rejecting
normally
gerald
springfield
sensitive
bright
speeches
editors
answered
net
pointing
pictures
intelligence
byrd
hair
backlash
wouldbe
reforms
sc
bomb
antigay
ridge
northwest
scenario
catch
device
doubts
yesterdays
todd
hole
missed
mans
farreaching
lobbied
blessing
interpretation
minnesotas
rating
olson
recalled
harrisburg
senseless
trap
hotter
france
capture
losses
sport
mixed
absence
supportive
dry
switch
gross
destroyed
sufficient
griffin
gabrielle
comfortable
neighborhoods
actor
corporation
guaranteed
quitting
wound
gilmore
4th
gunsafety
observed
shell
jeb
adopting
solely
emit
fly
privately
perspective
sam
littleton
precedent
hire
prayers
wounds
barnes
trayvon
risen
stem
inches
launch
gift
tour
awarded
governing
emotion
breathe
warn
favorite
applying
lengthy
antonin
russell
ordinary
quiet
trained
pregnant
roman
establishments
restriction
privileges
billboards
supplies
weigh
phil
denounced
attributed
negotiated
wars
outright
vocal
evolution
collective
frustration
concerning
newspapers
donors
appearing
tie
birth
dear
cohen
jesus
casey
butts
measured
asthma
resolved
gavin
resource
signaled
burn
trail
proven
dny
reference
color
producing
assistance
handled
competent
celebration
guests
parker
democracy
chewing
investigations
ratified
fails
nowhere
agreements
mitigating
aims
conclude
succeed
retirement
greatly
pittsburgh
confusion
reasoning
irresponsible
barry
stops
plain
sullivan
memory
sells
distribution
reprieve
undercover
webb
20th
islamic
fundraising
storage
participating
realized
hadnt
weaken
contain
conscience
lesson
denies
decides
expenses
teach
wore
tweeted
independence
art
hed
administrative
pro
theft
loving
freedoms
casino
revolution
disturbing
painful
achieved
schedule
prize
besides
famous
historically
alternatives
affects
comparison
alter
nevertheless
11th
liable
performing
assume
merits
lott
offenses
convict
bisexual
lorillard
agricultural
location
delegation
route
drilling
laid
stuck
ranges
map
advisory
kicked
enjoyed
visited
accident
hanging
lobbys
category
deadliest
patch
strength
showdown
prefer
cooper
indication
peterson
detective
nypd
tobaccofree
visiting
solid
qualified
tools
commentary
starts
depend
pentagon
affirmed
sustainable
intensity
investigate
mcconnell
doubled
spotlight
childhood
bitter
grade
injunction
ga
recognizes
ineffective
attitude
customer
disturbed
sisters
marion
privacy
gunfree
voterapproved
ecigarettes
celsius
pieces
upcoming
occurring
mine
willingness
agreeing
optimistic
fierce
object
justified
arlington
lift
profit
wildfires
seemingly
dismiss
ralph
investigating
addicted
traced
christians
horrible
wright
beaten
gunshot
globalwarming
monitoring
concludes
junior
inconvenient
anymore
useful
compliance
wisdom
french
toxic
wealthy
debating
array
journalists
headlines
listening
articles
advocating
gold
jesse
cameras
contracts
assemblyman
reed
nuptials
broward
botched
gunmakers
investments
laboratory
objected
relative
onethird
upholding
dream
loud
intervene
careful
marched
touch
weighing
educational
automatically
rolling
swift
disagreed
gallup
overturning
diaz
prosecute
glock
heinous
dependence
nobel
burns
thousand
emerging
advisers
approving
discussing
prospects
brutal
holiday
methods
london
centuries
marco
southeast
legislator
covering
missourians
overcome
nathan
surveyed
christ
lifted
prescription
jump
southwest
carolinas
aggressively
negotiating
prop
midwest
slowly
attached
acceptable
navy
clouds
guide
cry
dedicated
producer
airline
unrelated
traveled
separately
likelihood
edition
stick
lesser
injections
rabbi
lying
cbs
interracial
nonetheless
title
competitive
eve
sentiment
lifestyle
stress
considerable
scope
christine
employment
factories
grave
respondents
excuse
demonstration
voiced
washingtons
carol
quinn
attracted
arrests
vendors
aggravating
census
buildup
belt
stanford
eat
friendly
ridiculous
premature
anne
scheme
forever
fish
bradley
1960s
affecting
superintendent
singer
cooperation
yard
activism
tracks
discretion
wording
airports
demonstrations
ferguson
covers
doctrine
discount
robbed
backgroundcheck
reliable
rocky
potent
mere
confront
councils
visible
graduate
coloradans
dog
hearts
buried
outspoken
recreation
pension
blocks
selected
rejection
intends
photos
metropolitan
confidence
circulation
prompting
arthur
leaf
crowded
lifelong
doug
hunter
shocked
alexander
charlotte
gwinnett
deterrent
existence
reveal
depends
ninth
distributed
materials
cite
unexpected
poses
ore
carl
progressive
gordon
portrayed
oh
plane
reluctant
volunteers
offensive
print
corbett
luther
clarence
sheet
succeeded
gains
accidentally
automakers
skeptical
gods
devoted
ben
shifts
material
tone
walls
evolving
ethics
experiment
babies
inadequate
extends
turner
locations
accusing
plot
educators
simon
billboard
borders
passionate
sooner
epas
noaa
roads
debt
determining
kaine
football
attacking
21st
whenever
blasted
reserved
islands
improving
spots
reversal
smiths
somewhere
hudson
perfectly
seize
modified
theodore
unfairly
tested
undergo
electrocution
heterosexuals
bold
framework
biological
brazil
accompanied
similarly
struggled
sends
habits
exemptions
profound
financing
appealing
consultant
creation
jimmy
screening
plays
beings
writers
enemy
twin
fights
suggestion
imprisonment
bennett
ordering
hatch
ramsey
knives
reminder
phenomenon
consecutive
metric
polluters
economists
summers
roger
phrase
praise
commonly
explaining
topics
mounting
absolute
situations
suburbs
elizabeth
concert
neighboring
immigrants
keith
freed
dissent
casinos
renew
walter
conceded
planets
ignoring
negotiate
captured
electronic
dirty
tar
foes
vision
backs
rail
teams
stadium
briefly
dropping
forth
element
throat
super
warrants
deliberated
instructions
merit
funeral
cable
pretrial
lambda
reasonably
persuaded
anticipated
frustrated
emitted
disclose
diverse
differently
routinely
tries
lane
cells
animal
alike
accountable
passengers
coffee
carnahan
channel
alameda
noon
classroom
approximately
interviewed
detail
assigned
seventh
trace
empty
kitchen
presbyterian
incumbent
odonnell
lied
bench
sexually
grief
charlton
certainty
dire
rio
assertion
economies
confronted
contributes
updated
precisely
describes
foot
checked
random
establishing
stable
overseas
walmart
professors
coordinator
scenes
champion
aspects
attract
beer
bag
johns
nights
delivery
dominated
kim
approached
brooks
grove
bucks
youngsters
economics
labels
passenger
exxon
gores
implemented
explicitly
listened
hero
versions
setback
elements
festival
disputes
fraction
raymond
vietnam
prevents
legality
bed
pete
antonio
boyfriend
insanity
strangled
constitutionally
gangs
denomination
19yearold
accomplice
exonerated
massacres
windows
damaging
voluntarily
approaches
unusually
mandated
nicholas
farmer
highlighted
adequate
developments
logical
participated
lone
subsequent
mandates
twoyear
hazards
youll
classrooms
safely
invoked
ticket
revolver
bunch
bell
score
shock
rage
rallied
strictest
insane
repealed
15yearold
nosmoking
german
concrete
removing
scholars
determination
extension
alarming
revised
nino
competing
wyoming
politician
rid
wishes
titled
theyd
residential
literally
passion
stars
trenton
collection
spurred
celebrated
theme
lights
pennsylvanias
featuring
kid
seconds
myers
civilians
underage
altria
automobiles
sundays
ethanol
intervention
stripped
misconduct
ranked
disclosure
turnout
meets
operate
birds
legacy
examples
liquor
civic
band
notably
remote
disability
dad
confession
catholics
vincent
lautenberg
disappeared
wear
postal
escaped
sean
herring
racist
hansen
instances
projections
function
comfort
humanity
abroad
societys
lab
tremendous
reflected
powell
import
scare
preferred
physicians
stream
salt
observers
counting
graphic
garcia
interpreted
reinstate
jacksonville
militias
improved
output
dealt
crops
10year
blog
altered
confrontation
fundraiser
skepticism
stewart
sudden
tank
conversations
returning
freeman
sole
agrees
taught
packing
opens
outraged
eliminated
reminded
lunch
paterson
wins
integrity
winston
asserted
spirit
conducting
neck
lands
charging
implementation
welcomed
proliferation
reservations
stating
portland
administrators
glass
fisher
aspect
repeat
bearing
sharing
fe
labeled
annapolis
expire
creek
player
newark
clarify
punished
smell
chronic
