said
gun
state
would
year
law
new
people
one
death
court
bill
u
immigration
say
immigrant
last
federal
two
president
right
could
tobacco
time
also
house
mr
city
change
case
country
climate
american
national
weapon
united
control
school
week
many
group
county
day
percent
public
issue
make
illegal
first
ban
republican
penalty
official
firearm
smoking
police
government
even
million
attorney
shooting
like
senate
global
month
may
life
company
get
cigarette
nation
child
judge
since
warming
congress
florida
crime
take
three
way
emission
want
measure
check
legislation
rifle
washington
health
gas
legal
murder
support
member
including
show
policy
amendment
report
violence
association
york
made
work
program
today
administration
vote
industry
plan
criminal
come
department
whether
need
dont
background
second
study
use
part
much
district
home
number
handgun
family
found
appeal
without
execution
world
action
according
tuesday
justice
california
sale
center
nra
bush
supreme
go
lawyer
high
used
general
student
monday
back
office
decision
another
effort
democrat
carbon
system
service
thursday
political
wednesday
debate
problem
told
man
still
next
leader
among
worker
think
citizen
campaign
assault
help
clinton
going
woman
trial
proposal
white
called
know
border
convicted
obama
local
greenhouse
sentence
enforcement
put
permit
well
university
energy
jury
former
prison
long
gov
carry
ago
killed
business
yesterday
agency
trump
america
friday
place
record
power
owner
already
effect
area
every
call
news
officer
must
four
killing
act
committee
recent
five
tax
prosecutor
keep
several
passed
community
question
smoker
john
money
good
smoke
set
security
might
job
lawmaker
cost
least
see
sen
increase
scientist
advocate
others
authority
capital
virginia
level
drug
le
charge
governor
st
safety
came
face
thing
billion
rule
become
victim
shot
evidence
past
thats
give
hearing
never
research
texas
end
environmental
stop
across
around
asked
georgia
executive
allow
nearly
director
defense
far
lawsuit
mass
little
took
point
order
march
ruling
resident
fact
san
likely
major
person
concealed
away
saying
reduce
believe
six
later
punishment
force
guncontrol
enough
trying
decade
dioxide
yet
purchase
left
regulation
colorado
legislature
hour
mayor
rep
men
cause
attack
period
rate
car
statement
chief
council
plant
hand
senator
pay
street
cut
human
young
row
inmate
reason
democratic
limit
meeting
arm
conference
proposed
restriction
whose
claim
result
though
find
expected
buy
step
making
dealer
mean
however
temperature
international
air
deal
released
majority
im
organization
move
party
stand
letter
store
bar
something
let
sign
individual
look
similar
charged
side
night
board
held
north
thousand
agreement
got
line
pas
mother
mexico
product
big
agent
building
allowed
license
didnt
protection
care
undocumented
lead
spokesman
voter
announced
reform
candidate
earlier
missouri
require
risk
began
important
process
black
taking
almost
better
clear
protect
filed
approved
early
seek
sentenced
along
lot
hope
brady
doesnt
head
cancer
june
talk
instead
using
restaurant
argument
information
current
election
science
south
voted
often
idea
taken
anyone
concern
louis
future
status
visa
fuel
guilty
deportation
scheduled
recently
wrote
event
nothing
within
mexican
known
waiting
panel
kill
parent
supporter
history
college
document
outside
prevent
ad
michael
given
cant
lobby
threat
fight
done
bear
standard
ground
maryland
illegally
based
working
age
die
fire
private
george
water
there
able
fear
include
half
challenge
provision
james
real
seeking
address
park
population
economic
robert
expert
someone
data
although
went
matter
earth
top
small
stay
beach
free
name
executed
presidential
really
economy
continue
run
citizenship
term
open
list
signed
getting
response
mental
led
april
july
opponent
ever
alien
view
atlanta
circuit
social
friend
arrested
position
kind
war
conservative
society
review
food
comment
ice
start
hold
accused
failed
attempt
source
impact
large
david
target
required
benefit
despite
price
agreed
foreign
west
story
sunday
try
provide
different
reported
toward
seven
killer
possible
died
sent
settlement
near
legislative
representative
jersey
r
consider
legally
terrorist
disease
son
juror
largest
turn
employee
post
live
rather
market
best
word
conviction
hundred
interview
press
final
cannot
issued
dead
father
great
special
sell
congressional
average
ordinance
wanted
begin
arizona
church
dozen
defendant
sheriff
late
theyre
coming
serious
civil
saturday
poll
fund
chance
session
massacre
tried
ruled
added
medical
interest
adult
old
brought
kid
bring
example
feel
lethal
growing
naturalization
project
rise
request
received
per
secretary
refugee
morning
goal
semiautomatic
spent
degree
suit
researcher
wont
wife
meet
strong
opinion
activist
sense
higher
card
illinois
sea
key
education
magazine
injection
philip
body
morris
thought
hard
jr
access
message
decided
union
mark
certain
became
smith
behind
he
lost
latest
eight
close
increased
potential
armed
tell
constitutional
common
needed
amount
favor
jail
in
dangerous
seen
read
technology
finding
isnt
sure
sept
oil
commission
chairman
buyer
nicotine
wrong
violent
brown
bureau
town
offer
hispanic
application
military
fall
ownership
coal
natural
manufacturer
demand
carrying
lung
investigation
longer
living
always
committed
william
room
paul
argued
soon
politician
bad
full
minnesota
constitution
legislator
century
significant
especially
budget
rejected
attention
atmosphere
raise
third
role
speech
witness
environment
turned
article
maker
j
capitol
paper
editor
arrest
hill
answer
leading
responsible
sold
form
course
anything
richard
clean
light
ill
gave
domestic
return
carolina
probably
fbi
summer
gop
push
damage
safe
green
opposed
approach
vehicle
politics
subject
heart
heat
institute
front
ask
either
annual
pennsylvania
pollution
professor
showed
china
vice
philadelphia
obamas
calling
jan
los
weather
medium
caused
ammunition
nine
estimated
island
rising
opportunity
scott
campus
actually
teacher
dc
seems
solution
mile
lower
suspect
agree
grant
scientific
available
allowing
treaty
involved
driver
included
race
employer
requires
thomas
simply
central
apply
hear
november
minute
initiative
considered
denver
release
share
denied
nationwide
opposition
trade
focus
survey
ordered
difficult
hospital
boy
dollar
chicago
parole
requirement
guard
started
refused
battle
m
worked
pack
resource
chamber
activity
helped
gore
decide
heard
danger
test
leave
requiring
mentally
pistol
sought
language
editorial
buying
teenager
together
coalition
labor
angeles
create
rally
yes
supported
particularly
allows
electric
spring
figure
advertising
commissioner
newtown
floor
possession
antismoking
reduction
block
brother
la
charles
belief
team
road
region
book
condition
minor
series
pressure
testimony
reducing
dr
looking
tough
joined
land
miami
daughter
quit
movement
powerful
designed
january
class
save
palm
cigar
banning
following
speaker
offered
site
total
count
true
understand
version
airport
present
husband
kyoto
perhaps
reached
practice
aimed
deadly
fee
banned
hall
december
patrol
running
martin
includes
ocean
changed
relative
tragedy
alcohol
firm
quickly
freedom
assembly
protest
shop
chair
parkland
bullet
innocent
drive
donald
remain
dec
staff
published
rest
single
short
lawabiding
assistant
warning
reach
illness
introduced
bloomberg
english
asylum
southern
produce
francisco
beyond
concerned
senior
declined
fossil
difference
plea
everyone
operation
w
east
existing
due
model
critic
development
weve
reporter
created
fla
violation
homicide
raised
bay
personal
granted
farmer
oct
davis
choice
fine
homeland
feb
range
watch
youth
tom
account
effective
spokeswoman
deputy
door
latino
type
felon
factor
customer
paid
bipartisan
licensed
robbery
selling
approval
met
spending
gang
field
planet
inside
mind
bob
regulate
pm
asking
doubt
comprehensive
property
hit
saw
easy
necessary
noted
win
additional
discussion
author
elected
moved
greater
unusual
prevention
poor
happened
reasonable
passage
alone
avoid
stopped
foot
date
usa
intended
girl
trend
youre
epa
stock
sponsor
compromise
stricter
giving
delay
training
agenda
biggest
felony
loophole
machine
immediately
growth
slaying
play
estimate
analysis
custom
increasing
lack
couple
tougher
johnson
break
sandy
facing
liberal
pleaded
wait
gunman
teen
wall
l
joe
appeared
send
connecticut
journal
previous
forced
mostly
moment
forward
spend
ability
impose
seem
temporary
douglas
written
guy
affect
elementary
murderer
responsibility
socalled
wake
bank
associated
continued
verdict
spoke
doctor
facility
controversial
consequence
ive
considering
victory
jose
pending
round
club
add
selfdefense
firstdegree
happen
wasnt
voice
petition
movie
permanent
e
gone
expect
nov
curb
visit
specific
compared
else
detention
investigator
promise
holding
carried
unless
conn
page
join
truck
argue
el
talking
secondhand
middle
station
urged
arent
cuban
tampa
experience
speak
applicant
appears
hook
coast
receive
largely
prove
remains
columbia
described
shift
television
jim
sponsored
prisoner
fired
judiciary
leadership
aid
sentencing
incident
neighborhood
extreme
package
primary
forest
planned
main
strategy
funding
build
convention
consumer
european
willing
manager
dropped
brooklyn
video
williams
driving
detail
space
finally
apparently
oklahoma
prosecution
beginning
situation
fellow
addition
writer
wilson
king
twice
suggested
kept
wouldnt
purpose
insurance
knew
inc
enforce
electricity
note
everything
followed
developing
deported
crowd
february
cover
easier
al
low
believed
broad
follow
ended
determine
voting
drought
clearly
separate
moving
loss
reagan
amnesty
huge
financial
eligible
weekend
unconstitutional
daily
popular
credit
piece
provided
abuse
aug
opened
showing
lee
certainly
terrorism
caught
shooter
wave
sometimes
oppose
expand
suspected
statistic
reynolds
speaking
vega
fewer
foundation
file
shotgun
october
northern
hunting
path
changing
serve
leaving
declared
worst
lobbyist
priority
fighting
bought
veto
adopted
sound
possibility
accept
eye
appear
burning
computer
repeal
throughout
santa
whats
co
fair
native
condemned
simple
obtain
focused
reality
maybe
generation
love
suicide
mandatory
treatment
enacted
truth
pushing
failure
brand
wounded
value
whole
returned
cited
barack
september
statewide
farm
related
seat
alternative
negotiation
limited
worth
commit
track
keeping
v
chinese
previously
produced
email
online
increasingly
wind
served
column
highest
cap
ryan
none
sister
drop
putting
august
enter
testified
minority
upheld
arrived
mom
client
ballot
adding
rape
entire
named
otherwise
critical
starting
habit
newspaper
production
atmospheric
lose
decline
commitment
currently
game
ahead
felt
mike
seemed
calif
defend
lived
discus
haitian
tree
promised
harm
f
antigun
afternoon
threatened
nature
option
strict
announcement
lock
overall
ready
columbine
procedure
trigger
progress
expressed
passing
joseph
colleague
hurricane
storm
manhattan
radio
advocacy
supply
conducted
struck
lobbying
behalf
apartment
tv
shoot
complaint
travel
massachusetts
born
section
kennedy
marketing
revenue
safer
valley
concluded
neither
recommendation
militia
occurred
statute
influence
neighbor
cold
raising
smokefree
c
ten
table
device
eventually
b
orlando
particular
hillary
involving
task
becoming
backed
utility
warned
hurt
ensure
upon
couldnt
juvenile
admitted
walk
criticism
crisis
restrict
success
injury
culture
applied
false
learn
generally
warrant
cruz
sport
resolution
hire
alleged
highly
exchange
potentially
progun
search
base
patient
renewable
arctic
blame
liberty
worry
migrant
basic
represent
ohio
conduct
entered
meanwhile
various
standing
housing
army
holder
custody
canada
courtroom
cop
nuclear
winter
flight
id
retired
represents
deny
welfare
picture
scene
except
miller
pattern
worse
suggest
pushed
stephen
edward
superior
phase
suggests
aide
stoneman
protocol
lake
flood
ran
un
de
helping
conclusion
smoked
image
taxpayer
japan
dream
determined
easily
season
drew
gain
jones
repeatedly
link
prohibit
rick
trip
claimed
sander
gunrights
rose
queen
emergency
western
organizer
veteran
rural
bus
bond
complex
fully
hotel
behavior
circumstance
phone
offense
improve
continues
shouldnt
fox
reduced
linked
method
baby
criticized
opening
provides
setting
prohibited
enact
wayne
basis
solar
learned
contribution
division
europe
original
indeed
arguing
politically
regarding
proponent
faced
ton
network
red
presented
sued
supporting
methane
ally
andrew
harris
respect
severe
sweeping
leaf
exactly
sort
dispute
racial
defender
jurisdiction
cuba
marjory
india
combat
commercial
providing
virtually
meant
registration
consensus
allen
identified
concealedcarry
gathered
telling
flow
nonsmoker
instance
minimum
host
pretty
imposed
boston
cruel
remark
cent
counsel
summit
religious
motion
stood
connection
immediate
unit
survivor
automatic
cutting
supposed
complete
shown
protecting
secure
endorsed
quite
fraud
cuomo
mountain
montgomery
overturned
turning
visitor
urban
seriously
prepared
catholic
blood
environmentalist
allegedly
affair
unlikely
placed
attempted
transportation
specifically
h
tie
traffic
construction
developed
proceeding
detained
murdered
larger
stronger
longterm
stage
bringing
independent
serving
cash
bombing
amid
reading
photo
chemical
moral
contract
fort
looked
planning
directly
dna
loaded
correction
predicted
broken
industrial
fell
cross
database
wisconsin
affected
analyst
owned
crack
wish
wage
usually
plaintiff
van
chris
reaction
strongly
relationship
kelly
schumer
aside
spot
obtained
slow
nonprofit
offering
respond
passenger
adam
injured
hasnt
roughly
grand
va
here
worldwide
elsewhere
draw
conversation
organized
workplace
richmond
sue
proof
offender
peter
income
hot
aim
urging
secret
steve
draft
advance
rubio
violated
fda
paris
intent
creating
pain
guarantee
lapierre
acting
regional
defeat
acknowledged
brief
thinking
closed
fatal
prospect
cell
ronald
vast
walked
river
writing
conspiracy
fourth
paying
welcome
rampage
recommended
pointed
successful
licensing
clemency
happening
deport
evening
aggressive
duty
instant
deep
prince
choose
older
fix
effectively
trouble
prompted
barred
causing
commerce
agriculture
consideration
smuggling
landmark
vowed
identification
institution
direct
downtown
harder
seller
murdering
specie
frank
delegate
mention
burden
emotional
efficiency
notice
limiting
percentage
heavily
internet
massive
avenue
whatever
quality
surprise
daniel
handle
crop
promote
n
younger
residency
representing
remember
deathpenalty
remove
hiring
appropriate
exception
angry
theater
profit
dramatic
blue
minister
rare
anywhere
blocked
proposition
double
dealing
attend
deadline
payment
metro
atf
pulled
investment
encourage
playing
highcapacity
worried
guest
ultimately
historic
significantly
lie
possibly
league
warmer
anthony
purchased
broke
heavy
god
explain
tool
award
opposes
losing
