said
gun
would
new
state
states
people
one
death
law
us
immigration
court
years
bill
last
guns
federal
year
two
could
tobacco
also
president
immigrants
climate
mr
national
house
united
many
percent
laws
control
change
public
illegal
time
first
weapons
smoking
county
police
even
say
penalty
school
city
case
ban
like
global
senate
may
country
officials
make
week
since
warming
right
congress
american
million
get
three
firearms
government
issue
legislation
health
emissions
legal
washington
including
children
says
group
judge
florida
take
violence
made
day
rights
attorney
support
shooting
whether
way
dont
york
use
much
background
murder
found
second
life
association
without
amendment
according
republican
today
supreme
work
used
nations
high
rifle
another
department
tuesday
carbon
administration
industry
members
report
back
want
monday
political
district
crime
told
part
general
policy
still
next
among
thursday
wednesday
vote
home
going
debate
man
nra
california
companies
office
bush
assault
called
system
convicted
obama
decision
americans
greenhouse
local
enforcement
former
month
think
need
long
gov
help
energy
program
ago
killed
checks
well
center
study
justice
white
number
action
days
groups
go
already
campaign
trial
every
yesterday
news
carry
world
must
four
friday
cigarette
republicans
measure
workers
clinton
recent
five
put
prison
several
come
plan
passed
execution
cigarettes
know
students
university
money
border
power
gas
jury
committee
keep
might
citizens
least
john
months
security
democrats
sales
smoke
good
others
act
criminal
show
capital
st
cases
came
lawmakers
safety
less
family
see
set
become
sen
trump
evidence
thats
past
never
appeals
research
environmental
smokers
texas
virginia
across
around
asked
sentence
america
allow
nearly
killing
lawyers
owners
times
far
took
countries
little
business
scientists
shot
mass
leaders
defense
director
service
prosecutors
stop
handgun
san
advocates
likely
end
proposal
major
concealed
billion
immigrant
increase
company
away
problem
saying
reduce
effect
believe
six
later
march
measures
guncontrol
trying
enough
dioxide
yet
ruling
punishment
left
place
weeks
georgia
executive
gases
agency
shows
issues
men
tax
rep
hearing
young
democratic
community
efforts
give
nation
face
governor
row
proposed
whose
check
though
shootings
expected
victims
courts
making
however
council
person
order
international
pay
handguns
air
conference
attorneys
released
drug
colorado
im
call
buy
effort
something
authorities
lives
similar
period
charged
held
women
restrictions
bills
chief
legislature
point
majority
north
crimes
record
got
pass
residents
area
big
allowed
fact
didnt
undocumented
announced
charges
deal
earlier
require
criminals
schools
began
important
question
taking
almost
officers
care
protect
better
filed
approved
spokesman
meeting
human
early
force
night
sentenced
along
board
move
clear
permit
find
doesnt
hours
process
instead
cities
thousands
june
mexico
using
mayor
changes
agreement
appeal
permits
information
voted
often
south
taken
anyone
louis
firearm
brady
status
rules
guilty
current
scheduled
weapon
future
recently
wrote
statement
within
known
nothing
voters
cancer
waiting
arms
stand
outside
cut
prevent
given
cant
cause
missouri
done
michael
reform
look
levels
lawyer
protection
illegally
dealers
based
lawsuit
lead
wants
history
die
working
jobs
families
private
able
theres
plans
include
half
james
real
seeking
cost
economic
black
data
went
although
small
comes
letter
fight
lot
problems
executed
presidential
really
continue
kill
free
services
officer
citizenship
makes
signed
top
getting
mental
science
led
ever
july
records
april
social
arrested
someone
panel
areas
reason
deportation
supporters
seek
agents
circuit
parents
failed
accused
woman
large
required
george
despite
david
costs
hands
agreed
foreign
plants
provide
west
different
beach
address
stay
reported
toward
maryland
seven
ice
things
lobby
atlanta
mother
possible
died
age
college
result
sent
bear
near
legislative
party
job
idea
deaths
head
consider
open
water
legally
r
governments
thing
population
let
fire
largest
decades
rifles
rather
live
robert
review
best
economy
inmates
calls
regulations
final
cannot
issued
dead
programs
food
great
congressional
sale
press
wanted
risk
late
theyre
coming
rate
serious
society
civil
leader
settlement
sunday
war
response
tried
ruled
added
average
medical
brought
bring
old
start
list
means
documents
lethal
growing
line
naturalization
received
mexican
per
products
try
spent
executions
wont
special
hope
strong
questions
election
sign
sense
higher
street
morning
secretary
illinois
jersey
level
saturday
temperatures
hard
philip
access
education
decided
purchases
fear
certain
matter
became
attack
semiautomatic
member
threat
behind
car
lost
hes
latest
potential
increased
eight
kind
armed
constitutional
morris
experts
ground
organization
step
needed
proposals
senator
jurors
hold
policies
jr
massacre
ins
limit
sell
dangerous
key
common
seen
rise
close
run
store
isnt
sure
sept
millions
violent
judges
kids
aliens
oil
ownership
chairman
wrong
natural
post
democrat
carrying
nicotine
hundreds
coal
longer
example
living
side
always
impact
william
committed
building
arizona
argued
soon
bad
opponents
meet
wife
full
military
significant
especially
official
rejected
attention
father
son
numbers
turned
third
needs
park
places
paul
position
bureau
injection
j
smith
atmosphere
turn
brown
responsible
leading
sold
child
interview
feel
market
anything
richard
gave
commission
license
probably
domestic
clean
capitol
purchase
student
opposed
disease
politics
story
employees
environment
ask
either
annual
union
pollution
showed
claim
green
budget
thought
safe
obamas
worlds
jail
vice
calling
sea
standards
ill
opinion
jan
citys
role
session
los
claims
mark
votes
taxes
caused
ammunition
nine
estimated
push
read
researchers
chance
rising
attempt
weather
studies
politicians
rule
talk
front
actually
begin
heat
seems
message
conservative
challenge
gop
agree
constitution
ways
course
scientific
institute
church
available
allowing
candidates
lower
effects
involved
legislators
included
bar
requires
dc
buyers
media
name
attacks
simply
tell
apply
minnesota
central
hear
individual
cars
considered
philadelphia
restaurants
century
thomas
denied
nationwide
bars
earth
opposition
lung
difficult
ordered
ordinance
started
refused
speech
heart
favor
charge
pennsylvania
senators
individuals
ms
worked
carolina
editor
businesses
manufacturers
trade
sentences
article
helped
benefits
suit
communities
killer
decide
return
heard
leave
fbi
requiring
november
subject
mentally
sought
professor
buying
summer
treaty
together
scott
actions
request
decade
concerns
angeles
investigation
create
yes
particularly
light
supported
allows
china
body
visas
electric
lawsuits
approach
limits
advertising
regulation
labor
newtown
antismoking
town
parole
friends
argument
charles
activists
chicago
project
streets
fall
possession
denver
series
reducing
raise
reports
looking
dr
editorial
hill
coalition
tough
joined
agencies
testimony
quit
fuels
authority
powerful
miles
designed
release
refugees
banning
rates
following
offered
january
steps
palm
island
true
understand
price
conviction
room
reached
amount
perhaps
answer
ads
demand
event
aimed
banned
deadly
kyoto
technology
view
miami
running
bans
includes
changed
focus
quickly
dollars
floor
alcohol
justices
ones
save
donald
remain
adults
parkland
degrees
candidate
total
published
dec
lawabiding
goal
provision
hispanic
target
words
pressure
bloomberg
introduced
english
asylum
comment
southern
concerned
francisco
beyond
interest
declined
short
single
staff
assistant
everyone
arguments
gore
battle
term
offer
w
east
fossil
events
existing
december
floridas
drugs
poll
assembly
survey
weve
makers
sheriffs
temperature
goes
sources
created
fla
fuel
organizations
rest
centers
language
raised
dozen
personal
granted
due
oct
martin
owner
race
homes
movement
feb
americas
murders
citizen
resources
employers
effective
stores
sides
innocent
representatives
spokeswoman
minutes
licenses
concern
fund
bay
bipartisan
paid
licensed
met
counties
selling
present
form
spending
takes
share
davis
ad
inside
magazines
inmate
regulate
asking
pm
comprehensive
visa
tom
defendants
easy
necessary
block
saw
bob
noted
mean
watch
additional
husband
moved
elected
greater
opportunity
unusual
restaurant
happened
reasonable
terrorist
patrol
avoid
alone
chair
stopped
team
intended
critics
youre
land
approval
stricter
giving
senior
biggest
reach
poor
immediately
training
plant
prevention
increasing
growth
drive
controls
tougher
freedom
homeland
road
facing
hand
sandy
arrest
version
passage
pleaded
talks
rally
joe
buildings
appeared
send
previous
l
forced
mostly
administrations
prosecutor
pack
spend
impose
seem
forward
governors
trumps
written
applications
temporary
elementary
customs
usa
development
signs
socalled
grant
compromise
associated
continued
agenda
wake
spoke
property
controversial
douglas
ive
jose
considering
pending
ability
provisions
selfdefense
firstdegree
hall
happen
wasnt
permanent
analysis
hit
gone
initiative
expect
nov
robbery
compared
wait
relatives
else
presidents
carried
journal
results
unless
conn
argue
talking
e
secondhand
arent
urged
faces
middle
speak
reasons
appears
receive
prove
largely
remains
test
described
campus
killings
sponsored
jim
farmers
connecticut
hook
teenagers
fired
johnson
speaker
judiciary
sentencing
planet
produce
win
leadership
planned
range
terms
funding
television
detention
dropped
willing
main
tampa
driving
daughter
tragedy
teachers
felony
parts
finally
apparently
airport
lack
guard
hospital
twice
card
fellow
date
kept
wouldnt
customers
suggested
beginning
insurance
drivers
knew
chamber
followed
everything
enforce
gunman
electricity
developing
deported
williams
victim
easier
brooklyn
broad
believed
february
epa
follow
ended
determine
al
voting
victory
columbia
clearly
moving
coast
addition
huge
financial
eligible
commissioner
works
mind
unconstitutional
lines
popular
inc
oklahoma
provided
daily
convention
aug
el
consequences
product
opened
practice
terrorism
certainly
separate
finding
join
caught
witnesses
doubt
specific
build
amnesty
californias
responsibility
verdict
expand
sometimes
oppose
suspected
class
play
primary
speaking
showing
views
source
reynolds
fewer
terrorists
couple
northern
hunting
comments
lee
site
leaving
serve
changing
worst
low
declared
felons
fighting
countrys
october
bought
youth
adopted
spring
accept
appear
ocean
package
lets
holding
throughout
vehicles
choice
investigators
burning
condemned
whats
cards
region
obtain
pistol
focused
simple
curb
maybe
door
brother
causes
bushs
mandatory
gets
enacted
santa
pushing
extreme
representative
penalties
facts
plea
repeal
vegas
wounded
whole
cited
break
returned
barack
targets
feet
solution
reporters
related
statewide
gang
limited
damage
fair
experience
districts
minors
applicants
worth
commit
september
video
king
keeping
affect
visit
resident
produced
previously
chinese
crowd
increasingly
gives
online
space
highest
served
las
trend
standard
path
points
ryan
none
truth
worker
veto
putting
departments
enter
protest
suspect
european
warning
findings
arrived
moment
august
testified
wilson
upheld
possibility
decisions
adding
weekend
starting
otherwise
critical
named
nras
atmospheric
entire
lose
currently
friend
todays
wall
ahead
defend
lived
seemed
papers
calif
fine
paper
abuse
defendant
treatment
conditions
promised
antigun
boy
threatened
felt
deputy
strict
statistics
prices
believes
supports
ready
passing
expressed
amendments
production
mike
challenges
delay
love
hearings
advocacy
negotiations
reagan
activity
earths
overall
difference
native
columbine
f
liberal
conducted
struck
shift
lobbying
requirements
behalf
column
forces
failure
afternoon
foundation
born
account
loophole
progress
writer
massachusetts
safer
concluded
neither
marketing
details
nature
radio
computer
occurred
discuss
petition
hopes
joseph
raising
firm
discussion
danger
smokefree
field
cold
reality
funds
dozens
add
prosecution
cigar
eventually
manhattan
latino
slaying
counts
involving
sponsor
becoming
tv
c
backed
increases
word
hillary
manager
warned
trigger
machine
ensure
sheriff
couldnt
reduction
co
upon
admitted
restrict
borders
orlando
applied
bullets
particular
drop
knows
false
names
learn
situation
risks
generally
cruz
offices
mayors
rape
author
kennedy
alleged
potentially
figure
announcement
highly
progun
renewable
illness
shop
club
represent
various
statements
meanwhile
entered
custody
cover
hour
housing
mothers
retired
nuclear
strategy
ballot
standing
movie
elections
represents
b
valley
welfare
deny
except
page
estimates
cuts
pushed
suggest
worse
voice
damages
witness
suggests
stoneman
arctic
travel
ran
task
helping
influence
polls
smoked
determined
girl
superior
clintons
harm
easily
loss
basic
convictions
doctors
decline
repeatedly
phase
drew
file
shoot
piece
prohibit
claimed
gunrights
crisis
letters
rural
fully
ohio
rick
improve
shouldnt
success
continues
linked
wind
colleagues
western
reduced
houses
criticized
benefit
provides
vehicle
station
prohibited
conduct
jones
enact
un
solar
basis
learned
criticism
wayne
indeed
faced
hurt
politically
regarding
arguing
original
presented
blame
sued
apartment
methane
japan
miller
interests
supporting
id
books
severe
smoker
hire
sweeping
exactly
rose
racial
dealer
marjory
canada
combat
factors
meant
opening
providing
army
red
virtually
courtroom
consensus
walk
identified
operation
concealedcarry
base
culture
stephen
suspects
book
complex
magazine
minority
aid
gathered
violations
telling
pretty
imposed
minimum
cruel
advocate
harris
exchange
religious
purpose
protocol
bank
stood
adult
de
immediate
application
emergency
prisoners
conservatives
systems
neighborhood
resolution
orders
killers
cutting
supposed
complete
shown
protecting
secure
setting
endorsed
alternative
quite
cuomo
arm
fees
europe
overturned
turning
requirement
fraud
sanders
murderer
parties
prepared
summit
seriously
urban
automatic
solutions
parks
track
fox
associations
cents
allegedly
attempted
unlikely
cuba
placed
habit
h
transportation
specifically
dangers
agent
blood
boys
developed
v
boston
fee
revenue
murdered
detained
registration
construction
montgomery
longterm
stronger
larger
farm
traffic
behavior
bringing
allen
cash
serving
amid
directly
planning
looked
figures
suicide
loaded
search
dna
industrial
predicted
guy
counsel
broken
mexicans
owned
models
fell
affected
shooter
scientist
usually
activities
fort
strongly
goals
chris
schumer
slow
obtained
respond
india
aside
injured
hasnt
roughly
threats
moral
phone
queens
grand
militia
worldwide
organized
elsewhere
heres
circumstances
cuban
teens
va
season
hot
promise
homicides
degree
steve
urging
rubio
violated
creating
grounds
table
lapierre
regional
paris
acting
acknowledged
stocks
section
proof
thinking
closed
richmond
sister
reductions
type
ronald
mrs
countys
fatal
intent
paying
credit
vast
respect
fourth
attempts
walked
homicide
sound
tons
model
commitment
successful
recommended
pointed
licensing
dream
clemency
deport
aggressive
remarks
sue
bond
instant
choose
deep
incident
older
barred
effectively
offering
prompted
causing
smuggling
commerce
vowed
newspaper
prince
direct
note
harder
murdering
kelly
species
happening
lake
types
priority
visitors
emotional
environmentalists
generation
conspiracy
limiting
winter
draft
defeat
cap
cross
heavily
internet
nonprofit
downtown
trip
heads
massive
agriculture
identification
whatever
seat
patients
document
promote
flow
facilities
worry
younger
residency
representing
supply
remember
scene
deathpenalty
welcome
angry
campaigns
appropriate
hiring
dramatic
anywhere
evening
rare
host
blocked
pain
n
connection
attend
proponents
wisconsin
operations
playing
landmark
encourage
consumers
pulled
metro
division
refugee
highcapacity
nonsmokers
drought
worried
warmer
efficiency
significantly
historic
ultimately
email
possibly
persons
rampage
purchased
broke
sort
losing
heavy
sensible
unable
opposes
explain
universal
wave
widely
percentage
truck
industries
proposition
litigation
played
questioned
cigars
thus
british
relief
suffered
eliminate
statute
independent
frank
game
anthony
organizers
violation
contribute
quality
employment
van
fda
reading
dealing
web
writing
shortly
crack
teacher
network
multiple
uses
develop
launched
positions
built
acts
bump
trees
unfortunately
relationship
database
blue
tech
established
fatally
count
rounds
allies
projects
surprise
relatively
ordinances
peoples
prohibits
expanded
stage
protected
expensive
citing
arrests
hotel
locks
hoping
dismissed
condition
proceedings
secret
income
medicaid
closing
billions
seeks
catholic
driver
stolen
devices
remained
theyve
sports
peace
shops
ought
pursue
daniel
challenged
survivors
corrections
addictive
stock
census
pistols
gain
taxpayers
ideas
bit
affairs
headed
double
approve
andrew
firing
warm
happens
brief
responded
reporting
broader
commercial
fix
trafficking
ashcroft
vulnerable
mention
unit
fast
opponent
grow
settled
link
failing
avenue
adopt
thanks
obvious
motion
onto
round
remove
humans
seeing
value
consideration
stories
campuses
la
bullet
romney
prevented
sending
meaning
delegates
larry
tens
fears
subcommittee
indicated
warrant
pledged
edward
trouble
heattrapping
mom
spread
illnesses
looks
mccain
telephone
grew
reelection
rj
iraq
corporate
fill
folks
identify
forests
executives
familiar
reaction
continuing
overwhelming
neighbors
diego
factor
renewed
georgias
atf
eastern
league
hired
haitians
blamed
offers
legitimate
sat
parking
legislatures
intense
pick
plaintiffs
foreigners
bombing
picture
powers
notice
activist
oregon
flight
firms
internal
stands
annually
walking
kansas
academy
absolutely
havent
1990s
opposing
companys
dispute
protesters
violate
offenders
represented
unanimously
ties
burden
requests
militarystyle
eric
attended
river
picked
challenging
fate
filled
hospitals
brands
minor
expert
springs
happy
migrants
normal
instance
henry
recognize
aware
assistance
impossible
halt
deadline
forest
industrys
sellers
management
substantial
relations
eyes
agencys
facility
duty
giffords
prominent
begun
g
holders
teen
juvenile
becomes
publicly
peter
terry
jackson
write
draw
alaska
numerous
suburban
dan
removed
michigan
procedures
enforcing
sex
guards
kidnapping
shotguns
registered
grown
advance
p
advantage
leaves
hispanics
modern
lobbyist
closely
liability
divided
puts
teenage
sharply
longtime
amounts
claiming
presence
generals
patrick
chambers
sexual
regions
wide
trucks
bus
brothers
handle
judicial
surface
sets
technologies
conversation
positive
method
alien
ar15
regardless
expanding
stance
modest
tighter
accepted
howard
forum
unlike
god
commonsense
gonzalez
runs
begins
cast
watched
consumption
diseases
confirmed
widespread
clients
theater
retarded
melting
gathering
mission
houston
shall
smokingrelated
therefore
completed
wish
murphy
innocence
accord
audience
nearby
mountain
recommendations
attacked
testing
aides
overhaul
atlantic
backing
gary
dennis
extend
aurora
suits
prisons
blacks
establish
employee
finds
balance
posted
sitting
career
jay
entry
utilities
referring
rhetoric
newly
receiving
possess
smaller
meetings
jerry
dramatically
solve
crucial
flood
regular
contributions
dallas
fairfax
owens
forms
finance
facebook
usual
matters
hoped
barbara
mississippi
ending
stated
trust
closer
bid
guys
dole
brian
pew
moratorium
correct
combined
surprised
nominee
headquarters
retailers
juries
conclusion
colo
tim
proper
repeated
greenhousegas
baby
active
talked
contract
fiscal
cheap
williamson
image
covered
differences
commissioners
wonder
misdemeanor
announce
sharp
sarah
understanding
handful
award
universities
cops
addressing
initiatives
quick
bodies
minister
capacity
discovered
werent
permission
treated
alabama
protests
entering
hardly
missing
grants
targeted
baltimore
maker
reid
maintain
register
feinstein
shotgun
storms
preventing
size
iowa
nichols
mary
afraid
timothy
churches
tuition
smugglers
antitobacco
impacts
demands
photo
tallahassee
marlboro
achieve
film
abortion
twitter
lobbyists
typically
truly
nevada
owning
murderers
flooding
hurricane
unprecedented
warnings
sick
delayed
arkansas
extra
locked
latin
addiction
defeated
injuries
theory
addressed
pope
plus
gay
colleges
complaints
awaiting
oped
restricting
survived
marriage
sanctuary
fought
essentially
comply
lewis
louisiana
defender
guest
drawn
latinos
deathrow
foreignborn
nc
marked
qualify
chances
coverage
consumer
promises
girls
rain
markets
watching
terror
negotiators
ken
regulated
sites
suffering
driven
thompson
joining
deeply
shes
options
regulating
jack
demanding
childrens
variety
joint
fail
eye
realize
classes
suing
nomination
permitted
originally
stabbed
gunrelated
banks
delivered
pull
waste
faith
music
tests
aftermath
wearing
camel
thinks
knowledge
obviously
seized
imagine
honor
durham
nationally
appealed
yorkers
married
execute
coastal
participate
favored
lots
escape
ted
cell
maximum
anderson
mcveigh
pledge
option
susan
sessions
yorks
accounts
moore
perry
spanish
cubans
ambitious
polar
unclear
harry
teenager
reno
incidents
faster
counter
jeff
janet
urge
filing
turns
rev
spot
authors
industrialized
beat
contrast
rich
breaking
temporarily
ignored
fields
indian
suffer
shared
physical
corp
voluntary
controversy
momentum
leads
graham
alive
kevin
initially
replace
split
prohibition
identity
resulted
clara
collins
rooms
surgeon
appointed
pacific
indoor
periods
nelson
exposed
afford
camp
valid
restrictive
fled
oceans
merely
interviews
meaningful
insisted
walker
hunt
settle
manmade
snow
strike
appearance
kinds
entirely
migration
sons
purchasers
emission
imposing
saved
passengers
jefferson
treating
liberties
slightly
hurricanes
completely
fines
estimate
greatest
kerry
deciding
prime
opportunities
mall
protections
indictment
droughts
tied
sciences
suggesting
occur
patterns
actual
odds
outcome
utah
character
aim
virginias
interested
wages
beating
martinez
germany
fifth
ii
twothirds
brain
consistent
unveiled
moderate
applying
brand
jewish
clerk
explosives
detainees
coalfired
purchasing
scrutiny
falls
square
dean
deserve
trials
medicine
birth
sporting
h1b
shut
storm
openly
predict
extremely
unfair
boat
chiefs
possessing
deportations
fahrenheit
everybody
complaint
traditional
defended
offense
prospective
immunity
dying
sun
wildlife
train
topic
colorados
expansion
barring
towns
baseball
cultural
client
crackdown
remaining
signing
direction
discussions
fresh
holds
practices
boost
tend
associate
poverty
steven
asian
noting
primarily
mainly
binding
notes
boulder
cleared
surge
smart
outrage
detailed
threatening
ceremony
giant
interstate
rarely
hate
growers
bail
muhammad
rapidly
bottom
endorsement
speed
complained
prepare
strengthen
investors
surrounding
overwhelmingly
please
federally
nixon
highprofile
1980s
gasoline
mccarthy
waves
sponsors
disaster
star
tonight
hell
fulton
loved
ethnic
discourage
pace
machines
alan
christopher
payments
terrible
veterans
revealed
everywhere
submit
belief
pat
prohibiting
highway
feeling
wesson
unanimous
quarter
taylor
salvador
sniper
manufacture
encouraging
refuse
gray
pact
attempting
pleas
cdc
exercise
properly
daughters
packs
indicted
girlfriend
agricultural
auto
reporter
demonstrate
african
kentucky
values
liberty
deputies
giuliani
nobody
africa
iii
canadian
alliance
allegations
referred
analysts
bernardino
chose
stalled
committees
parent
website
assessment
pattern
partly
importance
readers
users
acted
directed
convinced
founded
reforms
bronx
jurisdiction
cobb
advanced
investment
applies
exposure
weight
window
prior
vetoed
heller
tiny
feared
nj
pollutants
sierra
contend
miss
resolve
earned
gotten
requested
preliminary
vermont
targeting
doctor
listen
helps
slayings
dekalb
formed
climatechange
prospect
baker
manner
entitled
contentious
blow
extended
enforced
pounds
authorized
veteran
nancy
workplace
fathers
lawful
emerged
initial
persuade
preparing
apart
guidelines
harmful
issuing
ultimate
learning
hunters
soldiers
raped
prisoner
apparent
researcher
pressing
recommend
knowing
supporter
attending
explained
chapter
desert
adam
outdoor
anger
personnel
qualified
arnold
bigger
participants
conservation
core
desire
chemicals
owns
surprising
rush
proud
shopping
deserves
stopping
horrific
ignore
russia
complicated
moves
announcing
soil
straight
neighborhoods
box
recognized
injury
successfully
albany
golden
tragic
funded
capandtrade
hammer
debated
protects
del
perfect
airports
carnage
testify
recorded
sens
introduce
somebody
ny
england
answers
dcalif
russian
elderly
mentioned
suspended
nonsmoking
co2
senates
loopholes
bears
pool
institution
recover
ongoing
francis
educational
frequently
procedure
crossing
discrimination
studying
glaciers
display
scheme
port
biden
reject
proved
professional
handed
negative
shield
membership
retail
regulatory
epidemic
favors
crop
animals
flawed
mandate
recommendation
error
disappointed
chuck
haiti
tighten
committing
defending
offenses
struggle
experienced
credits
southwest
aids
equal
treat
congressman
generate
weak
violating
sit
fundamental
missouris
handling
jurisdictions
moms
correctional
confessed
disabled
slain
suddenly
era
stem
gained
sacramento
anybody
questioning
guarantee
stations
contrary
follows
pose
unique
conflict
definition
overturn
theyll
hillsborough
heights
moussaoui
oceanic
advice
implications
recall
praised
tomorrow
manufacturing
discussed
profits
soviet
opposite
fence
christmas
administrator
investigations
tuesdays
scale
delays
enormous
motor
partisan
fires
routine
marco
whos
deter
reviewed
tucson
speakers
toughest
female
mistake
adviser
intergovernmental
raises
resulting
exist
choices
deliver
mail
sb
promoting
anniversary
aggravated
liggett
haitian
lies
contributed
nasa
efficient
maine
schwarzenegger
debates
ends
spare
exception
thank
lowest
stepped
administrative
voices
lt
assassination
sevenday
panels
priorities
equipment
ease
focusing
selection
barely
cool
notion
abroad
proposing
ozone
christie
harvard
ranks
childhood
tennessee
punitive
reversed
threw
17yearold
violates
abandoned
doors
passes
craig
movies
corner
contact
drove
opinions
austin
ages
toll
costly
civilian
regularly
collect
straw
memorial
obtaining
threejudge
raids
rapid
memo
kenneth
rely
stringent
screen
morgan
reflect
healthy
clubs
principal
gangs
illegals
projected
guilt
courage
portion
spared
tells
net
flag
intelligence
ellis
declaring
override
sparked
gwinnett
operating
kick
ford
cooling
devastating
pipeline
posts
formally
australia
hampshire
demanded
fairly
messages
madison
submitted
tex
persecution
corporations
judgment
extent
lists
cnn
gunned
tragedies
shots
cop
anticrime
forcing
reaching
examine
stayed
convince
promising
players
liberals
bruce
threeday
marylands
marshall
surely
investigating
plane
ring
trained
courthouse
hb
bridge
utility
brings
reverse
pleased
engaged
contains
investigate
tool
controlled
exists
healthcare
ship
youths
q
pronounced
wouldbe
zimmerman
purposes
partner
disagree
responding
winning
extensive
rival
delaware
dakota
convenience
hills
lastminute
admit
alexandria
orange
garcia
lawenforcement
cycle
warmest
formal
argues
islamic
features
manufacturer
reflects
anyway
broadcast
sees
hundred
carter
shares
scalia
troubled
mo
honest
assaultstyle
eager
generations
lawrence
exempt
globe
listed
struggling
practical
invited
plenty
overseas
acknowledge
ron
maria
desk
maintained
punish
reviewing
pregnant
cocaine
generated
christian
sounds
cleaner
employer
contended
indicate
steady
seas
feels
chemical
route
emails
designated
pages
processing
arizonas
residence
phoenix
shooters
toomey
elian
german
contributing
jennifer
declare
seats
plastic
recovered
returning
pair
muslim
dianne
enjoy
trends
minute
incentives
desperate
falling
posed
chain
airlines
pa
packed
refusing
embrace
denying
typical
radical
volunteer
serial
rallies
tears
lax
reinstated
felon
waters
ross
fit
collected
denial
wild
reportedly
insist
orleans
involves
fiveday
branch
moreover
images
jumped
scores
executing
studied
ed
gulf
match
guarantees
declining
conclusions
resistance
divide
inspired
implement
marine
cook
races
cooperation
skills
reconsider
granting
constituents
clips
knife
stabbing
nightclub
sector
signal
dick
longstanding
contends
ann
tactics
deemed
zone
keeps
silver
severely
franklin
clark
heston
proceed
adds
essential
transfer
religion
fred
destruction
village
creates
considers
marks
evil
petersburg
detectives
contained
narrow
mcauliffe
campbell
appropriations
antonio
juveniles
chiles
adams
classaction
equivalent
urgent
floods
presidency
mount
rock
signature
necessarily
oakland
dark
games
drawing
inspector
frustration
tree
councilman
lock
forget
motivated
vietnam
skilled
guatemala
jurys
everytown
rjr
headline
drinking
examined
k
fleeing
restricted
neighbor
whites
reprieve
slaughter
concealedweapons
arming
1970s
plead
jeb
mix
analyst
asks
awareness
uncertain
visited
lay
sorry
availability
metal
discretion
thoughts
reputation
quietly
womens
striking
horror
prosecuted
undercover
gunfire
controlling
threaten
curbing
arrive
uncertainty
aide
concept
describe
guess
wood
raleigh
paperwork
restraining
supervisors
workplaces
chest
weekly
northeast
decrease
shape
fallen
satellite
walls
accident
charleston
9th
indiana
smokeless
confident
expects
rio
combination
responses
pentagon
graduate
missed
floridians
appellate
petitions
theft
juror
rodriguez
seconddegree
britain
managed
hidden
tropical
foot
partys
embraced
omalley
harsh
replaced
roll
kills
caucus
ridge
encouraged
caps
tour
inaction
writes
propose
sensitive
mondays
letting
households
screening
pinellas
ap
basically
signatures
burglary
stark
tide
republicancontrolled
troops
stake
strip
restore
youve
southeast
demonstrated
household
bound
dave
fairness
waited
lawmaker
tape
marijuana
camden
roof
frequent
treasury
heated
acres
arriving
donations
jeffrey
retreat
objections
pasco
municipal
freed
goods
instate
laborers
ten
hottest
upper
catch
tired
rob
intention
arlington
stevens
defenders
matthew
via
publicity
resume
lungs
minneapolis
throw
buyer
holder
voter
france
contest
dry
producers
prospects
equally
pressed
zero
busy
removal
ray
rulings
castro
pataki
understood
gap
tools
silicon
trading
participating
accurate
blocking
israel
doubled
bernie
abolish
art
code
warner
thrown
malvo
unlicensed
migrant
antiimmigrant
burned
fingerprints
regulators
institutions
20th
lighting
roberts
technical
awarded
montana
viewed
deals
privately
dny
ranging
assume
upset
wednesdays
accidents
pete
spree
outlaw
mainstream
copenhagen
tony
produces
tackle
fake
stuff
partnership
depend
compliance
interesting
ceo
survive
asia
deliberations
items
populations
founding
carefully
hole
halted
justify
hightech
zones
crossed
category
mouth
cox
warren
md
offset
vending
capture
vital
heading
principles
involve
communications
substantially
capable
exceptions
performance
carries
bomb
crowded
volunteers
escaped
racist
assaultweapons
misleading
filibuster
founder
stuck
obligation
destroyed
totally
bright
extraordinary
improving
informed
savings
involvement
unnecessary
duke
foster
personally
sad
stops
memory
monitoring
relative
heating
hailed
thousand
destroy
backers
express
threatens
string
accidental
carlos
patches
supervisor
nationals
abusers
risen
consistently
unions
roads
wage
attitudes
strategies
woods
preserve
shame
postdispatch
interviewed
grade
sam
independence
metropolitan
moments
attracted
suicides
visiting
onethird
serves
explanation
crops
contribution
strongest
silence
doubts
marched
traveled
municipalities
profit
documented
officially
midnight
robinson
wound
dinner
uniform
raping
constitutionality
depending
catastrophic
delegation
mixed
nice
californians
substance
gather
gregory
compelling
garden
perform
georgians
mans
regard
greatly
newspapers
injunction
lie
drafted
expired
mercy
unarmed
tobaccorelated
avoided
engage
agreements
employed
flights
device
gross
french
fly
walmart
text
breaks
suburbs
locations
corporation
warrants
jews
juan
probation
ak47
smokes
unemployment
northwest
launch
resource
navy
clayton
factories
routinely
minds
pictures
boards
babies
crazy
lying
sisters
detective
kessler
daca
disturbing
passenger
anymore
undermine
checked
competition
prize
diverse
nebraska
somewhat
principle
automatically
hair
journey
halls
enacting
verify
mitchell
tradition
abujamal
location
berkeley
predictions
sentiment
denounced
electronic
tone
gum
dedicated
thursdays
hollywood
shifted
lifetime
empty
library
relevant
gubernatorial
prosecute
nypd
gunshow
skeptics
climatic
historical
fails
tourist
surveys
somehow
material
defined
powell
proven
design
breathe
wealthy
favorite
mitt
definitely
nathan
eighth
accepting
georges
roy
referendum
distribution
sixth
statutes
wounds
arrivals
supplies
conventional
universitys
seattle
saving
attributed
aims
sufficient
methods
besides
timing
warn
patrons
airline
urgency
traveling
expenses
content
lengthy
admission
indicates
earn
littleton
hed
quiet
lott
recalled
manchin
beaten
reads
starts
switch
documentary
ride
storage
grassroots
contain
divisive
feature
pointing
articles
teach
farreaching
narrowly
margin
appearing
ordinary
ga
intend
stanley
attitude
enthusiasts
cessation
commitments
farms
painful
frustrated
refusal
negotiated
shifting
wars
schedule
trail
brutal
delta
yesterdays
stewart
elizabeth
chosen
strength
featured
spoken
demonstrators
humane
raid
improved
advertisements
normally
greg
import
careful
gabrielle
cry
spots
bloombergs
color
producing
silent
fans
confusion
sc
sells
bias
senseless
privacy
infringed
sight
nobel
engineering
republic
economists
stress
context
reference
hanging
byrd
deadliest
logic
plot
newark
prefer
evans
tested
establishments
dreamers
noncitizens
trap
reliable
negotiating
sport
shell
mine
burn
fish
lisa
quoted
buried
succeed
accountable
twoyear
perspective
answered
array
11th
inadequate
afghanistan
handled
demonstrations
quitting
prayers
knowingly
widow
edwards
billboards
guestworker
hotter
inches
losses
junior
gerald
adequate
todd
tries
islands
teams
affects
classroom
competent
lights
ave
holmes
restriction
gunsafety
pieces
resolved
removing
phil
absence
observed
laid
platform
willingness
diversity
emit
considerable
blunt
london
partners
kicked
hopeful
touch
stream
repeat
twin
selected
gingrich
influx
jerseys
shortage
ineffective
simon
diaz
convict
barnes
webb
trayvon
voluntarily
scenario
nowhere
idaho
useful
captured
fierce
charlie
advisory
famous
conclude
mcconnell
vs
coordinator
classrooms
approximately
gold
cameras
clothes
situations
accusing
rating
plain
nights
unfairly
lied
democracy
jails
lopez
abused
gilmore
stamps
chewing
nonetheless
jump
investments
competitive
emerging
brazil
ranges
rational
lift
carl
speeches
grave
demonstration
swift
expire
imprisonment
irresponsible
jonathan
jordan
customer
disturbed
alexander
walter
horrible
butts
measured
asthma
debt
managers
influential
stretch
visible
sustainable
random
creation
residential
headlines
somewhere
buses
tracks
assigned
registry
indication
newcomers
recipients
charlotte
irish
robbed
aggressively
solid
remarkable
eat
attached
realized
mitigating
intensity
emotion
hadnt
tank
editors
heritage
alter
procedural
blocks
federation
interpretation
patch
russell
fridays
reluctant
traced
covers
cohen
renew
botched
revolution
depends
drilling
discussing
rejecting
implemented
charging
deferred
holiday
scope
ok
toxic
crash
alternatives
operate
coffee
journalists
excuse
enemy
liable
linda
rolling
pittsburgh
elements
rogers
educators
oral
hunter
jailed
existence
belt
faculty
negotiate
advisers
friendly
occurring
underground
map
sanctions
bradley
justified
producer
addresses
dropping
tweeted
intends
photos
outofstate
precedent
ward
barry
luis
arthur
instructions
pro
clinic
prescription
legalization
lorillard
hawaii
laboratory
battles
title
approaches
sends
achieved
farmer
shifts
outright
optimistic
springfield
crist
staying
poses
unrelated
debating
wildfires
listening
payment
museum
lobbys
contractors
disappeared
fraction
prompting
sullivan
washingtons
parker
approached
couples
amended
deterrent
gunfree
tobaccofree
celsius
economies
materials
solely
collective
assist
examples
covering
constant
stadium
mounting
recreation
bitter
lobbied
swing
addicted
simpson
merit
recess
hatch
coleman
19yearold
heinous
gunshot
casino
ecigarettes
sheet
rocky
upcoming
economics
phenomenon
concrete
framework
commentary
concludes
midwest
confront
slowly
gift
adopting
lands
disclose
attacking
wed
dirty
landscape
superintendent
comparison
plays
suspicion
versions
monitor
remote
trace
teaching
packing
pursuing
estate
torture
exemption
undergo
marion
6yearold
youngsters
traffickers
dependence
globalwarming
signaled
acceptable
pilot
lottery
clouds
subsequent
cells
commonly
civic
likelihood
spotlight
concerning
seemingly
advocating
gordon
abc
extending
matt
vendors
gunmakers
poised
jon
accompanied
distributed
ridiculous
governing
financing
implementation
vocal
1960s
rid
affecting
comfortable
explaining
actor
karen
edition
educate
stick
yard
taxpayer
files
spends
attract
minnesotas
ralph
ticket
lesser
guaranteed
prosecutions
dear
shocked
glock
inconvenient
mountains
cite
familys
extension
engineers
wisdom
profound
appealing
permanently
object
whenever
fault
guide
vision
rail
shore
feelings
crew
checking
aspects
seize
leaf
muslims
outlawed
aggravating
backlog
ramsey
tancredo
buildup
inevitable
skeptical
accounting
arrival
summers
cabinet
revised
competing
forever
languages
decides
participation
overcome
links
jesse
kitchen
mexicos
jesus
lifted
harrisburg
unauthorized
gains
traditionally
organizing
objected
potent
classified
projections
connected
ben
determining
jason
peak
legacy
reversal
weighing
antonin
feed
dismiss
contracts
oh
fiveyear
surveyed
delivery
shed
clarence
detain
backgroundcheck
accidentally
reminder
ignoring
detroit
confronted
beliefs
identical
humanity
determination
loud
agreeing
alike
bag
injections
ferguson
shock
seconds
bucks
knives
honduras
deporting
windows
ratified
eating
economist
mere
refuge
alarming
transport
tremendous
praise
lesson
absolute
band
collection
detail
concert
punished
corruption
lunch
unlawful
uphold
male
discount
16yearold
sexually
weigh
epas
bold
recognition
shortterm
aboard
updated
habits
adoption
football
21st
centuries
skepticism
weaken
blasted
polling
experiment
activism
portrayed
highlight
celebrate
beer
circulation
modified
billboard
offensive
casey
luther
broward
sgt
succeeded
reasonably
dire
difficulty
suburb
eve
struggled
gores
describes
disclosed
sections
mile
participated
sudden
meets
historically
titled
noon
permitting
factory
confidence
suggestion
bell
deliberated
kid
tightening
documentation
violators
electrocution
civilians
legalize
noaa
reveal
damaging
metric
rice
cooperate
welcomed
oversight
mandates
legislator
briefly
beings
perfectly
endorse
disagreed
backlash
disputes
showdown
inspectors
flags
10th
postal
mistakes
rage
grocery
grief
naturalized
fbis
professionals
coauthor
instances
stanford
isolated
visits
mandated
highlighted
confrontation
venture
focuses
finished
lane
caribbean
tea
korea
literally
separately
merchants
missourians
channel
operated
safely
element
bags
festival
turner
pickup
compiled
lucky
insanity
privilege
guantanamo
burns
spirit
httpwwwnytimescom
polluters
neck
interior
highlights
premature
automobile
misconduct
investigated
imminent
harbor
roger
returns
griffin
curtail
spitzer
scare
infrastructure
nevertheless
hudson
pays
wore
dollar
throat
victor
super
taught
counting
eliminated
ariz
processed
dominated
bennett
print
casinos
cbs
marches
pretrial
accomplice
automakers
unusually
boycott
steadily
contributes
troubling
pakistan
emphasized
ranked
triple
located
gates
embassy
glass
pelosi
carnahan
writers
invasion
taste
symbolic
root
soft
johns
bunch
wear
chronic
cable
wright
4th
morales
nativeborn
charlton
passport
conceded
planets
labels
affordable
devoted
grandmother
councils
emitted
criticizing
anne
reflected
accomplish
