said
gun
state
would
law
year
court
marriage
new
one
death
people
right
bill
gay
say
last
two
tobacco
u
samesex
could
federal
ban
president
time
also
change
case
city
climate
issue
weapon
mr
national
house
control
week
group
county
first
public
day
percent
school
firearm
smoking
american
republican
penalty
make
many
amendment
couple
judge
shooting
even
global
senate
attorney
may
cigarette
support
like
supreme
vote
warming
country
life
measure
company
police
get
month
emission
decision
since
nation
government
rifle
florida
health
united
take
way
gas
legal
check
official
california
legislation
three
murder
want
million
member
crime
appeal
child
whether
show
washington
including
association
violence
congress
man
york
woman
second
district
made
handgun
dont
industry
justice
background
today
execution
tuesday
much
use
nra
general
sale
campaign
union
come
democrat
report
carbon
plan
need
study
found
wednesday
another
monday
part
think
action
ruling
debate
world
family
lawyer
policy
used
thursday
go
gov
criminal
effort
bush
high
next
administration
without
political
trial
leader
still
according
assault
home
greenhouse
told
going
among
put
energy
sentence
office
clinton
jury
carry
university
back
act
well
permit
question
friday
proposal
effect
obama
department
ago
power
owner
tax
killed
know
convicted
number
yesterday
long
passed
committee
called
lawmaker
former
already
place
center
defense
problem
every
white
killing
news
must
student
system
smoker
civil
call
smoke
legislature
work
four
prison
virginia
governor
prosecutor
advocate
john
voter
record
program
benefit
business
keep
local
recent
several
scientist
help
capital
good
see
might
allow
sen
set
area
church
level
five
least
thats
officer
lawsuit
le
thing
asked
constitutional
st
shot
others
money
rule
cost
environmental
safety
research
san
never
evidence
mayor
drug
end
increase
citizen
america
council
believe
likely
stop
give
agency
victim
billion
community
hearing
face
concealed
around
mass
far
point
past
march
democratic
license
fact
saying
majority
constitution
become
took
guncontrol
georgia
across
punishment
person
major
came
dioxide
colorado
purchase
reduce
statement
little
proposed
texas
cause
argument
men
yet
nearly
regulation
director
conservative
charge
senator
expected
six
executive
partner
stand
protection
away
human
step
voted
later
side
chief
enough
row
approved
force
supporter
domestic
lesbian
rep
conference
hand
im
period
mean
similar
decade
left
opponent
hour
arm
reason
inmate
limit
order
dealer
meeting
though
sign
temperature
plant
restriction
pas
election
party
buy
trying
car
missouri
trump
result
organization
authority
something
enforcement
however
making
bar
married
air
rate
move
important
cut
filed
maryland
allowed
candidate
individual
street
whose
challenge
letter
let
black
product
protect
board
claim
earlier
night
lead
store
june
attack
north
circuit
doesnt
wrote
clear
look
poll
fight
big
panel
brady
cancer
find
young
deal
didnt
got
line
matter
require
fuel
began
jersey
event
view
risk
scheduled
sentenced
history
michael
almost
service
head
position
taking
seek
illegal
science
announced
agreement
employee
kill
within
prevent
ruled
released
ad
nothing
building
lobby
hope
louis
early
talk
lot
bear
process
pay
mother
society
spokesman
instead
robert
idea
george
opinion
outside
resident
care
future
private
anyone
able
held
charged
waiting
given
david
based
recently
legislative
die
fire
restaurant
current
james
massachusetts
using
ground
guilty
cant
concern
standard
security
earth
better
taken
marry
there
age
signed
social
executed
done
international
although
consider
really
job
word
expert
mental
kind
activist
real
friend
often
known
sunday
threat
term
response
led
include
r
water
ever
along
favor
someone
top
comment
impact
legally
address
presidential
park
attempt
south
toward
killer
press
ballot
review
went
continue
hold
open
settlement
final
despite
ordinance
west
juror
suit
data
list
issued
minnesota
half
required
session
july
illinois
agreed
price
decided
getting
information
different
try
mark
seeking
source
banning
april
best
cannot
disease
begin
parent
massacre
rather
sell
small
november
free
legislator
lethal
failed
target
possible
opposed
feel
late
representative
added
magazine
thousand
fund
interest
wanted
start
proposition
post
full
semiautomatic
run
largest
became
defendant
strong
jr
name
stay
dead
wont
wrong
atlanta
live
adult
argued
son
beach
died
decide
college
turn
injection
francisco
morris
saturday
dozen
market
interview
philip
brown
seven
initiative
conviction
reported
provide
researcher
great
allowing
average
rejected
provision
message
smith
fear
chance
thought
needed
kid
rise
example
wife
accused
key
latest
offer
battle
sense
large
goal
opposition
body
tell
nicotine
paul
request
per
close
coal
read
natural
tried
committed
theyre
ownership
carolina
isnt
buyer
story
manufacturer
pennsylvania
lung
spent
medical
oil
morning
fall
sea
working
certain
common
sent
politician
potential
war
dc
relationship
leading
special
degree
always
serious
soon
commission
amount
economic
he
document
religious
belief
seen
growing
atmosphere
armed
sure
chairman
behind
received
higher
near
environment
meet
finding
maker
father
congressional
bring
longer
together
vice
role
j
ask
raise
professor
push
hear
richard
project
significant
anything
lost
hundred
witness
assembly
william
heart
economy
coming
old
eight
access
movement
ill
capitol
carrying
violent
answer
secretary
politics
unconstitutional
equality
town
century
bad
pollution
sold
dangerous
brought
third
speech
sheriff
lower
campus
probably
hard
gave
race
ammunition
attention
hill
simply
scott
clean
damage
technology
editor
weather
course
food
either
room
responsible
especially
annual
subject
showed
light
refused
love
supported
article
heat
increased
agree
scientific
medium
freedom
seems
military
institute
considered
banned
wedding
chamber
summer
m
form
hall
survey
rising
thomas
yes
personal
turned
front
denied
demand
treaty
recognize
heard
ice
calling
gop
nine
actually
victory
advertising
bureau
pack
caused
budget
short
safe
philadelphia
pistol
available
share
mentally
gore
vehicle
worker
coalition
connecticut
martin
bloomberg
buying
electric
included
joined
antismoking
parole
minute
testimony
newtown
block
floor
focus
jan
obamas
involved
chicago
dr
requiring
nationwide
liberal
spring
teacher
requires
powerful
approach
cigar
single
approval
reduction
changed
following
hospital
daughter
quit
kyoto
danger
particularly
editorial
teenager
book
reducing
charles
difficult
allows
oppose
grant
possession
chair
parkland
insurance
passage
bullet
denver
terrorist
alcohol
paper
solution
perhaps
test
choice
started
china
property
everyone
moment
fbi
fossil
offered
difference
ocean
illness
dollar
rally
team
doubt
opportunity
sought
education
rest
speaker
equal
pressure
quickly
create
declined
struck
january
deadly
husband
ceremony
activity
save
introduced
innocent
commissioner
december
firm
win
davis
tragedy
boy
agenda
mind
elected
lawabiding
columbia
series
published
convention
helped
true
ordered
w
requirement
warning
homicide
feb
licensed
return
raised
shop
planet
model
discussion
release
beyond
includes
count
reached
figure
staff
weve
regulate
concerned
factor
looking
site
pm
running
designed
bob
asking
version
investigation
produce
dec
author
noted
range
fla
arrested
plea
resource
type
protest
suspect
sandy
present
understand
defend
oklahoma
prevention
existing
happened
mile
la
epa
aimed
island
due
practice
sept
commitment
reporter
necessary
total
worked
watch
heterosexual
development
trade
senior
v
robbery
bay
joe
reach
l
slaying
youre
petition
customer
trend
road
written
effective
felon
argue
brother
leave
stock
gunman
sponsor
selling
minor
land
douglas
wake
los
giving
forward
value
tom
drive
associated
palm
appeared
institution
immediately
unusual
population
oct
urged
date
ive
affect
youth
greater
intended
considering
impose
murderer
journal
verdict
clerk
consequence
play
reasonable
johnson
biggest
partnership
voting
assistant
loophole
happen
wasnt
guy
declared
else
machine
stricter
responsibility
easy
selfdefense
statewide
highest
tampa
created
region
nov
teen
purpose
saw
account
e
spending
voice
vermont
jim
firstdegree
ability
homosexual
hit
break
seem
tough
conn
additional
resolution
join
round
secondhand
delay
separate
stopped
analysis
met
inside
video
club
veto
appears
remains
agent
page
hook
elementary
farmer
socalled
class
movie
jail
alone
spoke
angeles
television
follow
moved
spend
sex
spokeswoman
increasing
avoid
forest
add
door
girl
repeal
expect
shift
sponsored
tougher
minister
critic
certainly
carried
discrimination
previous
remain
living
upheld
williams
apply
wouldnt
foot
cuomo
leadership
curb
holding
talking
granted
weekend
ohio
arent
catholic
specific
compromise
unless
primary
deputy
recognition
application
southern
traditional
estimated
changing
reform
central
electricity
east
clearly
writer
doctor
usa
sentencing
controversial
popular
statute
consumer
compared
fee
sexual
cover
pending
gone
drought
field
strategy
followed
reynolds
continued
suggested
donald
developing
february
condition
fellow
shooter
note
whats
loss
largely
facing
guard
burning
apparently
arizona
language
fine
green
described
crowd
extreme
possibility
lobbyist
prisoner
beginning
announcement
fired
shotgun
planned
package
receive
lack
fighting
manager
prosecution
pushing
adopted
god
forced
training
proponent
poor
showing
lee
alternative
file
pleaded
knew
paid
wait
simple
everything
enacted
arrest
space
hunting
financial
condemned
judiciary
co
foundation
ended
broad
al
piece
christian
felony
twice
superior
recognized
finally
main
column
airport
inc
online
eye
brand
wounded
plaintiff
incident
mike
violation
king
cited
throughout
vega
mostly
nature
bank
bought
european
aug
huge
status
truth
opened
accept
moving
b
expand
sound
colleague
addition
supporting
believed
ryan
prove
santa
lobbying
suicide
credit
promise
experience
station
limited
detail
felt
seemed
related
option
mom
prohibit
atmospheric
funding
historic
raising
starting
overturned
wisconsin
focused
daily
sued
appear
provided
andrew
habit
seat
antigun
harm
ready
brief
determine
columbine
wind
october
standing
estimate
fair
revenue
generation
statistic
dropped
minority
whole
ahead
august
willing
backed
mandatory
conducted
stephen
marketing
worth
respect
putting
joseph
moral
reality
growth
maybe
testified
f
tv
lock
named
previously
speaking
adding
middle
passing
investigator
barack
low
neither
calif
kept
bipartisan
behalf
legalize
shoot
storm
defeat
trigger
influence
judicial
produced
concluded
approve
easier
kennedy
prohibited
currently
email
arguing
treatment
newspaper
reagan
afternoon
smokefree
advocacy
c
production
truck
discus
expressed
worst
definition
commit
fewer
militia
orlando
negotiation
send
none
speak
courtroom
facility
keeping
rev
sport
strict
visit
rape
relative
hurricane
tree
conclusion
increasingly
progress
september
entire
build
landmark
progun
situation
restrict
brooklyn
utility
delegate
arctic
game
involving
serve
cold
opposes
endorsed
bishop
critical
decline
safer
basis
renewable
liberty
openly
boston
potentially
abortion
cap
otherwise
utah
spouse
smoked
jones
choose
stoneman
particular
table
harris
nuclear
protocol
hurt
drop
device
driver
represents
basic
sometimes
failure
warned
overall
driving
mexico
rick
hillary
obtain
counsel
motion
holder
walker
recommendation
stage
upon
allen
veteran
retired
neighborhood
oregon
drew
deny
suggest
occurred
threatened
defender
meanwhile
behavior
couldnt
juvenile
gunrights
chris
exactly
served
generally
wayne
winter
elsewhere
shouldnt
conduct
sander
image
abuse
consensus
referendum
wilson
gathered
hawaii
success
northern
phase
walk
lose
worry
sister
becoming
culture
jurisdiction
foreign
leaving
pushed
ensure
jose
solar
computer
ton
track
section
priority
wave
lake
japan
methane
task
radio
stood
fully
indeed
exchange
manhattan
injury
represent
operation
suggests
sort
wed
marjory
un
presented
straight
unlikely
enact
edward
concealedcarry
supply
rose
miami
patient
cop
promised
scene
leaf
emotional
nonsmoker
blame
except
wall
criticism
link
caught
contribution
regarding
season
eventually
claimed
quite
adam
cent
setting
original
reaction
canada
strongly
continues
picture
violated
easily
enforce
politically
virtually
performed
client
pretty
comprehensive
opening
miller
specifically
longterm
pattern
predicted
remark
shown
signature
guarantee
blood
environmentalist
urging
h
conversation
host
opposing
maine
imposed
independent
dispute
method
repeatedly
wish
western
aide
richmond
various
planning
linked
protecting
division
neighbor
advance
iowa
circumstance
card
rural
determined
directly
ally
survivor
faced
offering
summit
red
procedure
instance
stronger
reduced
telling
dna
worse
coast
highly
criticized
meant
cruel
thinking
murdered
limiting
base
frank
chemical
aside
effectively
challenged
turning
provides
here
commercial
faith
prohibits
ultimately
hasnt
extend
fda
complaint
reading
severe
returned
gain
lapierre
immediate
coverage
combat
flood
unit
phone
gang
prepared
contract
seriously
writing
challenging
divided
anthony
strike
christie
fourth
owned
sue
alaska
warrant
analyst
photo
ran
registration
prohibition
stance
vowed
industrial
loaded
paris
developed
acknowledged
hotel
ten
respond
albany
mary
promote
litigation
cutting
worldwide
minimum
montgomery
fell
daniel
ronald
automatic
licensing
feeling
crisis
filing
instant
clemency
looked
michigan
specie
fundamental
affair
web
pain
rampage
peter
sweeping
overturn
successful
seller
internet
connection
terrorism
correction
publicly
pointed
aim
attempted
apartment
murdering
admitted
thus
direct
creating
racial
pastor
whatever
complete
adopt
duty
applied
bond
efficiency
complex
intent
supposed
happens
prominent
affected
exception
deathpenalty
meaning
fatal
usually
providing
evening
eligible
theater
larger
blue
aid
va
happening
steve
highcapacity
slow
organizer
serving
workplace
universal
atf
star
explain
draw
n
injured
learned
causing
fort
helping
kelly
prompted
mention
transportation
spot
deep
warmer
consideration
bump
valley
topic
representing
appropriate
cruz
shall
amid
baby
urban
surprise
unanimously
registered
mountain
bit
outcome
reelection
patrick
kansa
army
significantly
recommended
percentage
anywhere
refuse
issuing
lie
obtained
europe
ought
purchased
taxpayer
dramatic
river
retailer
roughly
alleged
regional
heavy
older
suspected
draft
network
acting
cell
possibly
endorsement
improve
hot
tie
mandate
widely
prospect
shortly
walked
remove
losing
responded
offender
quality
placed
hunter
addictive
registry
illegally
principle
heavily
grand
organized
bombing
applicant
search
hampshire
trip
bringing
played
fatally
emergency
us
becomes
id
brian
defeated
closing
playing
remember
audience
rare
nominee
dismissed
thompson
barred
urge
closer
pledge
established
obvious
prevented
regardless
kerry
vast
closed
harder
folk
violate
expanded
housing
dan
jackson
angry
heattrapping
aggressive
younger
register
overwhelming
expensive
citing
farm
box
sensible
owen
feature
howard
cast
award
bus
border
methodist
firing
warm
gary
giant
zone
honor
rj
indicated
murphy
define
treated
purchaser
intense
mississippi
corporation
attitude
animal
eliminate
adviser
corporate
romney
dean
reject
handle
de
spread
film
relatively
league
pope
arkansas
schumer
investment
profit
gathering
academy
nonprofit
develop
modern
g
downtown
finance
striking
identified
violates
protected
larry
cash
religion
unfortunately
eric
halt
liability
militarystyle
worried
questioned
rain
headed
jay
tim
thanks
backing
suffered
error
camel
encourage
legitimate
household
stolen
forum
absolutely
offense
orientation
momentum
india
baltimore
muhammad
unmarried
tool
joint
henry
lived
proof
allegedly
theory
commerce
multiple
fate
supervisor
havent
happy
longtime
pulled
broader
remained
hoped
louisiana
terry
giffords
seeing
administrator
travel
wonder
dealing
theyve
hoping
proceeding
learn
represented
employer
window
double
broke
watched
peace
payment
therefore
moderate
stated
conflict
income
pursue
timothy
pledged
trouble
blocked
write
posse
hate
jerry
british
corp
accepted
p
deciding
ar15
margin
secret
bid
surface
consumption
massive
explosive
normal
attended
avenue
character
walking
notice
direction
dennis
agriculture
protester
detective
retarded
smokingrelated
telephone
facebook
player
van
relation
misdemeanor
headline
wood
impossible
fast
conspiracy
grow
reader
sat
kidnapping
struggle
false
removed
prince
kentucky
appealed
pollutant
burden
airline
nevada
accord
crop
treat
closely
handful
renewed
understanding
unable
patch
knife
negotiator
saving
contribute
producer
flight
posted
denying
user
backer
prohibiting
legalizing
substantial
built
balance
sitting
onto
regular
tallahassee
overwhelmingly
innocence
anderson
continuing
traffic
commonsense
internal
blamed
attend
essentially
fought
cdc
deeply
colo
wide
el
permitted
launched
database
restricting
defending
career
controversy
referring
aware
surprised
counter
claiming
addiction
williamson
greenhousegas
associate
expanding
durham
9th
girlfriend
split
unlike
familiar
welcome
wound
display
nixon
valid
paying
numerous
dole
plus
alliance
dick
accident
contrast
pose
favored
quick
moratorium
pick
civilian
fulton
teenage
melting
glacier
twothirds
tech
suing
atlantic
moore
marlboro
crucial
appointed
antitobacco
twitter
active
reporting
yorkers
signal
collins
broken
preventing
susan
fix
nichols
waste
modest
sarah
covered
pat
vulnerable
flow
barring
surgeon
kevin
disaster
nasa
mistake
sick
appearance
settled
crack
baker
unprecedented
announce
perry
deserve
owning
mccain
outlaw
mall
judgment
deathrow
widespread
testing
hunt
aurora
entitled
entered
management
regulating
clip
pull
regulated
metro
volunteer
unanimous
nelson
jack
talked
addressed
hardly
nationally
nearby
ending
attacked
gunrelated
burn
truly
shes
ken
barbara
opposite
suburban
path
addressing
parking
exemption
courthouse
medicaid
sniper
recognizing
annually
extra
execute
enter
flooding
obviously
polar
advantage
smaller
begun
immigration
failing
marked
filled
legalized
fox
sun
brain
sharply
usual
billboard
mcveigh
gayrights
nc
coastal
implication
recall
combined
constitutionality
cry
joining
newly
omalley
tighter
stabbed
website
score
ted
treating
clara
positive
grew
capacity
stake
sharp
watching
alabama
lewis
defined
homosexuality
schwarzenegger
vetoed
cleared
taylor
doma
industrialized
settle
establish
location
hell
garden
beat
indoor
override
portion
satellite
fail
variety
tear
deadline
werent
ny
aftermath
sending
maintain
music
dallas
soldier
casino
oped
identify
merely
realize
tradition
cross
survived
signing
predict
obligation
professional
merit
tactic
steven
fairfax
ashcroft
chose
binding
gray
occur
size
correct
demonstration
donation
visitor
reid
incentive
manmade
assessment
imagine
flag
core
delayed
appellate
exercise
jefferson
advertisement
snow
queen
manner
biden
indiana
loved
confirmed
trafficking
manufacture
arnold
coalfired
rank
imposing
blow
medicine
christopher
repeated
square
dakota
sporting
unclear
rich
pound
fahrenheit
tied
highprofile
establishment
ring
temporary
rubio
weight
feinstein
anniversary
wearing
divorce
founder
material
dramatically
chapter
importance
achieve
1990s
suggesting
mission
graham
prayer
clergy
ultimate
suffer
rival
odds
rapidly
headquarters
subcommittee
divide
robinson
hammer
madison
fifth
winning
defended
locked
boulder
dying
consistent
purchasing
beating
transfer
perform
nomination
pacific
delivered
saved
indian
declaring
shared
actual
somebody
branch
commonwealth
del
privilege
californian
rhetoric
quarter
please
trust
morgan
eastern
memo
defining
prime
proud
pipeline
preliminary
notion
solve
pride
noting
comply
arrived
iii
missing
harry
petersburg
immunity
disagree
speed
meaningful
boost
equally
miss
exposure
tennessee
mccarthy
wesson
auto
england
gasoline
male
intention
persuade
entirely
amend
emotion
threejudge
applies
assassination
heller
targeted
baseball
alive
convinced
disappointed
everybody
train
enjoy
pass
desire
wildlife
ambitious
cycle
greatest
grown
surrounding
pressing
participant
communication
tonight
investor
completed
exposed
african
extended
rush
rock
reverse
strengthen
lesson
follows
match
partisan
highway
constituent
radical
interested
jeff
element
demanding
encouraging
equivalent
vow
desk
iraq
hole
harmful
cloud
slightly
expansion
deliberation
passenger
suffering
nobody
pact
climatechange
explained
faster
classroom
congressman
village
unique
houston
protects
voluntary
substance
guest
fresh
childrens
pair
recorded
bottom
debated
prepare
outdoor
initially
maximum
abc
smart
gaymarriage
baptist
actor
everywhere
ford
bernardino
restrictive
possessing
embrace
completely
promoting
threatening
reversed
rapid
emerged
drawn
pew
ignored
item
seized
originally
born
conservation
extremely
typically
contend
camera
gotten
fraud
revealed
dog
expense
scalia
capandtrade
perfect
knowledge
uncertainty
cultural
surprising
objection
marshall
concept
fan
fit
introduce
carnage
prospective
discovered
initial
aspect
selection
cool
suburb
contrary
courage
insisted
properly
picked
bible
economist
co2
mentioned
tomorrow
exist
outrage
submit
narrow
broadcast
threw
rating
nightclub
nonsmoking
replace
advanced
cheap
swing
demonstrate
divisive
fairness
proper
spare
participate
cite
clark
contentious
personally
successfully
deserves
testify
grade
denial
reflect
delaware
scenario
prediction
discussed
resolve
female
shield
indictment
refusing
scrutiny
retail
formal
breaking
chain
corner
referred
prior
federally
acted
platform
chuck
gift
oceanic
pace
healthy
bomb
native
russia
kick
recommend
formed
physical
surely
enforcing
collect
defines
handed
confessed
generate
automobile
announcing
art
warner
thank
rarely
epidemic
bigger
minneapolis
straw
nancy
regulatory
journalist
nj
owns
tragic
evil
rabbi
violating
liggett
ignore
unfair
afraid
scale
height
driven
intergovernmental
sector
who
bag
tend
formally
presence
ross
terror
buck
sevenday
factory
hillsborough
ed
stem
gap
escape
apparent
anger
membership
directed
teaching
lay
partly
physician
harvard
interstate
sight
receiving
requested
alan
moussaoui
marrying
sacramento
plane
anybody
highlight
primarily
shut
secure
bridge
fill
preparing
listen
ongoing
recover
awaiting
horrific
slain
custody
mainly
argues
knowing
motor
resume
identity
toll
orange
ray
pronounced
roll
bruce
ii
proved
cheney
pool
floridian
resulted
guilt
construction
ozone
preserve
ron
australia
mine
hollywood
drawing
campbell
complicated
founded
forcing
frequently
sierra
plain
flawed
denomination
threeday
suddenly
healthcare
convict
raped
cooling
hopeful
estate
detailed
zimmerman
text
craig
17yearold
exists
code
labor
bronx
municipality
horror
theyll
seattle
tiny
france
inch
string
offset
compelling
declare
sit
roof
butt
granting
label
jewish
reinstated
efficient
principal
acknowledge
remaining
confident
design
negative
contributed
era
allegation
exempt
afford
permission
ticket
episcopal
midnight
correctional
foster
spared
lastminute
warmest
memorial
unveiled
contest
narrowly
import
camp
examine
kenneth
category
idaho
fairly
identification
yard
carter
clause
assaultstyle
cleaner
globe
convince
matthew
weak
jennifer
guess
screen
contact
warren
gunned
anticrime
municipal
skeptic
feared
praised
tide
montana
guideline
reference
convenience
sheet
stayed
sparked
considers
reviewing
francis
teach
endorse
memory
tape
chest
burglary
pleased
germany
marine
immigrant
proceed
resulting
dekalb
invited
tony
officially
reconsider
gender
rob
martinez
cobb
costly
decrease
stalled
practical
terrible
lifetime
attempting
mount
1980s
cook
surge
dinner
ceo
rhode
donor
councilman
cox
extending
suggestion
caucus
toughest
strip
slaughter
parade
franklin
lt
jeffrey
enormous
lawrence
adoption
manufacturing
suspended
lowest
object
hired
complained
anyway
attending
republicancontrolled
executing
britain
express
deliver
mix
viewed
hb
relief
apart
oral
indicate
raleigh
gained
serial
heston
toomey
oakland
bound
acre
mexican
fiveday
discount
contends
controlled
shopping
sixth
hair
personnel
regularly
certificate
spree
trap
explanation
extent
treasury
color
celebrate
enforced
uphold
honest
stabbing
arming
everytown
rjr
questioning
duke
generated
combination
dcalif
listed
interpretation
recovered
outofstate
concealedweapons
committing
diego
contributing
projected
plastic
nebraska
chile
ok
drove
sad
sorry
pinellas
chapel
shifting
landscape
asks
contended
trail
enemy
stringent
extensive
sanction
engaged
operating
christmas
necessarily
creates
drinking
camden
windsor
cnn
punitive
reno
submitted
resistance
northeast
fred
silence
soil
experienced
wild
performance
funded
basically
shell
mo
charleston
canadian
mail
throw
blessing
smokeless
disabled
discourage
wildfire
implement
perspective
responding
celebration
interesting
mitt
mouth
reviewed
shifted
fly
threaten
contains
promising
motivated
mcauliffe
patrol
weekly
precedent
rely
learning
regard
devastating
collected
regulator
embraced
assertion
silver
mitchell
griffin
bias
enthusiast
lawful
gunfire
barely
sand
equipment
inspired
uncertain
maintained
hailed
falling
packed
polling
describe
restraining
georgian
holmes
stark
orleans
studying
bird
retreat
threatens
awareness
appropriation
plenty
justify
contained
reflects
acceptance
stopping
pa
ann
amended
deter
congregation
indicted
shape
content
proposing
chinese
mainstream
documentary
declining
foe
eager
troubled
curbing
lisa
stick
handling
evans
pataki
tropical
map
somewhat
newsom
belt
welfare
stevens
q
tour
unnecessary
filibuster
patron
letting
alexandria
karen
uniform
lax
gum
lifestyle
austin
timing
declaration
refusal
designated
destruction
hottest
controlling
logic
copenhagen
focusing
advice
earned
understood
thrown
root
gregory
strongest
dianne
temporarily
procedural
authorized
grove
abuser
africa
reaching
metal
restricted
hazard
blunt
brings
longstanding
deemed
switch
indication
stepped
sb
somehow
gunshot
malvo
widow
destroy
availability
lighting
misleading
improvement
essential
comparison
evangelical
ward
tackle
encouraged
studied
roy
relevant
delta
theft
fingerprint
tucson
reef
dream
greg
moreover
steady
forecast
demanded
route
postdispatch
routine
10th
byrd
lawenforcement
assaultweapons
nice
insist
noaa
posed
difficulty
faculty
poised
gather
obtaining
bernie
demonstrated
fallen
md
hero
abolish
accomplice
classaction
urgent
writes
heating
1970s
involves
undermine
bloombergs
unarmed
context
abandoned
touch
copy
experiment
survive
dave
laboratory
capture
crist
edition
scheme
totally
examined
gulf
qualify
reputation
ridge
russian
accidental
via
concert
pocket
consistently
birth
coleman
cocaine
master
stanley
inaction
inevitable
holiday
propose
quietly
jumped
grower
marijuana
parker
aggravated
expects
delegation
burned
technical
urgency
port
matt
berkeley
involve
golden
excuse
disability
stadium
outlawed
shame
prosecuted
seconddegree
lgbt
tobaccorelated
net
struggling
capable
substantially
publicity
replaced
fiscal
forget
involvement
definitely
intend
crazy
pasco
cooper
vending
barr
unlicensed
plead
trading
quoted
reportedly
spoken
dark
elderly
mercy
janet
kessler
catch
catastrophic
consultant
tighten
fed
typical
reservation
hidden
phrase
halted
arrangement
channel
frustration
minnesotan
tired
severely
giuliani
abujamal
ak47
managed
jason
ap
rational
featured
frequent
celebrity
pressed
sentiment
upset
instruction
sportsman
linda
twin
sam
gunshow
climatic
chosen
conventional
remarkable
commentary
drafted
hire
blocking
permanent
pro
scholar
serf
targeting
inspector
clinic
africanamerican
legalization
permitting
launch
graduate
accurate
favorite
pension
restore
theme
democracy
identical
wright
gubernatorial
manchin
transgender
oppositesex
prize
stuff
presidency
component
schedule
upper
avoided
winner
depending
ranging
extraordinary
sample
heated
russell
informed
progressive
youve
eighth
admit
enacting
transaction
revolver
harrisburg
cessation
pipe
influential
vital
charlie
busy
observer
accepting
zero
poverty
traditionally
waited
tex
heading
sullivan
founding
jonathan
conscience
bail
springfield
walter
funeral
clayton
raping
discriminatory
infringed
punish
stress
indicates
emitter
passion
k
polluter
historical
grassroots
engage
tank
carefully
bed
symbolic
roman
confession
ease
silent
vendor
webb
intelligence
rejecting
dry
todd
jon
function
absence
northwest
contributor
sensitive
answered
lane
pointing
bright
normally
pittsburgh
guide
concentration
gerald
incumbent
backlash
sc
wouldbe
corbett
pardon
bisexual
antigay
reed
gate
hanging
farreaching
simon
missed
setback
lobbied
herring
recalled
olson
reprieve
senseless
gross
hotter
destroyed
prescription
quiet
mixed
guaranteed
pentagon
supportive
sufficient
arena
distribution
quitting
comfortable
gabrielle
gilmore
4th
gunsafety
adopting
emit
retirement
publication
privately
observed
jeb
solely
littleton
diaz
alderman
barnes
trayvon
tweet
awarded
warn
breathe
strength
applying
lift
risen
ordinary
antonin
governing
vocal
pregnant
lengthy
trained
finger
prop
collection
phil
denounced
dear
independence
negotiated
appearing
weigh
attributed
collective
evolution
trace
concerning
jump
showdown
cohen
confrontation
jesus
outright
casey
producing
assistance
gavin
screening
proven
asthma
london
signaled
educator
singer
measured
reasoning
resolved
confusion
extremist
dny
handled
competent
injunction
chewing
revolution
barry
greatly
ratified
nowhere
mitigating
conclude
succeed
counterpart
wear
irresponsible
print
fails
turner
spotlight
undercover
hadnt
advisory
participating
administrative
contain
weaken
circle
band
fundraising
storage
20th
rejection
lab
tweeted
denies
hed
realized
arlington
decides
islamic
champion
wore
loving
symbol
scope
famous
achieved
alter
gallup
stream
nevertheless
resort
disturbing
assume
disclosure
pilot
besides
historically
praise
missourian
11th
liable
painful
shoulder
superintendent
presbyterian
performing
lott
lorillard
drilling
title
spirit
rolling
prefer
visited
agricultural
solid
stuck
laid
premise
bradley
kicked
enjoyed
navy
junior
childhood
throat
muslim
deadliest
peterson
nypd
tobaccofree
intensity
doubled
reversal
automaker
sustainable
rio
french
recognizes
humanity
reserve
affirmed
bitter
qualified
tourist
array
investigate
depend
mcconnell
visiting
occasion
doctrine
bell
barrier
assemblyman
ga
marion
ineffective
disturbed
christ
privacy
gunfree
voterapproved
ecigarettes
seemingly
midwest
fierce
melt
occurring
investigating
agreeing
celsius
tip
optimistic
structure
safeguard
debt
gold
ralph
traced
dismiss
willingness
premium
upcoming
justified
hurdle
paterson
peer
horrible
ehrlich
addicted
beaten
toxic
inconvenient
climatologist
phenomenon
projection
advocating
ecosystem
monitoring
compliance
stanford
globalwarming
useful
listening
wisdom
wealthy
concludes
volume
debating
plot
tone
stone
jesse
anymore
cousin
broward
nuptials
botched
gunmakers
nobel
automatically
intervene
educational
smell
swift
careful
onethird
barrel
alexander
oak
ethic
dissent
dad
fundraiser
weighing
objected
drink
loud
disagreed
marched
upholding
overturning
prosecute
electrocution
heinous
deterrent
glock
surveyed
likelihood
rage
library
discussing
respondent
dependence
emerging
marco
southeast
compare
festival
overcome
covering
horse
shock
approving
lifted
nathan
tucker
brutal
bennett
carol
vision
negotiating
southwest
shortage
aggressively
attached
toy
slowly
acceptable
obstacle
german
engineer
unrelated
arthur
eve
dedicated
reminder
disagreement
lesser
hatch
traveled
jimmy
promotion
lying
cbs
separately
census
interracial
considerable
mechanism
coloradan
stretch
nonetheless
fish
instrument
competitive
grave
yield
voiced
aggravating
underscore
attracted
christine
kitchen
quinn
charlotte
employment
anne
discretion
sky
eat
premature
buildup
circulation
affecting
brazil
glass
1960s
cooperation
length
friendly
activism
academic
cartoon
hudson
recreation
ore
forever
ferguson
offensive
wording
bench
ridiculous
robbed
youngster
backgroundcheck
mere
doug
rocky
buried
monitor
reliable
habitat
intends
potent
elizabeth
confidence
lifelong
confront
visible
feed
metropolitan
selected
prompting
crowded
outspoken
graphic
shocked
walkout
gwinnett
brook
unexpected
compound
flower
reveal
existence
rail
blog
update
depends
distributed
objective
apple
zoo
mill
merchant
reluctant
carl
oh
disorder
determination
cable
portrayed
clarence
ninth
gordon
luther
boyfriend
alarm
passionate
beer
metric
devoted
sooner
ride
succeeded
skeptical
prompt
evolving
ben
inadequate
absolute
quota
accidentally
extends
photograph
accusing
framework
attacking
wyoming
technique
improving
loan
whenever
creation
intervention
perfectly
somewhere
21st
modified
episode
determining
cheer
leak
inquiry
repeat
distinction
seize
tested
delivery
reserved
leg
grandmother
kaine
blasted
coordinator
football
unfairly
theodore
nurse
undergo
imprisonment
recipient
being
financing
similarly
gallon
empty
tar
accompanied
deficit
paint
biological
extension
struggled
bold
sends
profound
appealing
ordering
collector
ramsey
israel
grief
consecutive
keith
commonly
legacy
edge
explaining
roger
chart
mounting
knight
neighboring
boycott
style
renew
freed
lambda
negotiate
dirty
shore
layer
dropping
bunch
taste
captured
electronic
flaw
museum
super
certainty
ignoring
costa
conceded
scare
neck
exhibit
briefly
deliberated
forth
powell
lady
warehouse
pretrial
trafficker
stroke
approximately
measurement
anticipated
emitted
seventh
persuaded
profile
frustrated
diverse
reasonably
alameda
stable
routinely
differently
wallace
disclose
sexually
alike
lied
accountable
interviewed
coffee
legality
puff
assigned
noon
carnahan
racist
odonnell
mormon
classmate
charlton
export
dire
establishing
fraction
contributes
precisely
competition
kim
updated
walmart
overseas
attract
hispanic
enterprise
describes
sin
random
freeman
confronted
jacksonville
dominated
approached
residence
checked
vietnam
implemented
economics
coral
dependent
hide
coauthor
concession
explicitly
ball
fashion
ship
fortune
turnout
operator
comfort
lover
exxon
raymond
expression
distributor
venue
pete
antonio
prevents
listened
entrance
insanity
constitutionally
creek
19yearold
strangled
exonerated
strategist
trenton
damaging
carrier
invoked
safely
nicholas
voluntarily
mandated
participated
twoyear
unusually
fisher
logical
staffer
stewart
youll
insane
subsequent
hampton
highlighted
lone
blast
outlet
ear
adequate
strictest
poster
liquor
rallied
repealed
15yearold
nosmoking
ethanol
description
summary
alarming
titled
concrete
nino
featuring
threshold
boxer
triple
removing
theyd
crash
antarctica
spurred
peak
literally
void
celebrated
joke
residential
competing
shed
porter
solicitor
quote
plaza
revised
lounge
rid
jew
myers
underage
altria
ass
grip
assumption
remote
civic
salt
proportion
challenger
ranked
operate
commute
empire
notably
disappeared
lautenberg
stripped
postal
vincent
misconduct
portland
packing
escaped
jordan
attendant
recess
bedroom
sean
reinstate
allowance
auction
output
jet
alto
needle
gene
lunch
hansen
reflected
tremendous
counting
novel
shareholder
spike
preferred
hang
abroad
garcia
aisle
transcript
statehouse
ala
demonstrator
surrender
edgar
prejudice
interpreted
morale
appointment
skepticism
heel
implementation
10year
sidewalk
injustice
sudden
sole
dealt
discovery
reminded
improved
taught
eliminated
wing
altered
flame
agrees
gallery
outraged
cleveland
returning
fugitive
asserted
detroit
labeled
sharing
charging
16yearold
clarify
joy
proliferation
stating
chronic
accusation
expire
welcomed
integrity
bearing
english
leonard
encounter
norm
fe
conducting
punished
jean
winston
annapolis
televised
newark
revision
addict
sgt
silencer
subsidy
mercury
participation
franciscos
endangered
gut
observation
craft
chip
karl
breakthrough
eating
rogers
forefront
fault
1950s
distance
retain
wanting
tribe
accomplish
sr
arsenal
surgery
tossed
psychologist
limitation
highpowered
coach
codefendant
afterward
silicon
spends
petroleum
unknown
airplane
excerpt
jane
compiled
influenced
steadily
cabinet
blair
glenn
dialogue
preference
alongside
mann
morality
duck
ensuring
samuel
admission
discriminate
cheered
crusade
clearwater
marilyn
deranged
dale
gonzalez
mateo
diocese
adolescent
dignity
commuted
ruger
largecapacity
columnist
applause
bailey
educate
lloyd
latter
destructive
placing
pac
contention
perception
disclosed
contender
troop
crew
troubling
leon
connected
guidance
emphysema
wage
slogan
unfortunate
noticed
entering
unsuccessful
administered
valentine
stranger
iq
acquitted
rodriguez
romer
desperate
spur
fracking
posting
substitute
lieberman
advised
clothes
ipcc
ruth
finished
infrastructure
invite
absurd
etc
gaining
deserved
belong
proceeds
bobby
wounding
stunned
intact
cardinal
firefighter
township
touched
lucky
forbid
torture
11yearold
carcinogen
worship
diagnosed
synagogue
pharmacy
probation
ashtray
confiscated
rainfall
pump
battery
effectiveness
constant
companion
manage
affordable
iron
nut
confused
wrongly
footprint
describing
nbc
prof
infant
weighed
abused
worthy
compensation
promoted
stuart
oversight
robin
unlawful
dissenting
bargain
entertainment
sane
simpson
meal
lawton
intruder
emanuel
burst
transition
breath
throwing
outlined
ellen
shocking
frame
instructor
dose
carolyn
hike
marc
pursuing
imminent
randy
excluded
crackdown
renewal
justification
testifying
albert
artist
outcry
pursuit
postponed
choosing
harold
criticizing
soft
psychiatrist
archbishop
outlawing
transit
odd
bulb
stressed
misguided
alert
underground
amazing
blanket
surprisingly
stupid
fun
resist
revive
analyzed
donated
sophisticated
sounded
tornado
spitzer
diversity
monroe
conceal
civilized
organizing
milwaukee
firmly
congresswoman
maria
sandra
sympathy
campaigning
emotionally
manufactured
resigned
castro
affidavit
breyer
courtappointed
revenge
quentin
naacp
uzi
radiation
soul
shirt
milestone
interior
wash
located
deeper
permanently
laura
broadly
chairwoman
enable
favoring
notable
perpetrator
rendell
expired
stockton
vigil
patricia
arbitrary
troy
birthday
walton
electionyear
racketeering
cigaret
ab
freeze
monthly
documented
naturally
remedy
fossilfuel
advocated
examination
vigorously
dating
tightening
httpwwwnytimescom
reception
prevail
accountability
governmental
14th
eliminating
grim
bloody
midterm
mirror
incompetent
hogan
borough
manslaughter
punishable
trooper
amnesty
raton
ammo
lanza
strange
beautiful
counted
disruption
extinction
blind
uncomfortable
margaret
expectation
oldest
lined
virginian
readily
picking
afghanistan
credibility
journey
recording
improperly
michelle
campaigned
lynn
shaw
resumed
charter
investigated
ginsburg
hopkins
psychiatric
glendening
holster
pawn
sitin
nofly
paddock
briefing
greenland
ranking
abandon
soviet
berry
inhofe
oconnor
pine
tale
segment
absent
underlying
shelf
conflicting
convincing
echoed
slight
notorious
pelosi
assured
royal
alleging
castle
excessive
benjamin
song
shoe
badly
ave
disparity
swiftly
kaczynski
sleep
priest
temple
prosecuting
pulse
chickfila
innovation
clock
outline
youd
isolated
valuable
timetable
palo
formerly
billionaire
civilization
gradually
stunning
realistic
assure
decatur
favorable
cynthia
desert
vacation
endorsing
drama
steal
impression
transport
oliver
grocery
bin
defensive
unlimited
schoolchildren
mcveighs
strapped
shootout
marshal
mccollum
vaughn
accomplished
environmentally
policymakers
whitman
wellknown
triggered
pawlenty
wonderful
vapor
cheaper
hamilton
regret
perceived
quest
attribute
rushed
ratification
presenting
supposedly
curtail
strictly
crawford
fiveyear
jacob
relied
hosted
chase
fled
declares
emphasized
columbus
correctly
refers
invitation
duncan
norton
bos
disregard
clout
bride
shameful
sacred
reciprocity
chester
mentalhealth
cornyn
tavern
colt
sway
reward
skin
beneath
aircraft
ideal
refinery
survival
tag
meteorologist
calm
clearing
holy
alex
promotes
sealevel
significance
