marriage
gay
state
samesex
said
court
couple
right
would
law
union
new
issue
one
year
ban
legal
supreme
amendment
people
civil
bill
federal
benefit
vote
decision
two
lesbian
city
support
ruling
say
california
partner
church
republican
last
president
married
woman
group
u
judge
case
first
could
voter
constitutional
week
man
marry
also
time
constitution
mr
senate
day
family
many
house
measure
county
may
york
conservative
american
appeal
domestic
whether
license
make
campaign
massachusetts
public
proposition
justice
get
percent
act
equality
like
member
way
even
legislature
month
political
wedding
san
tuesday
debate
ballot
question
wednesday
think
district
child
dont
attorney
take
country
official
national
want
defense
government
come
general
washington
relationship
since
gov
opponent
democrat
religious
change
leader
employee
allow
supporter
bush
election
heterosexual
obama
united
passed
thursday
made
health
lawmaker
three
recognize
including
majority
legislation
argument
social
next
poll
advocate
monday
friday
francisco
ceremony
today
another
among
democratic
ago
still
mayor
approved
homosexual
equal
council
side
policy
nation
voted
governor
men
go
protection
party
life
part
jersey
going
office
tax
committee
news
put
challenge
yesterday
believe
discrimination
effort
ruled
partnership
community
long
recognition
lawyer
must
already
love
maryland
well
legally
asked
november
told
view
unconstitutional
back
florida
activist
much
expected
saying
opinion
need
see
plan
statement
matter
proposed
senator
john
sen
several
organization
university
end
human
virginia
become
position
legalize
school
filed
circuit
director
vermont
came
likely
show
thing
called
recent
place
across
similar
thats
action
know
traditional
four
june
lawsuit
step
sign
banning
number
minnesota
white
according
important
decide
give
favor
allowed
order
home
sex
mean
im
others
least
initiative
without
candidate
pas
found
allowing
clerk
proposal
fight
catholic
institution
every
former
march
recognized
move
though
word
million
call
georgia
business
work
battle
point
rule
spouse
company
legislative
christian
conference
far
good
sexual
wrote
congress
never
society
live
colorado
black
issued
stand
together
effect
opposed
might
full
care
bishop
struck
opposition
insurance
clear
administration
executive
history
performed
movement
yet
freedom
sunday
offer
wed
hearing
belief
citizen
toward
minister
became
service
left
rep
rev
victory
six
hawaii
based
board
reason
decided
le
high
presidential
m
took
local
oppose
around
america
night
st
able
let
clinton
referendum
north
hope
however
something
set
pastor
five
mark
meeting
unmarried
signed
assembly
earlier
center
force
fact
friend
doesnt
definition
cannot
person
making
consider
result
david
nearly
parent
past
began
status
provide
announced
session
within
line
process
value
methodist
second
god
hold
little
major
orientation
personal
later
face
different
trial
resolution
panel
liberal
open
utah
trying
department
whose
legalizing
find
although
given
straight
away
wife
commitment
really
soon
didnt
legislator
denied
chief
term
help
judicial
begin
held
stop
interview
gayrights
seeking
hour
protect
outside
doma
wrong
stay
hall
ask
lead
argued
openly
look
short
recently
george
nothing
carolina
west
use
define
passage
defend
got
letter
kind
interest
race
homosexuality
taking
cant
feel
supported
needed
legalized
world
fall
approval
early
michael
hear
used
individual
suit
grant
connecticut
historic
press
spokesman
taken
money
led
gop
strong
rejected
coalition
r
committed
idea
final
almost
dc
illinois
highest
brief
instead
town
moment
obamas
politics
approve
area
event
continue
v
wanted
atlanta
convention
plaintiff
gaymarriage
dozen
cuomo
request
comment
maine
message
added
resident
walker
heard
keep
registry
power
late
language
liberty
paul
big
tell
private
include
simply
abortion
decade
lower
thousand
worker
enough
cause
robert
authority
always
saturday
job
claim
rather
form
review
gave
brown
refused
pennsylvania
post
getting
despite
known
considered
lot
declared
there
fundamental
thought
divorce
key
win
best
wont
hundred
went
recognizing
chance
romney
iowa
push
marrying
return
along
head
try
theyre
coming
often
subject
representative
voting
read
report
july
seek
missouri
name
medical
elected
supporting
pay
brought
proponent
clergy
longer
response
joined
south
son
commission
growing
close
leading
everyone
either
better
changed
denomination
wisconsin
possible
hand
morning
ever
top
issuing
coverage
albany
religion
largest
seven
texas
bar
program
professor
husband
problem
extend
sponsor
released
leave
scheduled
fear
certain
overturn
chairman
politician
granted
he
security
announcement
ohio
system
large
statewide
run
defining
speaker
deny
attempt
faith
real
latest
yes
cost
daughter
father
front
ad
opposes
striking
role
block
fund
required
future
talk
moral
statute
respect
sure
christie
anything
story
behind
contract
petition
agency
elsewhere
columbia
failed
heart
denying
choice
protest
level
received
j
separate
agreed
hard
sent
forward
probably
living
giving
purpose
park
great
windsor
pride
focus
editor
half
college
isnt
capitol
episcopal
military
answer
study
defines
research
done
small
seems
seen
current
veto
file
opportunity
nationwide
street
basis
hampshire
anyone
vice
create
record
defeat
amend
sense
ordinance
single
immediately
turn
agenda
education
property
door
bloomberg
permit
quickly
violates
mother
war
oregon
raised
concern
responsibility
young
summer
expert
working
offered
chamber
survey
banned
divided
eight
vow
provision
book
spring
impact
student
available
significant
moved
join
oppositesex
following
third
asking
turned
charge
ground
start
urged
discussion
employer
prevent
bring
overturned
rally
andrew
declined
opposing
police
remains
backer
remain
calling
floor
financial
legalization
gender
boston
island
pending
landmark
difference
martin
boy
jr
nov
happen
standing
margin
publicly
address
play
beach
sued
follow
free
hospital
receive
valid
allows
deal
upheld
blessing
advocacy
voice
delegate
richard
document
showed
violated
treated
kennedy
argue
antigay
else
denver
pm
mind
course
w
culture
special
oklahoma
minority
bisexual
site
defined
choose
judiciary
commissioner
manhattan
cheney
potential
perhaps
particularly
rabbi
jurisdiction
april
strike
example
agree
primary
transgender
signature
death
written
emotional
weekend
limit
prohibit
bible
filing
9th
age
considering
share
regardless
adult
apply
forced
los
crowd
offering
firm
evidence
annual
challenged
involved
common
william
raise
james
looking
doubt
january
acceptance
challenging
rest
waiting
perform
arguing
congregation
superior
mary
speech
introduced
whats
nuptials
angeles
voterapproved
require
article
appeared
created
principle
endorsed
jan
register
medium
interracial
expect
lgbt
basic
included
tried
attack
illegal
adopted
tampa
newsom
controversial
entitled
limited
august
thomas
certainly
difficult
someone
spent
chicago
stance
practice
especially
sought
constitutionality
beyond
weve
attention
list
stage
meet
l
spokeswoman
bay
application
secretary
starting
actually
senior
moving
repeal
nine
ready
died
sponsored
running
lambda
shift
changing
arizona
overwhelmingly
control
treat
throughout
staff
exactly
outcome
followed
institute
baptist
barack
parade
celebration
chris
building
helped
charged
lost
page
room
association
divisive
granting
gathered
wasnt
loving
appears
mitt
provided
affect
television
jim
ive
feeling
associated
behalf
fighting
using
old
accept
neither
michigan
refuse
tradition
discriminatory
certificate
b
pushing
speak
counsel
true
seem
census
registered
seemed
treatment
paterson
felt
reelection
presbyterian
struggle
strongly
spoke
access
increase
prominent
smith
noted
californian
guarantee
ultimately
eye
paper
joint
stood
finding
due
met
alliance
central
column
evangelical
popular
beginning
option
afternoon
passing
pressure
equally
shall
largely
happened
risk
reporter
southern
split
reach
becoming
youre
figure
everything
cultural
usa
wouldnt
web
started
clearly
closer
stopped
kerry
fellow
appear
ability
canada
defending
includes
mormon
christ
break
base
santa
worked
simple
raising
palm
frank
requires
eligible
e
fair
planning
kid
arrangement
reject
february
promise
backed
fairness
holding
goal
body
defeated
prohibition
upon
performing
drive
feb
opposite
reported
congressional
c
talking
meaning
date
reached
conducted
meanwhile
ended
tom
finally
barring
politically
ordered
intended
test
jose
scott
momentum
gain
privilege
endorsement
sort
celebrate
bob
appellate
controversy
olson
happens
arent
donor
omalley
understand
economic
deeply
strategy
concerned
adding
necessary
bad
estate
hate
extended
unless
email
expressed
planned
consequence
writer
enacted
hill
manager
uphold
louis
add
ahead
gavin
currently
dean
wish
diocese
reform
mexico
unlikely
increasingly
honor
newspaper
field
speaking
involving
income
leadership
providing
promised
acknowledged
schwarzenegger
male
roman
video
foundation
series
testimony
avoid
whole
ny
commonwealth
previously
colleague
vowed
teaching
chapel
winning
serve
adoption
wait
oct
serious
sept
hurt
believed
bureau
online
prohibited
team
ensure
editorial
remark
particular
appealed
discus
reality
note
officer
joseph
represents
progress
swing
mike
club
indiana
minneapolis
african
mass
author
advance
huge
deciding
budget
urging
becomes
edward
sometimes
minnesotan
yorkers
charles
topic
endorse
chickfila
critic
rate
effectively
phone
higher
clause
prohibits
threat
rhode
declaring
project
saw
attitude
visit
outofstate
relation
powerful
prop
compromise
focused
facing
host
drew
discriminate
paltz
adopt
hoped
land
immigration
twothirds
mostly
patrick
count
september
williams
longtime
box
joe
king
broad
extending
pension
recognizes
stephen
generation
standard
violate
conclusion
owner
philadelphia
baltimore
period
release
knight
reaction
thinking
marital
immediate
motion
specifically
officially
veteran
jerry
regarding
anthony
determine
village
legality
vaughn
class
nominee
fire
ill
otherwise
guest
witness
delay
brian
protester
greater
demand
generally
percentage
happy
information
bride
near
domesticpartner
version
sanction
deserve
gun
biggest
trend
opening
independent
spending
middle
lobbying
indeed
kentucky
enjoy
gone
approach
platform
cited
musgrave
promote
enter
calif
shouldnt
population
eventually
thus
putting
possibility
personally
inheritance
opened
knew
section
pat
born
critical
addition
tim
radio
faced
ought
provides
cover
prohibiting
brother
creating
spousal
organizer
division
conversation
lifestyle
jesus
evolving
suggested
agreement
fought
conflict
brooklyn
tie
knot
franciscos
star
sister
campus
backing
teacher
supervisor
shes
overturning
situation
economy
arkansas
proud
entire
headed
nature
divide
polling
additional
development
road
century
represent
emergency
queen
del
rick
related
success
data
light
leaving
cut
amending
couldnt
main
outlaw
obligation
december
credit
moderate
predicted
sound
apparently
steve
directly
representing
dollar
losing
equivalent
unanimously
described
therefore
limiting
shot
davis
send
kansa
whatever
served
aug
experience
declaration
previous
founder
quite
carry
inside
harm
forum
nationally
essentially
evolution
continues
influence
continued
creech
october
aid
lack
refusing
handful
peter
bit
embrace
designed
tv
